{
  "jobs": [
    {
      "id": 91549,
      "url": "https://jobicy.com/jobs/91549-senior-manager-customer-support",
      "jobSlug": "91549-senior-manager-customer-support",
      "jobTitle": "Technical Support Engineer",
      "companyName": "CrossFit",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/6966c9ea04a0e651f69f113113a45e27.png",
      "jobIndustry": ["Technical Support"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "CrossFit is looking to hire a dedicated Technical Support Engineer to join our dynamic IT Operations team. The successful candidate will serve as the front-line support, playing a critical role in addressing and resolving technical queries from our user base. Besides, you will be instrumental in creating, maintaining, and enhancing process documentation. Collaboration with other&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>CrossFit is looking to hire a dedicated Technical Support Engineer to join our dynamic IT Operations team. The successful candidate will serve as the front-line support, playing a critical role in addressing and resolving technical queries from our user base. Besides, you will be instrumental in creating, maintaining, and enhancing process documentation. Collaboration with other members of the IT Operations team is essential, ensuring that our IT infrastructure runs smoothly and our internal clients receive top-notch support.</div>\n<h2><b>RESPONSIBILITIES</b></h2>\n<ul>\n<li>Support Desk Management:\n<ul>\n<li>Diagnose and troubleshoot technical issues, including software, hardware, network, and other IT-related challenges.</li>\n<li>Respond to support tickets, emails, and phone calls in a timely and professional manner.</li>\n<li>Ensure all support incidents are logged and tracked to resolution in the support desk system.</li>\n</ul>\n</li>\n<li>Process Documentation:\n<ul>\n<li>Develop, write, and maintain standard operating procedures, manuals, and other documentation for IT processes.</li>\n<li>Regularly review and recommend improvements to existing processes to enhance efficiency and user experience.</li>\n<li>Facilitate knowledge sharing by regularly updating and distributing documentation among the team.</li>\n</ul>\n</li>\n<li>Collaboration &amp; Teamwork:\n<ul>\n<li>Work closely with other members of the IT Operations team to address complex technical issues.</li>\n<li>Assist in the deployment, maintenance, and upgrade of IT infrastructure, tools, and systems.</li>\n<li>Participate in regular team meetings, contributing ideas and feedback to improve team performance and service delivery.</li>\n</ul>\n</li>\n</ul>\n<h2><b>KNOWLEDGE AND SKILL</b></h2>\n<ul>\n<li>Strong knowledge of MacOS and Windows devices in a corporate environment.</li>\n<li>Excellent problem-solving skills with the ability to diagnose and troubleshoot technical issues.</li>\n<li>Strong written and verbal communication skills, with a keen eye for detail.</li>\n<li>Ability to prioritize and manage multiple tasks simultaneously.</li>\n<li>Familiarity with support desk software and mobile device management applications.</li>\n<li>Certifications like ITIL, CompTIA A+, or Microsoft Certified: Desktop Support Technician.</li>\n<li>Experience in creating and maintaining technical documentation.</li>\n<li>Familiarity with JumpCloud, ZScaler, Jira, Google Workspace.</li>\n<li>Passion for CrossFit and our mission to be the world&#8217;s leading platform for health, happiness and performance</li>\n</ul>\n<h2><b>EDUCATION/EXPERIENCE</b></h2>\n<div>3 years of experience in technical support or a similar role.</div>\n<h2><b>WHAT WE OFFER</b></h2>\n<ul>\n<li>Rich Medical, Dental, and Vision plans</li>\n<li>Unlimited Paid Time Off––empowering you to unplug whenever and however you need to</li>\n<li>Flexible spending account and 401(k) with employer matching at 5%</li>\n<li>CrossFit Gym Membership Reimbursement</li>\n<li>CrossFit Courses Benefit</li>\n<li>Partnership Perks</li>\n</ul>\n</div>",
      "pubDate": "2024-02-26 08:28:43"
    },
    {
      "id": 103591,
      "url": "https://jobicy.com/jobs/103591-field-marketing-campaigns",
      "jobSlug": "103591-field-marketing-campaigns",
      "jobTitle": "Field Marketing, Campaigns",
      "companyName": "Airbase",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200913204329-189013.png",
      "jobIndustry": ["Marketing &amp; Sales"],
      "jobType": ["full-time"],
      "jobGeo": "Costa Rica,  Mexico",
      "jobLevel": "Any",
      "jobExcerpt": "Airbase is the top-ranked modern spend management platform for businesses with 100-5,000 employees. It’s the best way to control spending, close the books faster, and manage financial risk. Airbase software offers modules for Guided Procurement, Accounts Payable Automation, Expense Management, and a flexible corporate card program on a single collaborative platform. It can be implemented&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<div>Airbase is the top-ranked modern spend management platform for businesses with 100-5,000 employees. It’s the best way to control spending, close the books faster, and manage financial risk. Airbase software offers modules for Guided Procurement, Accounts Payable Automation, Expense Management, and a flexible corporate card program on a single collaborative platform. It can be implemented in full or as individual modules. Airbase automates all spending workflows and guides the process for all purchases — procure, pay, close. It brings efficiency to complex business processes like multi-stakeholder compliance and accounting needs like multi-subsidiaries, amortizations, and purchase orders. Flexible intake and approval workflows ensure oversight across all stakeholders and spend compliance. Airbase integrates with your other business systems and seamlessly syncs to popular general ledgers. Employees and accounting teams love using Airbase.</div>\n</div>\n<h2><strong>About the Role:</strong></h2>\n<p>As a Field Marketing Manager, Campaigns, you will play a central role in fostering collaboration between cross-functional teams to build and manage field marketing activities aimed at fueling pipeline growth through integrated cross-functional campaigns, focused outbound campaigns, and supporting events. The ideal candidate will have a robust background in marketing campaign management, proficiency in key marketing tools, and experience with ABM approaches.</p>\n<p>This role is pivotal in managing various aspects of marketing campaigns, you’ll use a variety of tactics including, email, scripts, digital, live events, nurture emails, and programmatic advertising. You will work closely with multiple cross-functional partners within Marketing, Product Marketing, Sales, Sales Enablement, Content Marketing, Operations, and Analytics to identify audiences and opportunities, implement campaigns, measure impact, and share key takeaways.</p>\n<h2><strong>What You’ll Do:</strong></h2>\n<ul>\n<li>Drive the development and acceleration of pipeline, emphasizing net new account acquisition.</li>\n<li>Drive alignment of messaging; help to ensure that the right content messaging is delivered to the right audience at the right time.</li>\n<li>Manage marketing activities and campaigns to ensure projects are completed cross-functionally.</li>\n<li>Maintain accurate budget, expense tracking, and forecasting to optimize resource allocation.</li>\n<li>Initiate and manage nurture programs to accelerate prospects through the sales funnel.</li>\n<li>Track and report on campaign costs, performance, and ROI.</li>\n<li>Provide regular insights into campaign performance, enabling data-driven decision-making.</li>\n</ul>\n<h2><strong>About You</strong>:</h2>\n<ul>\n<li>Proven experience in building and accelerating sales pipeline, focusing on net new account acquisition by focusing on target accounts.</li>\n<li>Exceptional attention to detail in execution while maintaining a strategic mindset with excellent organizational and time management skills.</li>\n<li>Clear and effective communication with critical thinking and creative problem-solving skills.</li>\n</ul>\n<h2><strong>Preferred Technology Competencies:</strong></h2>\n<ul>\n<li>Zoom and Google Suite (Especially Calendar, Drive, Docs, Sheets, and Slides), Asana, or experience with other project management software.</li>\n<li>Experience with ABM tech stack (e.g. 6sense, Demandbase), HubSpot, Salesforce (SFDC basic navigation, with report creation being a plus).</li>\n</ul>\n<div class=\"content-conclusion\">\n<p>We offer competitive cash compensation and equity packages, comprehensive benefit plans, parental leave, and generous time off for all of our full-time roles.</p>\n</div>",
      "pubDate": "2024-02-26 08:27:46"
    },
    {
      "id": 102250,
      "url": "https://jobicy.com/jobs/102250-content-strategist-2",
      "jobSlug": "102250-content-strategist-2",
      "jobTitle": "Content Strategist",
      "companyName": "Protective Life",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/ebc45bf88bcb06f3fff2a9466eba8b4c.jpeg",
      "jobIndustry": ["Copywriting &amp; Content"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "We help protect our customers against life’s uncertainties. Regardless of where you work within the company, you’ll be helping provide protection and peace of mind when our customers need it most. The Content Marketing Strategist builds and leads campaign content strategy, framework, and optimization across multiple audience segments and delivery channels to attract, engage, build trust, preference, and loyalty for&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We help protect our customers against life’s uncertainties. Regardless of where you work within the company, you’ll be helping provide protection and peace of mind when our customers need it most.</div>\n<div></div>\n<div>The Content Marketing Strategist builds and leads campaign content strategy, framework, and optimization across multiple audience segments and delivery channels to attract, engage, build trust, preference, and loyalty for our distributors and consumers. The Content Marketing Strategist will collaborate with key stakeholders across the enterprise to ensure strategies are aligned with the goals of the organization and will work closely with other Creative and Digital teams to consult on execution.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>RESPONSIBILITIES</h2>\n<ul>\n<li>Deeply understands business goals, audience segments, and purchase funnels.</li>\n<li>Builds the content anatomy of integrated initiatives based on business goals, including campaign hierarchies and their related programs/offers/tactics, funnel stages, and message hierarchies.</li>\n<li>Collaborates with other functional leaders to support resourcing and workflow needs to establish content creation efficiency with internal and external teams</li>\n<li>Indirectly influences a creative and digital team to carry out the vision and strategy. Audits and/or signs off on work to ensure flawless execution of the brand and content strategy.</li>\n<li>Collaborates and works with a variety of stakeholders and incorporates opinions and thoughts without losing the key theme.</li>\n<li>Understands and communicates technical subjects clearly, concisely, and engagingly.</li>\n<li>Collaborates with IM planners, UX content strategists, and analytics partners to understand marketing performance and adapt messaging and channels, based on performance metrics.</li>\n<li>Follows the marketing process to meet legal, compliance, and internal audit standards.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>QUALIFICATIONS</h2>\n<ul>\n<li>10+ years of content marketing strategy experience, with a bachelor’s degree in marketing, journalism or communications or related field</li>\n<li>Proven track record as an innovative and collaborative content marketing strategist – with a background in content B2B marketing (specifically financial services, and ideally in life and annuities), copywriting, or journalism</li>\n<li>Strong analytical skills, ability to manage multiple projects, and enthusiasm for data-driven marketing</li>\n<li>Ability to manage tight deadlines and hold team members to deadlines</li>\n<li>High-level thinker who also has a penchant for keeping track of details</li>\n<li>Ability to build strong working relationships across all levels of the organization</li>\n<li>Excellent written communication and presentation skills</li>\n<li>Experience in influencing, mentoring, and coaching a team of creative professionals</li>\n<li>Excellent judgment and creative problem-solving skills, including negotiation and conflict-resolution skills</li>\n<li>Excellent and persuasive communicator</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Protective’s targeted salary range for this position is $80,000 to $100,000. Actual salaries may vary depending on factors, including but not limited to, job location, skills, and experience. The range listed is just one component of Protective’s total compensation package for employees.</div>\n<div></div>\n<div>This position also offers additional incentive opportunities through an annual incentive based on individual and Company performance.</div>\n</div>\n<div></div>\n<div>\n<div>At Protective, we are committed to providing an inclusive culture where all employees are able to fully contribute and thrive. Our goal is to grow and develop our people, attract diverse talent and support strong, diverse communities.</div>\n</div>",
      "pubDate": "2024-02-26 08:25:40",
      "annualSalaryMin": "80000",
      "annualSalaryMax": "100000",
      "salaryCurrency": "USD"
    },
    {
      "id": 74737,
      "url": "https://jobicy.com/jobs/74737-paid-media-account-manager-enterprise",
      "jobSlug": "74737-paid-media-account-manager-enterprise",
      "jobTitle": "Paid Media Account Manager, Enterprise",
      "companyName": "Atomic",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/dfb1cc8654c3b08bce1117b36f882000.png",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Adentro solves a major problem for brick-and-mortar businesses—the majority of advertising is online, yet over 90% of purchasing still happens offline . Our platform links the two by automatically tracking customer visits, building rich customer profiles, targeting communication more precisely and directly measuring in-store impact. We are backed by some of the biggest names in&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Adentro solves a major problem for brick-and-mortar businesses—the majority of advertising is online, yet over 90% of purchasing still happens offline . Our platform links the two by automatically tracking customer visits, building rich customer profiles, targeting communication more precisely and directly measuring in-store impact.</div>\n<div></div>\n<div>We are backed by some of the biggest names in Silicon Valley. If you’re interested in joining a team that is changing the way the world does business, this might be the place for you.</div>\n<div></div>\n<div>You will be responsible for the client success, retention, and expansion of the Adentro account book by functioning as a digital strategist and day-to-day contact for current clients. You will oversee your account book managing campaign flights, router health, creative projects, performance analyses, expansion planning, renewal negotiation, and strategic planning. You will be expected to maintain accurate client health reporting, high client retention rates, and secure upsells and expansions. You will liaise with the campaign manager to confirm timely launches, coordination on campaign goals and strategy and ensuring we’re meeting and exceeding client expectations.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What You&#8217;ll Do</h2>\n<ul>\n<li>Accountable and responsible for location gross churn, MRR, and client satisfaction for all assigned book of core &amp; ads accounts.</li>\n<li>Function as day-to-day POC for campaign management, creative, hardware issues, performance reporting, Core performance and utilization of the platform etc.</li>\n<li>Provide regular reporting to the client team on campaign timelines, creative projects, ads campaign performance, and other needs.</li>\n<li>Provide custom reporting and presentation materials for client renewal conversations, upsells, and expansions.</li>\n<li>Core related activities &#8211; importing and exporting customer lists, reporting, labels, portal setup, down router comm. etc.</li>\n<li>Collaborate with the sales team on client presentations, QBRs, monthly reviews, and expansion opportunities.</li>\n<li>Function as day-to-day SME on campaign setup, execution, performance, strategy recommendations, and ads analysis on social and programmatic display platforms.</li>\n<li>Provide regular updates/reporting to client team on campaign launches, performance, optimizations, and tests.</li>\n<li>Monitor and maintain accurate campaign timelines, launches, budgets, pacing checks, performance to goals, and other projects.</li>\n<li>Monitor and maintain accurate campaign timelines, launches, budgets, performance to goals, and other projects.</li>\n<li>Function as the client advocate when working with sales and campaign managers etc to ensure we’re providing the best support and performance possible.</li>\n<li>Support training initiatives to improve overall digital marketing and ads knowledge.</li>\n<li>Collaborate with other departments to address challenges in product, engineering, etc.</li>\n<li>Be an advocate to show the clients “why” they should continue to invest, positioning renewal, recommendations and/or opportunities.</li>\n<li>Negotiate high-profile strategic deals with account team and client to ensure success.</li>\n<li>Maintain high level of familiarity and knowledge of digital marketing landscape, competing entities, and industry.</li>\n<li>Be a data-driven leader.</li>\n<li>Comply with all company policies and procedures.</li>\n<li>Success KPIs of Retention, Revenue Growth, Scalable Opportunities, CrossSell, Upsell, Growth Planning, and Pacing.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What You Have</h2>\n<ul>\n<li>2-4 years of experience managing Mid-Market or Enterprise Accounts and Strategy and/or managing social media ad buying campaigns.</li>\n<li>Experience launching and optimizing campaigns through Facebook Ads Manager, DSPs, networks and/or exchanges, specifically Trade Desk.</li>\n<li>Track record of success by meeting or exceeding KPI’s in previous positions.</li>\n<li>Analytical skills tracking client benchmarks and KPIs.</li>\n<li>Experience building relationships with clients and creating digital marketing strategies and showcasing performance to illustrate value.</li>\n<li>Skilled in digital marketing, programmatic, and social (Instagram/Facebook). Tiktok + CTV experience is preferred as well.</li>\n<li>Proven success in data-storytelling and presentation building.</li>\n<li>Ability to manage through high profile projects and competing priorities both internally and externally.</li>\n<li>A time management &amp; organizational guru who has the proven ability to work in a fast paced and ever evolving environment.</li>\n<li>Ability to work with minimal supervision managing multiple projects, as well as collaboratively working with colleagues of other functional areas to achieve common goals in a remote environment.</li>\n<li>Pixel + Google Tag Manager Experience (preferred).</li>\n<li>Ability to easily build rapport with a wide variety of clients.</li>\n<li>Ability to identify and proactively solve problems.</li>\n<li>Dynamic personality and high energy.</li>\n<li>Strong business acumen and ability to analyze data.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Our Values</h2>\n<ul>\n<li><b>Be Committed: </b>Work hard, Own the problem, Learn</li>\n<li><b>Create Trust: </b>Do what you say, Create trust with our Clients and Colleagues</li>\n<li><b>Be Bold: </b>Experiment, Speak up, Hope is not a plan</li>\n<li><b>Deliver High Performance: </b>Prepare, Commit, (over) Deliver</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks and Benefits</h2>\n<ul>\n<li>Excellent and comprehensive health plans (medical (including HSA/FSA and free access to One Medical), dental, vision, 401K)</li>\n<li>Flexible Vacation Policy</li>\n<li>Enhanced Parental Leave Programs</li>\n<li>Organized volunteer events to give back to our community</li>\n<li>Off-sites, events and happy hours</li>\n<li>Work from “Home/where you need” to get the job done</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div>$75,000 &#8211; $85,000 a year</div>\n</div>\n<div></div>\n<div>\n<div>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</div>\n</div>",
      "pubDate": "2024-02-26 08:23:55",
      "annualSalaryMin": "75000",
      "annualSalaryMax": "85000",
      "salaryCurrency": "USD"
    },
    {
      "id": 75271,
      "url": "https://jobicy.com/jobs/75271-sr-software-engineer-windows-desktop-app",
      "jobSlug": "75271-sr-software-engineer-windows-desktop-app",
      "jobTitle": "Sr. Software Engineer, Windows Desktop App",
      "companyName": "DuckDuckGo",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/ab8415dd5798a360323ce06beaf30c35.png",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Senior",
      "jobExcerpt": "Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we&#8217;ve been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. Our app is now downloaded more than 78M times a year,&#8230;",
      "jobDescription": "<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we&#8217;ve been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we&#8217;ve been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including Email Protection, App Tracking Protection and our first-ever Desktop Apps for Mac and Windows.</p>\n<p>We’re looking for a <strong>Senior Software Engineer, Windows Desktop App</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.</p>\n<h2><strong>The Opportunity</strong></h2>\n<p>In this role, you will work on the team responsible for launching our first ever DuckDuckGo Privacy App for Windows. You&#8217;ll collaborate with Product Managers, Designers, and Engineers across Native Apps to craft a world-class browser with embedded privacy features that will revolutionize the way people search, surf, and exist online.</p>\n<p>You will be critical to the successful launch of this product and responsible for taking pieces of the puzzle and autonomously building solutions to get us closer to our first release. You will help define the roadmap, take ownership of significant application features and experiment with ways to improve them.</p>\n<p>You will lay the foundations of what will become one of DuckDuckGo&#8217;s flagship products and critical levers for growing privacy online.</p>\n<h2><strong>What You Will Bring to DuckDuckGo</strong></h2>\n<ul>\n<li>Experience implementing ideas from scratch, owning major application features, and taking responsibility for their maintenance and improvement over time.</li>\n<li>Experience participating in technical architecture decisions for complex products, essentially shaping the software architecture of a consumer product.</li>\n<li>Experience building at least one desktop application (ideally with WPF, UWP, WinUI, WinForms, or other relevant .NET UI).</li>\n<li>An advanced level of programming expertise, with knowledge of C#. We currently use .NET 6.</li>\n<li>A significant level of experience in building customer facing applications, including crafting user interfaces.</li>\n<li>Deep understanding of software design patterns such as MVVM, MVP, etc.</li>\n<li>Event-driven programming (e.g., using Rx.NET) experience is considered an advantage.</li>\n</ul>\n<h2><strong>How We Will Support You</strong></h2>\n<p>Our core values &#8212; build trust, question assumptions, and validate direction &#8212; underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.</p>\n<ul>\n<li><strong>Remote First, Always</strong>: We&#8217;ve always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li>\n<li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li>\n<li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li>\n<li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.</li>\n</ul>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, Team Member Support Guide, which explains how we make your well-being a priority.</p>\n<h2><strong>Compensation</strong></h2>\n<p>Annual compensation: <strong>$176,000</strong> <strong>USD</strong> and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<h2><strong>Diversity, Equity, and Inclusion</strong></h2>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants, and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <a rel=\"noopener\">careers@duckduckgo.com</a> to let us know the nature of your request.</p>\n<p>If you think you might thrive in this environment, we would love to hear from you.</p>\n<h2><strong>Please note that:</strong></h2>\n<ul>\n<li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li>\n<li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week.</li>\n<li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team.</li>\n<li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li>\n</ul>",
      "pubDate": "2024-02-26 08:22:09",
      "annualSalaryMin": "176000",
      "annualSalaryMax": "",
      "salaryCurrency": "USD"
    },
    {
      "id": 91547,
      "url": "https://jobicy.com/jobs/91547-customer-support-associate-11",
      "jobSlug": "91547-customer-support-associate-11",
      "jobTitle": "Call Center Assistant",
      "companyName": "Pearson",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/c80907b6d4b64a0bd9295e304bf1ac8a.jpg",
      "jobIndustry": ["Customer Success"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "At Pearson, we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always reexamining the way people learn best, whether it’s one child in our own backyard or an education community across the globe. We&#8230;",
      "jobDescription": "<p>At Pearson, we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always reexamining the way people learn best, whether it’s one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology — and each other to surpass these boundaries — we create seeds of learning that become the catalyst for the world’s innovations, personal and global, large and small.</p>\n<h2><strong>Education, Skills, and Knowledge:</strong></h2>\n<ul>\n<li>High School Diploma or equivalent required</li>\n<li>Must possess excellent customer service skills.</li>\n<li>Call center experience is preferred</li>\n<li>A very friendly and helpful attitude and the ability to manage simultaneous tasks</li>\n<li>Ability to work as a member of a team is required</li>\n<li>Must have excellent oral and written communication skills</li>\n<li>Excellent attendance is required</li>\n<li>Experience working with a PC and a Windows environment is required</li>\n<li>Experience working with a Mac is preferred, but not required</li>\n</ul>\n<h2><strong>Basic Purpose and Objectives:</strong></h2>\n<p>Provide exceptional inbound and outbound general and technical support to internal customers by demonstrating a friendly and helpful attitude, promptness, attentiveness, and a focus on resolving issues efficiently on the first contact</p>\n<h2><strong>Organizational Relationships</strong></h2>\n<p>Reports to and direction received from:</p>\n<ul>\n<li>Scoring Support Shift Supervisors (Primary)</li>\n<li>Scoring Support Manager (Secondary)</li>\n</ul>\n<h2><strong>Overall Functions and Responsibilities:</strong></h2>\n<ul>\n<li>These positions will include shifts which cover center hours from 7am to 9pm Monday through Friday and 9am and 5pm on Saturday and Sunday</li>\n<li>May be required to work a rotating shift schedule and weekends</li>\n<li>Responsible for providing accurate answers to internal customer questions or concerns in a courteous, efficient, and customer-service focused manner via phone, email, or chat</li>\n<li>Responsible for diagnosis and complete resolution of technical issues in a courteous, efficient, and customer-service focused manner via phone, email or chat using documented solutions</li>\n<li>Responsible for calling remote employees in an efficient, courteous, and supportive manner</li>\n<li>Serve as an escalation point as needed to the appropriate department for resolution</li>\n<li>Responsible for independent and timely resolution of routine issues, and for notifying management of non-routine issues that need immediate attention</li>\n<li>Provide complete documentation of issues handled</li>\n<li>Responsible for staying current on issues that impact our internal customers and competent by continually referring to and utilizing support resources</li>\n<li>Perform other related duties as assigned</li>\n</ul>\n<h2><strong>Working Conditions</strong></h2>\n<ul>\n<li>Office environment</li>\n<li>Remote work</li>\n<li>Hours may vary or change, depending upon the needs of business</li>\n</ul>\n<p>***This will be a remote (work from home) position.  Equipment will be provided for this assignment.</p>",
      "pubDate": "2024-02-26 08:21:26"
    },
    {
      "id": 103589,
      "url": "https://jobicy.com/jobs/103589-senior-software-developer-4",
      "jobSlug": "103589-senior-software-developer-4",
      "jobTitle": "Senior Software Developer",
      "companyName": "Pearson",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/c80907b6d4b64a0bd9295e304bf1ac8a.jpg",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "Spain",
      "jobLevel": "Senior",
      "jobExcerpt": "At Pearson, we are committed to a world that is always learning and to our talented team who makes it all possible. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. With a rich heritage that combines&#8230;",
      "jobDescription": "<p>At Pearson, we are committed to a world that is always learning and to our talented team who makes it all possible. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. With a rich heritage that combines 150 years of experience in publishing with the latest learning technology and digital services, we help people learn whatever, wherever and however they choose.</p>\n<h2><strong>Role Overview</strong></h2>\n<p>The English Language Learning (ELL) division of Pearson is looking for a talented and motivated professional to join our growing organization as Senior Software Engineer. In this exciting role you will be responsible for analysis, design, implementation, and automated testing as a key member of a high-performing, experienced team. You will use industry best practices while producing high-quality solutions in an agile environment. You will understand that needs of our users and anticipate, innovate, and ideate with our product teams. You will be essential in ensuring the team&#8217;s success; working closely as a mentor, reviewing their work, and supporting them to produce their best work across a diverse set of areas, including assessment delivery, scoring technology and services, infrastructure, identity management and e-commerce. You will also be responsible for maintaining and supporting mission-critical applications, as necessary.</p>\n<h2><strong>The Team</strong></h2>\n<p>This position is on a team that develops and maintains client and candidate-facing web and mobile assessment delivery and automated scoring solutions that are designed to serve a global user base. We deliver and score millions of language assessments annually across a wide range of industries. We also offer API products that integrate and support several client applications and platforms to support our customers’ diverse workflows. There is a continuous stream of complex and challenging work with a direct impact on the candidate&#8217;s experience.</p>\n<p>We are looking for passionate and driven technologists who flourish in a highly collaborative environment where they can think creatively, challenge the status quo,</p>\n<p>and innovate both products and processes. You will be surrounded by like-minded people in a highly collaborative team environment.</p>\n<h2><strong>The Senior Software Developer will:</strong></h2>\n<ul>\n<li>Analyze, design, develop, and test software components and applications for one of the largest digital assessment providers in the world.</li>\n<li>Work on an agile engineering team writing maintainable and scalable code for software components and influencing team decisions.</li>\n<li>Implement designs following Pearson coding standards and industry best practices.</li>\n<li>Create testable code and implement automated unit, integration, and functional tests as part of new product development.</li>\n<li>Collaborate with stakeholders to imagine, design, develop, test, and launch software that impacts our customers.</li>\n<li>Use technology to solve difficult problems. Define a design, turn it into high quality code, and deliver it on schedule.</li>\n<li>Independently clarify technical requirements, assess development estimates, and apply a broad range of design approaches.</li>\n<li>Review the code of other team members and provide constructive direction.</li>\n<li>Drive continuous improvement of software quality, customer experience, and maintainability of products/features.</li>\n<li>Mentor and train new team members; actively collaborate with others within and outside of the team</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>Bachelor&#8217;s degree in computer science or equivalent technology discipline</li>\n<li>Extensive professional software development experience in an Agile environment.</li>\n<li>Proven track record of experience with customer-facing Web Application design/development</li>\n<li>Full stack experience (Java, NoSQL, SQL, HTML5, CSS3, JavaScript, node.js)</li>\n<li>Experience using AWS technologies at scale in a production environment such as API Gateway, SQS, SNS</li>\n<li>Wide experience with Non-functional requirements such as Responsive Web Design, Accessibility, Security, I18N, Performance and/or Scalability</li>\n<li>Knowledge of application servers, SOA, automation tools and build tools (Yarn, npm, or similar).</li>\n<li>Well-rounded engineering skills; full-stack development experience &#8211; Web Services API Development</li>\n<li>Experience with HTTP/2, PWA, Serverless, Microservices, CI/CD, and cross-platform development</li>\n<li>Experience communicating with users, other technical teams, and senior management to collect requirements, describe software product features, deliver technical designs, and documentation.</li>\n<li>Experience taking a lead role developing complex software systems that have successfully been delivered to customers</li>\n<li>A high-quality bar; unit testing, code reviews, test automation tools, continuous integration &amp; deployment, and a preference for agile methods</li>\n<li>Strong business and technical vision</li>\n</ul>",
      "pubDate": "2024-02-26 08:17:07"
    },
    {
      "id": 91551,
      "url": "https://jobicy.com/jobs/91551-senior-content-specialist-2",
      "jobSlug": "91551-senior-content-specialist-2",
      "jobTitle": "Senior Content Specialist",
      "companyName": "Protective Life",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/ebc45bf88bcb06f3fff2a9466eba8b4c.jpeg",
      "jobIndustry": ["Copywriting &amp; Content"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "We help protect our customers against life’s uncertainties. Regardless of where you work within the company, you’ll be helping provide protection and peace of mind when our customers need it most. The Senior Content Specialist collaborates with our in-house creative and strategy teams to deliver a wide range of content crafted to inform, engage, and delight their intended audience(s). This&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We help protect our customers against life’s uncertainties. Regardless of where you work within the company, you’ll be helping provide protection and peace of mind when our customers need it most.</div>\n<div></div>\n<div>The Senior Content Specialist collaborates with our in-house creative and strategy teams to deliver a wide range of content crafted to inform, engage, and delight their intended audience(s). This includes sales enablement tools, presentations, advertisements, direct mail, event support, newsletters, and more.</div>\n<h2>RESPONSIBILITIES</h2>\n</div>\n<div class=\"section page-centered\">\n<ul>\n<li>Research, conceptualize, and compose innovative content that supports marketing strategies and creative briefs.</li>\n<li>Demonstrated ability to translate complex ideas from multiple reference sources into stories that engage and delight the target audience(s).</li>\n<li>Collaborate with Associate Creative Directors, peers, and key stakeholders on how to best achieve defined objectives.</li>\n<li>Ensure consistency and quality across all written content.</li>\n<li>Help to foster a culture of inclusion, innovation, and creativity.</li>\n<li>Proactively manage deadlines across multiple projects in a fast-paced, Agile environment.</li>\n<li>Use your subject matter expertise to help elevate our brand strategy.</li>\n<li>Develop a deep understanding of the products and services you will be marketing and how they are nuanced across distribution channels.</li>\n<li>Ability to pitch creative concepts to in-house customers.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>QUALIFICATIONS</h2>\n<ul>\n<li>5+ years’ experience producing copy across print channels (and a portfolio of your work)</li>\n<li>Ability to simplify complex, highly technical financial concepts to a non-technical audience(s)</li>\n<li>An iterative and feedback-driven approach to writing, testing, and editing copy.</li>\n<li>Experience using technology to collaborate, such as Workfront, TFS, Jira, etc.</li>\n<li>Bachelor’s degree preferred, with a concentration in journalism, marketing, communications, or related discipline.</li>\n<li>Knowledge of sales and marketing processes, as well as investment products and services, are a plus.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><strong>Salary and Incentives</strong></h2>\n<div>Protective’s targeted salary range for this position is $71,000-90,000. Actual salaries may vary depending on factors, including but not limited to, job location, skills, and experience. The range listed is just one component of Protective’s total compensation package for employees.</div>\n<div></div>\n<div>This position also offers additional incentive opportunities through an annual incentive based on individual and Company performance.</div>\n<div>\n<h2><b>Employee Benefits</b></h2>\n<div>We aim to protect our employees&#8217; wellbeing through a broad benefits offering. For example, we protect physical wellbeing through health, dental and vision insurance. We protect mental wellbeing through mental health benefits and an employee assistance program. We protect time away from work with a variety of paid time away benefits (<i>e.g.</i>, paid time off, paid parental leave, short-term disability, and a cultural observance day). We protect financial wellbeing through contributions to healthcare accounts, a pension plan, and a 401(k) plan with Company matching. All employees are encouraged to protect their overall wellbeing by engaging in ProHealth Rewards, Protective’s platform to improve wellbeing while earning cash rewards.</div>\n<div></div>\n<div>Eligibility for certain benefits may vary by position in accordance with the terms of the Company’s benefit plans.</div>\n</div>\n</div>",
      "pubDate": "2024-02-26 08:12:42",
      "annualSalaryMin": "71000",
      "annualSalaryMax": "90000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103588,
      "url": "https://jobicy.com/jobs/103588-senior-product-manager-36",
      "jobSlug": "103588-senior-product-manager-36",
      "jobTitle": "Senior Product Manager",
      "companyName": "Devoted Health",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/c2fcbe86cd700365225186b7b4ee7c97.png",
      "jobIndustry": ["Product &amp; Operations"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "At Devoted Health, we’re on a mission to dramatically improve the health and well-being of older Americans by caring for every person like family. That’s why we’re gathering smart, diverse, and big-hearted people to create a new kind of all-in-one healthcare company — one that combines compassion, health insurance, clinical care, service, and technology &#8211; to deliver&#8230;",
      "jobDescription": "<p>At Devoted Health, we’re on a mission to dramatically improve the health and well-being of older Americans by caring for every person like family. That’s why we’re gathering smart, diverse, and big-hearted people to create a new kind of all-in-one healthcare company — one that combines compassion, health insurance, clinical care, service, and technology <b>&#8211;</b> to deliver a complete and integrated healthcare solution that delivers high quality care that everyone would want for someone they love. Founded in 2017, we&#8217;ve grown fast and now serve members across the United States.  And we&#8217;ve just started. So join us on this mission!</p>\n<h2><i><b>​A bit about this role: </b></i></h2>\n<p>We are planning to deliver the best care for consumers in healthcare- and that’s going to require some new and better tools, and some new and better data analytics. Most healthcare teams don’t have the tools and data they want at their fingertips. Their systems are siloed, high latency, and transaction focused… all of which make it difficult to move healthcare to a world where we pay for value and care for members seamlessly.<br />\nSo while we are gearing up to deliver outstanding care, we are also building the tools that the whole industry needs to transition to better care instead of just more care. This will be the first platform of its kind in healthcare.</p>\n<p>We are looking for a seasoned product manager who knows consumer products and tools, understands which data to collect and pay attention to, and who is excited to take on complicated and challenging problems. Someone who seeks to make something that is complex feel simple and intuitive. Our goal is to build technology which lets human interactions shine through; which provides the context and data needed, and then gets out of the way. In this role you will create a vision for how the consumer experience can be transformed in healthcare, creating both customer satisfaction and better health outcomes through improved data and coordination.</p>\n<p>Your teammates will be world class, and you’ll get to learn from the absolute best across the industry.</p>\n<h2><b><i>Responsibilities will include:</i></b></h2>\n<ul>\n<li>Create the vision for the platform which will bring customer support and payer systems into the 21st century, delivering the tools for consumers, internal staff and our doctors to deliver a simple and magical experience to consumers. Work with engineering, data, research, UX, operations, and sales to deliver this vision.</li>\n<li>Define a set of KPIs to measure customer satisfaction and operational impact, and be able to analyze them and utilize them in decision making processes. Drive continuous improvement to these KPIs.</li>\n<li>Work with multiple internal operations teams to prioritize where to leverage technology to transform their delivery model.</li>\n</ul>\n<h2><i><b>Attributes to success: </b></i></h2>\n<ul>\n<li>A super proactive “get it done” attitude, and the skills to back it up.</li>\n<li>The uncanny ability to get everyone on the same page in a complex cross-functional environment.</li>\n<li>Ability to manage a wide array of stakeholder groups, including the ability to listen and solicit carefully, and synthesize all their input into an action plan, then communicate it back to them and eventually, the whole company.</li>\n<li>Excellent communication skills, including ability to clearly articulate needs, objectives, priorities, and strategy in writing.</li>\n<li>Comfort with the uncertainty inherent in a startup.</li>\n<li>A deep desire to make U.S. healthcare better.</li>\n</ul>\n<h2><i><b>Required skills and experience</b></i></h2>\n<ul>\n<li>Ability to work in a fast-paced startup environment.</li>\n<li>5+ years of product management or product development.</li>\n<li>A proven track record of shipping products with business value.</li>\n<li>A history of translating customer insights into tools that customers love to use.</li>\n<li>Excellent communication skills — you will need to work with a highly cross-functional team.</li>\n<li>Demonstrated ability to maximize business value by evaluating and prioritizing between multiple  product investment opportunities.</li>\n<li>Experience in operations, operations strategy, and engineering.</li>\n<li>Knowledge of healthcare, or an enthusiasm to learn.</li>\n<li>A history of translating customer insight into recommendations that customers love to act on.​</li>\n</ul>\n<p><strong>Salary Range: </strong> $150,000 &#8211; $170,000 annually</p>\n<p>Healthcare equality is at the center of Devoted’s mission to treat our members like family.  We are committed to a diverse and vibrant workforce.  If you lack a specific credential for this position but believe that your strengths and life experiences will propel our mission, we would love to hear from you.</p>\n<p><strong>Our Total Rewards package includes:</strong></p>\n<ul>\n<li>Employer sponsored health, dental and vision plan with low or no premium</li>\n<li>Generous paid time off</li>\n<li>$100 monthly mobile or internet stipend</li>\n<li>Stock options for all employees</li>\n<li>Bonus eligibility for all roles excluding Director and above; Commission eligibility for Sales roles</li>\n<li>Parental leave program</li>\n<li>401K program</li>\n<li>And more&#8230;.</li>\n</ul>",
      "pubDate": "2024-02-26 08:11:31",
      "annualSalaryMin": "150000",
      "annualSalaryMax": "170000",
      "salaryCurrency": "USD"
    },
    {
      "id": 98722,
      "url": "https://jobicy.com/jobs/98722-product-marketing-manager-16",
      "jobSlug": "98722-product-marketing-manager-16",
      "jobTitle": "Product Marketing Manager",
      "companyName": "LeadIQ",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/8e469a117bd9d5a08bae3fc42aabad33.jpg",
      "jobIndustry": ["Marketing &amp; Sales", "Product &amp; Operations"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "LeadIQ is a fast-growing Series B funded technology company headquarted in the Bay Area and Singapore, that provides innovative lead generation and sales prospecting solutions. Our cutting-edge platform empowers sales teams to streamline their workflow, accelerate lead generation, and drive revenue growth. We work with a diverse range of clients, from startups to mid-sized enterprises,&#8230;",
      "jobDescription": "<p>LeadIQ is a fast-growing Series B funded technology company headquarted in the Bay Area and Singapore, that provides innovative lead generation and sales prospecting solutions. Our cutting-edge platform empowers sales teams to streamline their workflow, accelerate lead generation, and drive revenue growth. We work with a diverse range of clients, from startups to mid-sized enterprises, helping them achieve their sales goals and drive customer success.</p>\n<h2>About the role:</h2>\n<p>You will play a meaningful role in delivering value to our customers, actively participating in product strategy, research, positioning, and go-to-market. Product marketing works closely with product management to shape the direction of our products and the value we create for our customers as well as our GTM teams in bringing products and features to market.</p>\n<p>This role will report to our Head of Product Marketing.</p>\n<h2>What you’ll do:</h2>\n<p>Product marketers aspire to know our customers better than anyone else. To get there, you will focus on these areas of input and output:</p>\n<p><strong>Research (input)</strong></p>\n<ul>\n<li>Conduct regular customer research across our customer segments: self-service customers and customers acquired through sales-driven GTM motion.</li>\n<li>Analyze these customer insights and work with product teams to define our strengths, weaknesses, opportunities, positioning, and messaging.</li>\n<li>Research and track overarching market trends and patterns</li>\n<li>Report product marketing performance and insights to the team</li>\n<li>Support competitor research to better understand how to position LeadIQ in a very competitive market.</li>\n</ul>\n<p><strong>Positioning (output)</strong></p>\n<ul>\n<li>Own the positioning and messaging for the LeadIQ platform</li>\n<li>Partner with other marketing functions, product management, and design to evolve our position in the market</li>\n</ul>\n<p><strong>Go-to-market (output)</strong></p>\n<ul>\n<li>Develop strategic, insight-driven go-to-market plans for new product initiatives</li>\n<li>Demonstrate a deep understanding of the desired marketplace and industry trends</li>\n<li>Demonstrate a deep understanding of current marketing channels and distribution methods for our products based on product marketing best practices and customer insight into where, when, and how people want to hear from us</li>\n<li>Represent and advocate for the needs of users within the go-to-market plan and throughout the product lifecycle</li>\n<li>Launch new things well — be strategic, data-driven, and responsible for outcomes. Work cross-functionally with teammates across the company to deliver marketing launches on time and at a high-quality bar</li>\n</ul>\n<p><strong>Messaging (output)</strong></p>\n<ul>\n<li>Craft the story and narrative we want to tell and the proper channels and timing for delivering that message</li>\n<li>Work with email and in-app messaging to build recognition and awareness for the core aspects of what makes the product experience great and valuable</li>\n<li>Dig into the data to find ways to optimize messaging and timing messaging and in order to drive product preference and customer adoption and ensure it is reflected in all our communications, including website, case studies, whitepapers and sales pitches</li>\n</ul>\n<p><strong>Sales enablement (output)</strong></p>\n<ul>\n<li>Collaborate with our sales team to develop impact sales tools, include pitch decks, battle cards, case studies, demo scripts, and so forth</li>\n</ul>\n<h2>Helpful skills and experience:</h2>\n<ul>\n<li>A product marketer with core competencies in a handful of areas (GTM launches, messaging/positioning, competitive intelligence) but also with baseline skills across many marketing disciplines.</li>\n<li>Thrives in an environment where market and customer feedback is essential</li>\n<li>Writes exceptionally well (including go-to-market materials and customer case studies)</li>\n<li>Manages conflicting priorities from various stakeholders across several teams and communicates well with internal teams</li>\n<li>Desires to continuously test and learn. Willing to be disciplined and precise with data-informed learnings and takeaways</li>\n<li>Loves to translate complex concepts into clearly articulate messaging</li>\n</ul>\n<h2>Please don&#8217;t apply if you can&#8217;t meet below requirements:</h2>\n<ul>\n<li>3-5 years in full-stack product marketing roles or related experience in B2B SaaS company, ideally in Sales or Marketing tech</li>\n<li>Located in United States and comfortable with remote work environment</li>\n</ul>\n<h2>Benefits:</h2>\n<ul>\n<li>Medical and dental coverage for full-time employees and dependents</li>\n<li>Matching 401K program to help you invest in your future</li>\n<li>Flexible vacation time to promote a healthy work-life balance, including additional quarterly wellness day</li>\n<li>Paid parental leave to support you and your family (structure of paid leave is governed by your state of residency)</li>\n</ul>\n<h2>About Us:</h2>\n<p>LeadIQ is an equal opportunity employer and makes employment decisions on the basis of merit. We are committed to building a diverse and inclusive workplace. We do not discriminate on the basis of race, religion, national origin, gender, gender identity, sexual orientation, disability, age, education status, or any other legally protected status.</p>\n<div class=\"styles_description__uLHQ_\">\n<p>This role is fully remote, however employment requires residency in one of the states listed on this job description.</p>\n</div>",
      "pubDate": "2024-02-26 08:07:10"
    },
    {
      "id": 98721,
      "url": "https://jobicy.com/jobs/98721-account-executive-commercial-3",
      "jobSlug": "98721-account-executive-commercial-3",
      "jobTitle": "Account Executive, Commercial",
      "companyName": "LeadIQ",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/8e469a117bd9d5a08bae3fc42aabad33.jpg",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "LeadIQ is a fast-growing Series B funded technology company headquartered in the Bay Area and Singapore, that provides innovative lead generation and sales prospecting solutions. Our cutting-edge platform empowers sales teams to streamline their workflow, accelerate lead generation, and drive revenue growth. We work with a diverse range of clients, from startups to mid-sized enterprises,&#8230;",
      "jobDescription": "<p>LeadIQ is a fast-growing Series B funded technology company headquartered in the Bay Area and Singapore, that provides innovative lead generation and sales prospecting solutions. Our cutting-edge platform empowers sales teams to streamline their workflow, accelerate lead generation, and drive revenue growth. We work with a diverse range of clients, from startups to mid-sized enterprises, helping them achieve their sales goals and drive customer success.</p>\n<h2>Job Description</h2>\n<p>We are looking for a Commercial Account Executive to continue driving LeadIQ’s suite of capabilities to our core segment. As an Commercial Account Executive, you’ll be responsible for driving and closing business, generating new leads and managing your growing pipeline. We are looking for a hungry seller that is eager to develop their skillset while owning their territory. You will play a huge role at our company while developing your own personal growth goals.</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Utilize LeadIQ’s best in class products to become an expert and thought leader in all things prospecting</li>\n<li>Own your territory by building your own outbound pipeline in addition to working with marketing to nurture inbound pipeline</li>\n<li>Own the sales cycle from end to end, including prospecting through close.</li>\n<li>Provide a world class customer experience.</li>\n<li>Develop a deep understanding of LeadIQ’s ICP and customer needs to drive value into prospect and customer accounts.</li>\n<li>Clearly articulate LeadIQ’s value proposition.</li>\n<li>Cultivate meaningful relationship with customers.</li>\n<li>Manage and present accurate weekly forecasting of pipeline and achieve quarterly quota.</li>\n</ul>\n<h2><strong>Qualifications and Skills</strong></h2>\n<ul>\n<li>2+ years of experience in an Account Executive role, consistently meeting or exceeding expectations.</li>\n<li>Experience selling Sales, RevOps, MarOps, or similar technology in the B2B software space, with examples of closing new business deals $20-50k</li>\n<li>Proven track record of owning and developing a new segment and territory.</li>\n<li>In depth understanding and ability to implement a rigorous sales methodology (challenger, MEDDPICC, etc).</li>\n<li>Excellent collaboration, accountability, and communication skills in a remote environment.</li>\n<li>Previous experience achieving sales goals (AE of the Year, President’s Club, etc).</li>\n<li>Great team player that is a business builder who enjoys a fast paced ever changing industry and environment.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Competitive salary &amp; equity eligibility</li>\n<li>Comprehensive health, dental, and vision insurance plans.</li>\n<li>Generous vacation and paid time off.</li>\n<li>Flexible work schedule with remote work</li>\n<li>Professional development and growth opportunities within a dynamic and fast-paced environment.</li>\n</ul>\n<h2>Location</h2>\n<p>This is a fully remote position, however employment is restricted to candidates residing in one of the following states; California, Colorado, Florida, Georgia, Illinois, Kentucky, Maine, Maryland, Massachusetts, South Carolina, New Hampshire, New Jersey, New York City, New York State, North Carolina, Texas, Washington, and Virginia.</p>\n<h2>About Us</h2>\n<p>LeadIQ is an equal opportunity employer and makes employment decisions on the basis of merit. We are committed to building a diverse and inclusive workplace. We do not discriminate on the basis of race, religion, national origin, gender, gender identity, sexual orientation, disability, age, education status, or any other legally protected status.</p>\n<div class=\"styles_description__uLHQ_\">\n<p>If you are passionate about sales and thrive in a collaborative team environment, we would love to hear from you. Join LeadIQ and make a significant impact on the success of our prospect, clients, and our organization as a whole.</p>\n</div>",
      "pubDate": "2024-02-26 08:06:41"
    },
    {
      "id": 102255,
      "url": "https://jobicy.com/jobs/102255-director-customer-success-2",
      "jobSlug": "102255-director-customer-success-2",
      "jobTitle": "Director - Customer Success",
      "companyName": "Thinkific",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/570aa5804532a172e106382d78eee9e2.jpeg",
      "jobIndustry": ["Customer Success"],
      "jobType": ["contract"],
      "jobGeo": "Canada",
      "jobLevel": "Director",
      "jobExcerpt": "Thinkific is a software platform that gives anyone the ability to easily create and sell online courses, build vibrant communities, and monetize memberships. We believe in impactful and innovative work: our team of 250+ Thinkers is building and expanding an incredible product that empowers Creator Educators and businesses around the globe while working collaboratively to&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<p>Thinkific is a software platform that gives anyone the ability to easily create and sell online courses, build vibrant communities, and monetize memberships. We believe in impactful and innovative work: our team of 250+ Thinkers is building and expanding an incredible product that empowers Creator Educators and businesses around the globe while working collaboratively to learn, grow, and succeed together. Join us to see how we’re building one of the best workplaces in Canadian tech!</p>\n<p>We believe every candidate should have a fair, inclusive, and overall great experience when exploring a new role with Thinkific. That starts with outlining our hiring process so you know what to expect every step of the way—click here to learn more: https://thnk.cc/whattoexpect</p>\n</div>\n<p><strong>Are you an experienced leader who is driven by the success of both customers and your team? </strong>We’re looking for a <strong>Director, Customer Success (14-month contract) </strong> to join us at Thinkific.</p>\n<p>As the Director, Customer Success at Thinkific, you’ll be responsible for leading the Customer Success team dedicated to Thinkific’s mid-market price tier, Plus. You’ll develop and implement initiatives to drive the success of our Plus customers—increasing retention, expansion, and upgrades as well as offering unparalleled customer satisfaction. You’ll coach and develop a high-performing, motivated team to achieve positive net revenue retention. Reporting to the VP, Head of Plus, you will work collaboratively with our Sales, Research and Development, Marketing, and Data teams to significantly grow the Plus area of our business through an aligned strategy.</p>\n<h3><strong>Your goal will be to collaborate cross-functionally to create and execute a strategy to grow annual recurring revenue in 2024.  Here’s how you’ll accomplish this</strong></h3>\n<ul>\n<li>Set the overall direction for the Customer Success team, in line with Thinkific’s annual strategic priorities</li>\n<li>Lead the team to consistently achieve net revenue retention of above 100% by increasing expansion and upgrades, and decreasing churn</li>\n<li>Drive the success and satisfaction of our Plus customers by working with Team Leads and Managers to develop proactive ways for the various Customer Success teams to add value along the customer journey and create relevant KPI’s and Health Scores for each account</li>\n<li>Demonstrate a sales mindset across all Customer Successsub-teams (Solutions Engineering, Launch, CSM and Account Management)</li>\n<li>Scale a high-performing and motivated team that loves going above and beyond to help our Plus customers reach their goals</li>\n<li>Develop KPI’s and compensation structures for measuring the performance of our post-sales functions</li>\n<li>Collaborating with cross-functional teams like Sales, Revenue Operations, and Marketing to grow the business and teams’ success</li>\n</ul>\n<h3><strong>The person we have in mind likely</strong></h3>\n<ul>\n<li>Has 5+ years of experience managing customer accounts in a B2B or B2C environment</li>\n<li>Has at least 3+ years of experience leading and growing customer-facing teams, ideally in a SaaS environment</li>\n<li>Demonstrates a consistent track record of managing high-performing teams responsible for driving customer success, customer satisfaction, and revenue impact</li>\n<li>Is fanatical about customer success and knows that we succeed when our customers succeed; they believe Customer Success is the ultimate revenue engine</li>\n<li>Possesses the ability to influence peers and manage stakeholders to align and execute the right decisions for the business despite constraints and blockers</li>\n<li>Is a standout coach and mentor; they have developed team members and have seen the impact through their career growth</li>\n<li>Is highly adaptable and has managed teams to be high-performing and motivated through times of change and ambiguity</li>\n<li>Has an operational mind and knows how to build, scale, and continuously iterate on systems and processes that enable team members to do their best work</li>\n<li>Loves to learn and grow. They’ve found (and keep looking for) ways to level up their skills in this field, whether that’s through formal education, gaining professional experience, or maybe even building their own business</li>\n</ul>\n<h3><strong>These things would also be nice, but we think you could learn them on the job</strong></h3>\n<ul>\n<li>Experience with analytics—you’re familiar with tracking customer net promotor score, churn, and activation</li>\n<li>Organized and possess a strong attention to detail, rarely missing a task or follow-up</li>\n<li>Performs well under pressure and be able to handle emergency situations on the fly</li>\n<li>Experience solving complex platform problems, even if you don’t know the answer initially</li>\n</ul>\n<p><em><strong>The recruitment compensation range for this position is $143,000 &#8211; 178,000  CAD</strong></em></p>",
      "pubDate": "2024-02-26 08:05:55",
      "annualSalaryMin": "143000",
      "annualSalaryMax": "178000",
      "salaryCurrency": "CAD"
    },
    {
      "id": 102229,
      "url": "https://jobicy.com/jobs/102229-content-moderator",
      "jobSlug": "102229-content-moderator",
      "jobTitle": "Content Moderator / Reviewer",
      "companyName": "Confidential Company",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/01/681c0d03-221.jpg",
      "jobIndustry": ["Copywriting &amp; Content", "Customer Success"],
      "jobType": ["contract", "part-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "We are seeking a detail-oriented and proactive Remote Content Moderator on a contract basis for a major social media network. This vital role involves reviewing, monitoring, and moderating user-generated content to ensure compliance with community guidelines and to maintain a safe online environment. Key Responsibilities Content review and moderation Monitor and review user-generated content on&#8230;",
      "jobDescription": "<p>We are seeking a detail-oriented and proactive Remote Content Moderator on a contract basis for a major social media network. This vital role involves reviewing, monitoring, and moderating user-generated content to ensure compliance with community guidelines and to maintain a safe online environment.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<h3><strong>Content review and moderation</strong></h3>\n<ul>\n<li>Monitor and review user-generated content on the social media platform to ensure compliance with community guidelines and policies.</li>\n<li>Identify and take appropriate action on content that violates terms of service, including offensive, harmful, or inappropriate material.</li>\n</ul>\n<h3><strong>Quality assurance</strong></h3>\n<ul>\n<li>Maintain high-quality standards for content moderation processes.</li>\n<li>Provide feedback on moderation tools and procedures to improve efficiency and effectiveness.</li>\n</ul>\n<h3><strong>User safety and support</strong></h3>\n<ul>\n<li>Respond to user inquiries and reports related to content issues.</li>\n<li>Collaborate with the safety team to address and resolve user concerns and complaints.</li>\n</ul>\n<h3><strong>Reporting and documentation</strong></h3>\n<ul>\n<li>Keep accurate records of moderated content.</li>\n<li>Generate reports on content trends and moderation activities.</li>\n</ul>\n<h3><strong>Team collaboration</strong></h3>\n<ul>\n<li>Work closely with other moderators and teams to coordinate efforts and share best practices.</li>\n<li>Participate in regular training and update sessions to stay informed about platform changes and moderation guidelines.</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>Experience in content moderation, community management, or a related field is preferred.</li>\n<li>Strong understanding of social media platforms and their impact on society.</li>\n<li>Excellent attention to detail and ability to identify subtle nuances in content.</li>\n<li>Solid judgment and decision-making skills, with an ability to act quickly and effectively.</li>\n<li>Good communication and interpersonal skills.</li>\n<li>Ability to work independently and as part of a remote team.</li>\n<li>Willingness to work in a fast-paced, dynamic environment.</li>\n<li>Comfortable with exposure to sensitive or graphic content.</li>\n<li>Basic technical proficiency and a reliable internet connection.</li>\n</ul>\n<h2><strong>We Offer</strong></h2>\n<ul>\n<li>A remote and flexible work environment.</li>\n<li>Competitive salary and benefits.</li>\n<li>Opportunities for professional growth and development.</li>\n<li>A supportive and inclusive team culture.</li>\n</ul>\n<h2><strong>Expected KPI</strong></h2>\n<ul>\n<li>Expected to maintain a rate of 95% or above. This KPI measures the effectiveness in correctly identifying and handling content in line with the platform&#8217;s guidelines.</li>\n</ul>\n<p>This contract position offers an hourly rate ranging from $20 to $25, depending on experience and qualifications.</p>\n<h2><strong>How to Apply</strong></h2>\n<p>If you are passionate about maintaining a safe and positive online community and meet the above criteria, we would love to hear from you. Please submit your resume and a cover letter explaining your interest in the role and your experience with content moderation.</p>\n<p><em>The company is an equal opportunity employer and welcomes candidates from all backgrounds to apply.</em></p>",
      "pubDate": "2024-02-26 08:04:45"
    },
    {
      "id": 102251,
      "url": "https://jobicy.com/jobs/102251-senior-product-manager-new-businesses",
      "jobSlug": "102251-senior-product-manager-new-businesses",
      "jobTitle": "Sr. Product Manager - New Businesses",
      "companyName": "Discord",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/02/WRILS-210216185819-522054.jpg",
      "jobIndustry": ["Product &amp; Operations"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "Discord is where anyone can find a place they belong. Every day, students, hikers, gamers, artists, and friends of all types use Discord to chat, hang out, and form new connections. Our Revenue team focuses on building and maintaining the monetization ecosystem on Discord through Nitro, Boosting, and a portfolio of new bets. We’re looking&#8230;",
      "jobDescription": "<div>\n<p>Discord is where anyone can find a place they belong. Every day, students, hikers, gamers, artists, and friends of all types use Discord to chat, hang out, and form new connections. Our Revenue team focuses on building and maintaining the monetization ecosystem on Discord through Nitro, Boosting, and a portfolio of new bets.</p>\n<p>We’re looking for a Senior Product Manager to lead monetization efforts for new business lines. You will be responsible for identifying new opportunities and for creating a vision around why we should pursue them. You will define our strategy for how we can deliver that message. You will drive execution on a roadmap you create while scaling our revenue platform for other teams to build on. You will work directly with our GTM teams when launching products for users and businesses. Finally, you will partner both internally and externally to form creative solutions and build an impactful team in one of the highest-priority product areas at Discord.</p>\n<h2 class=\"h5-2okRbA\">What you&#8217;ll be doing:</h2>\n<ul>\n<li>Guide the product philosophy, vision, and roadmap for new ways to monetize on Discord.</li>\n<li>Lead cross-functional execution with engineering, data science, design, marketing, partnerships, legal, policy to build, test, and launch revenue products that are beneficial for our users.</li>\n<li>Clearly communicate roadmaps, priorities, experiments and decisions across a wide spectrum of audiences from partner teams to executive levels.</li>\n<li>Together with other product teams, evolve the in-app ecosystem for all monetizable products to ensure a coherent and delightful experience for anything a user pays for.</li>\n<li>Empathize and relate to our users, especially those who are the most active on Discord.</li>\n</ul>\n</div>\n<div>\n<h2 class=\"h5-2okRbA\">What you should have:</h2>\n<ul>\n<li>Ability to thrive in ambiguous environments, excited about finding simple solutions to complex problems, and then executing on them.</li>\n<li>4-6+ years experience shipping great software, driving prioritization, making trade-off decisions, and setting timelines.</li>\n<li>Demonstrated technical proficiency and effectiveness working closely with engineers.</li>\n<li>Extensive experience working in third-party ecosystems towards monetization goals.</li>\n<li>Track record of driving impact via rapid experimentation towards a metric goal for a consumer tech product.</li>\n<li>Strong analytical ability to quickly organize and leverage data (including writing SQL) to make informed product decisions with cross-functional stakeholders.</li>\n<li>Strong product sense for the consumer tech revenue space with deep understanding of how users go from free to paid.</li>\n</ul>\n</div>\n<div>\n<h2 class=\"h5-2okRbA\">Bonus Points:</h2>\n<ul>\n<li>Experience working with monetization on Android, iOS, or desktop.</li>\n<li>Experience building and growing social and/or online communication products.</li>\n<li>BA/BS in Computer Science, Engineering, or relevant technical experience.</li>\n<li>Entrepreneurial experience building consumer applications.</li>\n<li>Familiarity with the gaming publisher space.</li>\n</ul>\n<p><span class=\"hl-green-solid warn\" data-highlight-id=\"81455a71191db6d5f76f64c21f4da6bc-0\">The US base salary range for this full-time position is $214,000 to $233,000 +</span> equity <span class=\"hl-grey-underline replace\" data-highlight-id=\"e0096ad4504408d02da445a82c4a3cea-0\">+</span> benefits. Our salary ranges are determined by role and level. Within the range, individual pay is determined by additional factors, including job-related <span class=\"hl-blue-underline replace\" data-highlight-id=\"257485fb9f598e390adc63496009eeae-0\">skills, experience</span>, and <span class=\"hl-blue-underline replace_or_delete\" data-highlight-id=\"67c83e927ebf7ae463b3b605641d320b-0\">relevant</span> <span class=\"hl-blue-underline replace\" data-highlight-id=\"69e7c3e01ccca129971eae57e2560178-0\">education or training</span>. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include equity, or benefits.</p>\n</div>\n<div class=\"content-conclusion\">\n<h2 class=\"h5-2okRbA\">About Us:</h2>\n<p>Discord is a voice, video and text app that helps friends and communities come together to hang out and explore their interests — from artists and activists, to study groups, sneakerheads, plant parents, and more. With 150 million monthly users across 19 million active communities, called servers, Discord has grown to become one of the most popular communications services in the world. Discord was built without selling ads or user data and instead, offers a premium subscription called Nitro that gives users special perks like higher quality streams and fun customizations.</p>\n<p>We’re working toward an inclusive world where no one feels like an outsider, where genuine human connection is a click, text chat, or voice call away. A place where everyone can find belonging. Challenging? Heck yes. Rewarding? Double heck yes. It’s a mission that gives us the chance to positively impact millions of people all over the world. <strong>So if this strikes a chord with you, come build belonging with us!</strong></p>\n</div>",
      "pubDate": "2024-02-26 08:00:05",
      "annualSalaryMin": "214000",
      "annualSalaryMax": "233000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103555,
      "url": "https://jobicy.com/jobs/103555-customer-success-manager-75",
      "jobSlug": "103555-customer-success-manager-75",
      "jobTitle": "Customer Success Manager",
      "companyName": "Airbase",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200913204329-189013.png",
      "jobIndustry": ["Customer Success"],
      "jobType": ["full-time"],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "Airbase is the top-ranked modern spend management platform for businesses with 100-5,000 employees. It’s the best way to control spending, close the books faster, and manage financial risk. Airbase software offers modules for Guided Procurement, Accounts Payable Automation, Expense Management, and a flexible corporate card program on a single collaborative platform. It can be implemented&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<div>Airbase is the top-ranked modern spend management platform for businesses with 100-5,000 employees. It’s the best way to control spending, close the books faster, and manage financial risk. Airbase software offers modules for Guided Procurement, Accounts Payable Automation, Expense Management, and a flexible corporate card program on a single collaborative platform. It can be implemented in full or as individual modules. Airbase automates all spending workflows and guides the process for all purchases — procure, pay, close. It brings efficiency to complex business processes like multi-stakeholder compliance and accounting needs like multi-subsidiaries, amortizations, and purchase orders. Flexible intake and approval workflows ensure oversight across all stakeholders and spend compliance. Airbase integrates with your other business systems and seamlessly syncs to popular general ledgers. Employees and accounting teams love using Airbase.</div>\n</div>\n<h2><strong>About the role:</strong></h2>\n<ul>\n<li>Serve as the strategic partner to customers within assigned book of business</li>\n<li>Engage proactively through QBRs and other touchpoints to drive initial product adoption, share Airbase best-practices, and showcase value in line with customer business objectives</li>\n<li>Uncover upsell, cross sell opportunities within assigned book and partner with Account Manager to maximize expansion revenue</li>\n<li>Amplify the voice of the customer, surfacing product feedback to relevant internal stakeholders and helping advance the company’s roadmap and development strategy</li>\n<li>Strategize product enhancement adoption and deployment that map to the customer’s business goals</li>\n<li>Surface thematic product gaps and needs within your book of business</li>\n<li>Become an Airbase product expert. Learn the ins and outs of the product so you can speak eloquently to best practices and solutions for your clients&#8217; needs.</li>\n</ul>\n<h2><strong>What you&#8217;ll bring: </strong></h2>\n<ul>\n<li>At least 5-7 years of customer success experience at a B2B Mid-market or Enterprise-focused SaaS company</li>\n<li>Fluent in English with ability to communicate clearly and confidently</li>\n<li>Experience managing a revenue-based quota</li>\n<li>Experience creating and delivering high quality QBRs to executive and leadership teams</li>\n<li>Experience managing de-escalations and coordinating feedback and discussions between customer&lt;&gt;product teams</li>\n<li>Ability to work and learn at a fast pace (at times with little to no direction)</li>\n<li>Previous experience of working with US headquartered customers</li>\n<li>Ability to build rapport and trust with champions and your colleagues in a remote setting</li>\n<li>Passionate about joining a small team and building a company</li>\n</ul>\n<h2><strong>Nice to Haves: </strong></h2>\n<ul>\n<li>Experience with technical B2B SaaS applications</li>\n<li>Experience with Office of the CFO applications</li>\n<li>Basic understanding of accounting and finance ecosystem</li>\n<li>Experience utilizing common tools within the CS tech stack (Salesforce, Gainsight, Gong, Catalyst, Totango, Outreach)</li>\n</ul>\n<div class=\"content-conclusion\">\n<p>We offer competitive cash compensation and equity packages, comprehensive benefit plans, parental leave, and generous time off for all of our full-time roles.</p>\n</div>",
      "pubDate": "2024-02-25 08:03:47"
    },
    {
      "id": 102153,
      "url": "https://jobicy.com/jobs/102153-senior-javascript-engineer",
      "jobSlug": "102153-senior-javascript-engineer",
      "jobTitle": "Senior JavaScript Engineer",
      "companyName": "10up",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210129124926-822280.png",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Senior",
      "jobExcerpt": "At 10up, we call developers like you engineers because you aren’t just a “coder”: you’re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges. As a Senior JavaScript Developer at 10up, you are an integral part in building custom-crafted UIs utilized by millions of people daily. 10uppers have been&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>At 10up, we call developers like you <i>engineers</i> because you aren’t just a “coder”: you’re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges. As a Senior JavaScript Developer at 10up, you are an integral part in building custom-crafted UIs utilized by millions of people daily. 10uppers have been pushing the boundaries of WordPress for over 12 years—become an engineer that innovates the internet by building state-of-the-art web fronts alongside a top-in-the-field team.</div>\n<div></div>\n<div>You’ll work on a combination of unique builds and ongoing support engagements that help season your skills. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.</div>\n<div></div>\n<div>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you will do</h2>\n<ul>\n<li>Lead, architect, and build React projects with modern JavaScript.</li>\n<li>Estimate JavaScript work and modularize goals into clearly defined, executable tasks.</li>\n<li>Coach and mentor teammates to boost the team&#8217;s JavaScript and engineering abilities.</li>\n<li>Skillfully connect engineering deliverables to client business objectives.</li>\n<li>Ultimately you will make the web better by finely crafting apps, and tools that reach millions of online visitors every day.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>About you</h2>\n<ul>\n<li>You love building scalable web-based JavaScript applications with ES6+, React, and Node.</li>\n<li>You are well-versed with the architectural concepts behind React &#8211; state and data management, JSX, creating a componentized system, and JavaScript tooling.</li>\n<li>You are knowledgeable of WordPress as a platform, including custom post types, taxonomies, and use of WordPress beyond typical “blog” use cases.</li>\n<li>You have a code portfolio of real-world samples. Link us to your best custom work on GitHub and you’ll never have to do any live coding or whiteboard testing!</li>\n<li>You prefer to work fully remote and are effectively engaging in a distributed team from the location of your choosing.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Benefits of interest</h2>\n<ul>\n<li>Multiple paid time off programs, including accrued PTO, parental leave, bereavement leave, and company holidays – including an all-company break from Christmas Eve to New Years Day.</li>\n<li>Health, dental, and life insurance programs (available for United States team members).</li>\n<li>Retirement contribution programs (currently available in the U.S. and U.K.).</li>\n<li>Flexible and alternate schedule programs &#8211; including options for 4-day work week (Monday-Thursday) configurations.</li>\n<li>$3,000 USD accrued annually in professional development budget for you to spend on conferences, training, or to buy back time for programs like independent study.</li>\n<li>Global Company summits – opportunities to meet, socialize and learn with fellow 10uppers in person at remarkable destinations.</li>\n<li>An end-of-year all-hands bonus program, along with smaller opportunities for recognition throughout the year.</li>\n<li>A Director of Engineering that supports your career growth and development.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div>The expected annual salary range for this position is between $70,000 and $130,000 USD. Compensation is determined based on a variety of factors including relevant experience, other job related qualifications/skills, geographic location, and business needs.</div>\n</div>\n</div>",
      "pubDate": "2024-02-25 08:02:53",
      "annualSalaryMin": "70000",
      "annualSalaryMax": "130000",
      "salaryCurrency": "USD"
    },
    {
      "id": 98643,
      "url": "https://jobicy.com/jobs/98643-customer-success-manager-lending",
      "jobSlug": "98643-customer-success-manager-lending",
      "jobTitle": "Senior Node Engineer",
      "companyName": "Argyle",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/9256ffc74de113c064bac9bc15018dbb.png",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "EMEA,  Brazil",
      "jobLevel": "Senior",
      "jobExcerpt": "Argyle is a fast-growing, remote-first Series B startup solving a systemic data problem. Underneath the consumer finance industry’s decisions and processes is static, analog documentation—things like credit reports and paystubs—designed decades ago for a world that no longer exists. Meanwhile, credit bureaus buy, move, store, and sell consumers’ data without their knowledge or consent. The&#8230;",
      "jobDescription": "<p>Argyle is a fast-growing, remote-first Series B startup solving a systemic data problem.</p>\n<p>Underneath the consumer finance industry’s decisions and processes is static, analog documentation—things like credit reports and paystubs—designed decades ago for a world that no longer exists. Meanwhile, credit bureaus buy, move, store, and sell consumers’ data without their knowledge or consent.</p>\n<p>The result? A labyrinth of manual workflows and shortsighted underwriting models that obstruct financial access, compound operational costs, and impede innovation.</p>\n<p>The solution is Argyle. We’re a real-time income data platform that lets our end-users instantly connect their employment records to apps and websites, so they can access and qualify for the financial resources they need to get ahead. Providers benefit from streamlined workflows and enhanced visibility that reduce costs and risk across the user journey.</p>\n<p>Our mission is to give consumers the means to exercise ownership over their income, employment, and identity data in order to create a more equal, efficient, and effective financial system for everybody.</p>\n<p>If you’re looking to join a fun and ambitious group of people working remotely across dozens of countries, apply today.</p>\n<h2><strong>About the team</strong></h2>\n<p>This position is for a senior node engineer within Frontend team. Frontend team is responsible for making client facing products that cater our client needs. It’s not just UI projects but also backend micro-services that drive our frontend applications:</p>\n<ul>\n<li>we maintain sign-up, sign-in process and enterprise client integrations to our system</li>\n<li>we create no-code solution to our clients to speed-up the adoption</li>\n<li>we have multiple micro-services with public facing APIs to our clients</li>\n<li>we optimize the backend for speed to make our frontend feel snappy and fast</li>\n</ul>\n<h2><strong>What will you do?</strong></h2>\n<ul>\n<li>Create and execute an implementation plan for product features</li>\n<li>Drive initiatives for optimizations and architectural improvements for existing frontend stack</li>\n<li>Monitor and optimize the efficiency of node backend services</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>Extensive experience in TypeScript and associated ecosystem</li>\n<li>Senior level experience creating and maintaining node micro-services</li>\n<li>Good knowledge in best engineering practices with capability to write well-tested code</li>\n<li>Experience with Fastify, Postgres, Kafka, Kubernetes and CI automation</li>\n<li>Proven work experience in a distributed team, in a remote environment</li>\n<li>Highly self-driven, responsible, and able to function autonomously to solve problems and ship features</li>\n<li>Fluent in written and spoken English</li>\n</ul>\n<h2><strong>Why Argyle?</strong></h2>\n<ul>\n<li>Remote first company</li>\n<li>International environment</li>\n<li>Flexible working hours</li>\n<li>Stock Options</li>\n<li>Flexible vacation leave</li>\n<li>$1,000 after a month of employment to set up your home office.</li>\n<li>MacBook</li>\n</ul>\n<p>At Argyle, we wholeheartedly embrace diversity and foster equal opportunities for all. We are dedicated to assembling a team encompassing a rich tapestry of backgrounds, perspectives, and talents. We firmly believe that the greater our inclusivity, the stronger and more vibrant our company becomes.</p>",
      "pubDate": "2024-02-25 08:01:48"
    },
    {
      "id": 73397,
      "url": "https://jobicy.com/jobs/73397-software-engineer-crawling-reverse-engineering",
      "jobSlug": "73397-software-engineer-crawling-reverse-engineering",
      "jobTitle": "Software Engineer",
      "companyName": "Argyle",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/9256ffc74de113c064bac9bc15018dbb.png",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Argyle is a fast-growing, remote-first Series B startup solving a systemic data problem. Underneath the consumer finance industry’s decisions and processes is static, analog documentation—things like credit reports and paystubs—designed decades ago for a world that no longer exists. Meanwhile, credit bureaus buy, move, store, and sell consumers’ data without their knowledge or consent. The&#8230;",
      "jobDescription": "<p>Argyle is a fast-growing, remote-first Series B startup solving a systemic data problem.</p>\n<p>Underneath the consumer finance industry’s decisions and processes is static, analog documentation—things like credit reports and paystubs—designed decades ago for a world that no longer exists. Meanwhile, credit bureaus buy, move, store, and sell consumers’ data without their knowledge or consent.</p>\n<p>The result? A labyrinth of manual workflows and shortsighted underwriting models that obstruct financial access, compound operational costs, and impede innovation.</p>\n<p>The solution is Argyle. We’re a real-time income data platform that lets our end-users instantly connect their employment records to apps and websites, so they can access and qualify for the financial resources they need to get ahead. Providers benefit from streamlined workflows and enhanced visibility that reduce costs and risk across the user journey.</p>\n<p>Our mission is to give consumers the means to exercise ownership over their income, employment, and identity data in order to create a more equal, efficient, and effective financial system for everybody.</p>\n<p>If you’re looking to join a fun and ambitious group of people working remotely across dozens of countries, apply today.</p>\n<h2><strong>About the team:</strong></h2>\n<p>Our Scanner Engineering squads work on building and maintaining integrations to various systems. This means reverse engineering platforms and solving complex problems daily. A passion for this work brings our team from across the globe.</p>\n<p>You will join a team of exceptionally talented engineers constantly looking for solutions to new problems and innovative ways to meet our business needs. You will join our pivotal engineering team and have a real impact on Argyle&#8217;s success.</p>\n<h2><strong>What will you do?</strong></h2>\n<ul>\n<li>You will create, own and maintain Scanners</li>\n<li>You will be contributing to general improvements such as shared libraries &amp; frameworks</li>\n<li>You will be closely working and communicating across different teams</li>\n</ul>\n<h2><strong>Our Stack:</strong></h2>\n<p>Python is our main language.</p>\n<p>Python libraries we use: Celery, Pydantic, Playwright, BeautifulSoup, Asyncio, Httpx, Pydash, Mypy, Pytest, Poetry, Pyenv, Poppler, PdfMiner.</p>\n<p>We run Docker, Kubernetes, GCP, Github, ArgoCD.</p>\n<p>If you are familiar with some of these &#8211; great! The rest you can learn after joining.</p>\n<h2><strong>Requirements:</strong></h2>\n<ul>\n<li>Python coding experience</li>\n<li>Reverse Engineering of JS/WebApps</li>\n<li>Ability to think fast and to manage rapid changes</li>\n<li>Ownership over your work</li>\n<li>Focusing on solutions, not pointing out problems</li>\n</ul>\n<h2><strong>Bonus points for:</strong></h2>\n<ul>\n<li>Familiarity with Android/iOS device verification frameworks (SafetyNet Attestation/DeviceCheck) and ways to bypass them</li>\n<li>Knowledge of Bot and Captcha bypass mitigation tactics</li>\n</ul>\n<h2><strong>Why Argyle?</strong></h2>\n<ul>\n<li>Remote first company</li>\n<li>International environment</li>\n<li>Flexible working hours</li>\n<li>Stock Options</li>\n<li>Flexible vacation leave</li>\n<li>$1000 after a month of employment to set up your home office.</li>\n<li>MacBook</li>\n</ul>",
      "pubDate": "2024-02-25 08:01:35"
    },
    {
      "id": 74716,
      "url": "https://jobicy.com/jobs/74716-director-of-scalable-support",
      "jobSlug": "74716-director-of-scalable-support",
      "jobTitle": "Director - Customer Education and Community Support",
      "companyName": "Figma",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201016160957-035844.png",
      "jobIndustry": ["Customer Success"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Director",
      "jobExcerpt": "Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web, Figma helps entire product teams brainstorm, design and build better products — from start to finish. Whether it’s consolidating tools, simplifying workflows, or collaborating across teams and time zones, Figma makes the design process faster, more&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<div class=\"content-intro\">\n<p>Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web, Figma helps entire product teams brainstorm, design and build better products — from start to finish. Whether it’s consolidating tools, simplifying workflows, or collaborating across teams and time zones, Figma makes the design process faster, more efficient, and fun while keeping everyone on the same page. From great products to long-lasting companies, we believe that nothing great is made alone—come make with us!</p>\n</div>\n<p>As the Director, Customer Education and Community Support, you’ll have the opportunity to bring together and lead two important and impactful pillars of our support organization. On the Community side, you’ll help lead and grow our one-to-many support platforms (Twitter, Support Forum, etc.) and moderation strategy, creating a safe and engaging space for our customers to ask questions, share feedback, and learn from each other. On the Customer Education side, you’ll help develop and support our self-service efforts (Help Center, YouTube tutorials, etc.), creating high-quality resources that help customers find quick solutions and teach learners about Figma, design, development, and more.</p>\n<p><em>This is a full time role that can be held from one of our US hubs or remotely in the United States.</em></p>\n<h2>What you’ll do at Figma</h2>\n<ul>\n<li>Communicate clear vision and purpose, helping to draw the connection between Customer Education and Community Support with our broader company goals.</li>\n<li>Build and shape the future of our Customer Education and Community Support function, aligning the goals and strategies of both teams, ensuring we are focused on crafting premium self-service experiences for our customers.</li>\n<li>Improve deflection and customer education through effective self-serve, educational content strategy, and other key initiatives, ensuring that we provide a stellar experience throughout the entire customer journey.</li>\n<li>Partner with Support Operations on strategic direction and implementation of automation tooling (i.e. AI chatbots, Zendesk triggers, etc.) to improve our contact flow and help our customers self-solve with ease.</li>\n<li>Help to drive forward our localization strategies, ensuring our teams are prepared to scale globally.</li>\n<li>Define, implement, and report on key performance metrics for Scalable Support, surfacing meaningful insights to our broader Product Support organization and cross functional partners.</li>\n<li>Ensure the team is equipped to handle critical issues and incidents, providing swift customer responses and keeping our internal teams up to speed on progress and issue resolution.</li>\n<li>Coach and develop our current and up-and-coming leaders with a focus on leadership skills and career development.</li>\n<li>Collaborate with cross-functional content teams to drive growth for Figma’s YouTube channel.</li>\n<li>Deliver quality support on Twitter, our forum, and other community platforms, ensuring our customers experience a responsive and engaging experience.</li>\n</ul>\n<div class=\"section page-centered\">\n<h2>We&#8217;d love to hear from you if you have</h2>\n<ul>\n<li>10+ years of work experience with 4+ years experience leading high-performing support teams and developing leaders across multiple geographical locations.</li>\n<li>2+ years of experience as a second-line manager</li>\n<li>Experience building high-performing help centers and community forums</li>\n<li>Experience developing KPIs, with an eye towards continuously improving the customer experience</li>\n</ul>\n<h2>While it’s not required, it’s an added plus if you also have</h2>\n<ul>\n<li>Experience operating in a fast-paced, rapidly changing environment</li>\n<li>Familiarity with design processes and tools</li>\n<li>Strong technical capability and written communication skills, and a proven ability to turn complex ideas into easily understood concepts.</li>\n<li>A demonstrated understanding of people leadership with a strong passion for building effective teams and developing talent.</li>\n</ul>\n<div class=\"section page-centered\">\n<div>\n<div>At Figma, one of our values is Grow as you go. We believe in hiring smart, curious people who are excited to learn and develop their skills. If you’re excited about this role but your past experience doesn’t align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.</div>\n</div>\n</div>\n</div>\n<div class=\"content-pay-transparency\">\n<div class=\"pay-input\">\n<div class=\"description\">\n<h2><strong>Pay Transparency Disclosure</strong></h2>\n<p>If based in Figma’s San Francisco or New York hub offices, this role has the annual base salary range stated below.</p>\n<p>Job level and actual compensation will be decided based on factors including, but not limited to, individual qualifications objectively assessed during the interview process (including skills and prior relevant experience, potential impact, and scope of role), market demands, and specific work location. The listed range is a guideline, and the range for this role may be modified. For roles that are available to be filled remotely, the pay range is localized according to employee work location by a factor of between 80% and 100% of range. Please discuss your specific work location with your recruiter for more information.</p>\n<p>Figma offers equity to employees, as well a competitive package of additional benefits, including health, dental &amp; vision, retirement with company contribution, parental leave &amp; reproductive or family planning support, mental health &amp; wellness benefits, generous PTO, company recharge days, a learning &amp; development stipend, a work from home stipend, and cell phone reimbursement.  Figma also offers sales incentive pay for most sales roles. Figma’s compensation and benefits are subject to change and may be modified in the future. You may view our Pay Transparency Policy by clicking on the corresponding link.</p>\n</div>\n<div class=\"title\">Annual Base Salary Range (SF/NY Hub): $212,000<span class=\"divider\">—</span>$308,000 USD</div>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-25 08:00:08",
      "annualSalaryMin": "212000",
      "annualSalaryMax": "308000",
      "salaryCurrency": "USD"
    },
    {
      "id": 102155,
      "url": "https://jobicy.com/jobs/102155-media-sales-business-development-manager",
      "jobSlug": "102155-media-sales-business-development-manager",
      "jobTitle": "Media Sales - Business Development Manager",
      "companyName": "Blavity",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c4139b3e6879448bfada1ac3306695ba.jpg",
      "jobIndustry": ["Business Development", "Sales"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Blavity, Inc. is a venture-funded media and technology company, founded in 2014 around a simple idea: enable Black millennials to tell their own stories. Today, we are home to the largest network of platforms and lifestyle brands serving the multifaceted lives of Black millennials &amp; Gen Z through original content, video, unique experiences, and product&#8230;",
      "jobDescription": "<p>Blavity, Inc. is a venture-funded media and technology company, founded in 2014 around a simple idea: enable Black millennials to tell their own stories. Today, we are home to the largest network of platforms and lifestyle brands serving the multifaceted lives of Black millennials &amp; Gen Z through original content, video, unique experiences, and product solutions. Blavity Inc. has evolved into a market leader for Black media, reaching 250 million users per month through our growing brand portfolio, including Blavity, Blavity360º, Shadow &amp; Act, AfroTech &amp; Talent Infusion, 21Ninety, Travel Noire, and Home &amp; Texture. Our Blavity, Inc. employee community is composed of passionate, energetic, and culturally conscious individuals working together to deliver value to each other, the company, and our clients. We are always searching for new additions to our community that will help us continue to scale, contribute meaningfully to our culture, and advance our strategic direction.</p>\n<p>Job Summary: Blavity Inc. is seeking a Media Business Development Manager (BDM) to drive revenue and own and manage a book of business and clients for direct Ad Sales, experiential, custom content, and large brand campaigns. This is a quota-carrying, client-facing role that primarily collaborates with the ad Operations team, integrated marketing, and Customer Success team. The ideal candidate has a passion for results, product knowledge, and has strong rapport-building skills; which allows them to continuously acquire new business.</p>\n<p>This position reports directly into the Blavity Media Group revenue organization.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Sell Blavity Media Products (Direct, Social, Custom Content, Experiential) across our portfolio of sites by presenting our solutions against the client’s digital campaign objectives</li>\n<li>Manage the entire sales cycle from finding a potential client to securing a deal</li>\n<li>Conduct research to identify potential clients in the target market</li>\n<li>Reach out to prospects through cold calls, emails and leveraging your prior connections</li>\n<li>Respond to inbound inquiries and qualify  leads by understanding the prospect’s business needs, budget, and timeline</li>\n<li>Follow up with prospects to maintain engagement and build relationships</li>\n<li>Cultivate and lead the negotiation process by leveraging financial models to illustrate potential ad revenue, and offering strategic alternatives that serve to maintain mutually beneficial terms</li>\n<li>Schedule and execute virtual and face-to-face meetings with potential and existing clients in order to build meaningful client relationships</li>\n<li>Meet or exceed quarterly revenue goals by closing net-new business, and growing existing accounts</li>\n<li>Closely collaborate with Customer Success and Sales Operations on active campaigns to ensure healthy relationships and that billing needs are met</li>\n<li>Maintain pipeline updates and accuracy of opportunity tracking from early stage to late stage in Salesforce and other platforms; managing and communicating to cross-discipline leads key needs; staying on the pulse of all media new business generation</li>\n<li>Collaborate with and coach sales planners  in designing impactful sales strategies</li>\n<li>Ideate with integrated marketing campaigns and work with media planners to set strategies for hitting client goals.</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>Education: Bachelor&#8217;s Degree – Business or equivalent preferred</li>\n<li>Experience: 3-5+ years proven track record in carrying a 2M+ quota within brand and media agency Sales, with an existing book of business</li>\n<li>Technologies: Fluent in Microsoft Office, Google Suite and Salesforce</li>\n<li>A strong understanding of online advertising (e.g. Direct, Social), related technologies (e.g. Google Ad Manager, DCM), and advertising nomenclature (e.g. targeting, viewability, etc.)</li>\n<li>Experience at a fast-growing startup, large consumer Internet/eCommerce, ad tech, or  digital media company</li>\n<li>High-energy, company-first, positive attitude</li>\n<li>Must be motivated to work hard in a fast-paced environment</li>\n<li>Excellent communication and analytical skills; outgoing and sociable; willing to wear multiple hats</li>\n<li>A healthy appreciation of GIFs and Black culture</li>\n</ul>\n<h2>Details:</h2>\n<ul>\n<li>This is a Full-Time, Remote position.</li>\n<li>The base salary range for this role is $80 &#8211; $95,000 + Commission</li>\n</ul>",
      "pubDate": "2024-02-25 07:59:53",
      "annualSalaryMin": "80000",
      "annualSalaryMax": "95000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103554,
      "url": "https://jobicy.com/jobs/103554-junior-qa-engineer-f-m-d",
      "jobSlug": "103554-junior-qa-engineer-f-m-d",
      "jobTitle": "Junior QA Engineer (f/m/d)",
      "companyName": "Celtra",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/4d4dcabf23834ba5f3571494d0e4c80d.jpg",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "Europe,  Slovenia",
      "jobLevel": "Any",
      "jobExcerpt": "At Celtra we are looking for a Junior QA to join our team! We are a team of motivated QA engineers with ever growing technical skills and product knowledge. We have well defined processes in place that help us achieve desired level of quality and continuously improve by leveraging team KPIs and other insights. Your&#8230;",
      "jobDescription": "<p>At Celtra we are looking for a Junior QA to join our team! We are a team of motivated QA engineers with ever growing technical skills and product knowledge. We have well defined processes in place that help us achieve desired level of quality and continuously improve by leveraging team KPIs and other insights.</p>\n<h2><strong>Your initial responsibilities:</strong></h2>\n<ul>\n<li>Execute predefined testing plans on actual mobile and desktop devices.</li>\n<li>Write basic automated tests in one or more E2E test frameworks.</li>\n<li>Gain product knowledge and experience in modern SDLC practices.</li>\n</ul>\n<h2><strong>How will you grow?</strong></h2>\n<p>Through or initial mentorship and well structured onboarding program, you will:</p>\n<ul>\n<li>Learn to create and execute testing specs by reviewing technical and product specs.</li>\n<li>Assist in debugging quality related issues.</li>\n<li>Become proficient in automating regression test plans, maintaining and extending functionality using multiple E2E test frameworks.</li>\n<li>Troubleshoot client reported issues, suggest workarounds and determine priority.</li>\n<li>Gain understanding of the business, clients and market.</li>\n<li>In time, drive your own process and technical improvements that help you do your work better and positively impact people around you.<strong><br />\n</strong></li>\n</ul>\n<h2><strong>Our expectations:</strong></h2>\n<ul>\n<li>At least one year of experience in a similar role (QA, devops or development).</li>\n<li>Understanding of frontend and backend web technologies.</li>\n<li>Working knowledge of Typescript, Javascript or similar programming language.</li>\n<li>Experience in contributing to E2E or other testing frameworks is a plus.</li>\n<li>Desire to constantly learn and improve.</li>\n<li>A team player.</li>\n<li>Good verbal and written English communication skills.</li>\n</ul>\n<h2><strong>Product tech stack:</strong></h2>\n<p>The product is built using Scala, NodeJS, Vue, PHP, Spark, MySQL, Snowflake, and you will also find GoLang, MongoDb, Kinesis. Everything runs on the AWS cloud, orchestrated by the Kubernetes cluster (soon ECS).</p>\n<h2><strong>What do we offer?</strong></h2>\n<ul>\n<li>Competitive salary.</li>\n<li>Buddy and mentor that will help you grow professionally, plus a well structured development plan.</li>\n<li>Remote first working environment. You can choose to work from home or join us in our Ljubljana office.</li>\n<li>Flexible hours and work-life balance. We focus on results rather than schedules.</li>\n<li>Top-notch working equipment.</li>\n<li>We have fun. We organize regular team &amp; company events.</li>\n<li>Free breakfasts &amp; beverages available in the office.</li>\n</ul>\n<h2><strong>About Celtra</strong></h2>\n<p>Celtra helps enterprise advertisers, media, and agencies design, approve, and deliver digital creative across the ever-growing number of campaigns, markets, designs, and variants. Celtra’s Creative Automation &amp; Enablement Software for helps brands move faster than ever while dramatically scaling content production. Companies like adidas, TripAdvisor, Spotify, Unilever, NBCU, Lululemon, YETI, Vice, and hundreds more partner with Celtra to cut production costs while increasing efficiencies and output in the cloud.</p>\n<h2><strong>Empowering Creativity through Diversity &amp; Inclusion</strong></h2>\n<p>Our mission is to empower creativity &#8211; and we cannot fulfill our mission without different perspectives. Diversity drives innovation, and Celtra is committed to diversity, equity, inclusion, and belonging.</p>\n<p>Every employee is empowered at Celtra &#8211; no matter your race, age, religion, gender identity, sexual orientation, physical or mental ability, or ethnicity.  We hire the best, and develop our teams through continuous education and mentorship, in a community where everyone can bring their whole selves to work.</p>",
      "pubDate": "2024-02-25 07:58:42"
    },
    {
      "id": 103553,
      "url": "https://jobicy.com/jobs/103553-global-solutions-consultant",
      "jobSlug": "103553-global-solutions-consultant",
      "jobTitle": "Global Solutions Consultant",
      "companyName": "Lyra Health",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With our innovative digital care platform and global provider network, 10 million people can receive the best care and feel better, faster. Founded by David Ebersman, former CFO of Facebook and Genentech, Lyra has raised more than $900 million.</div>\n<h2><b>About the Role</b></h2>\n<div>As Lyra continues to provide life-changing mental health support to everyone around the world, this key sales role provides global subject matter expertise to customers and prospects to support sales of Lyra’s global workforce mental health solution. Using your minimum of five years sales experience, with demonstrable global knowledge and expertise, you will provide deep cultural, regulatory and benefit delivery, and how these differ around the world.</div>\n<div></div>\n<div>Note: This is not a clinical or technical role, but a sales role</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Providing client facing sales support and global subject matter expertise for the Partnership Directors, Strategic Alliances and Customer Success teams</li>\n<li>Leading conversations with senior Global HR/benefits leaders and consultants as it relates to Lyra’s global offering</li>\n<li>Assisting product marketing in the development of materials and collateral for Lyra’s global offerings</li>\n<li>Collecting and sharing market insights to the Global Partnership Director to inform Lyra’s global strategy</li>\n<li>Performing as the global Subject Matter Expert in RFP/RFI responses</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Experience:</h2>\n<ul>\n<li>5+ years experience working directly in the sale of global employer benefits and/or global EAP/mental health space (Highly desired)</li>\n<li>Demonstrable sales experience and target achievement (Highly desired)</li>\n<li>Experience in a high growth, fast changing environment</li>\n<li>Solid understanding of employer mental health benefits globally</li>\n<li>Passion for mental healthIntellectually curious</li>\n<li>Excellent communication skills &#8211; verbal and written</li>\n<li>Creative and scrappy problem solver who rolls up their sleeves and does what needs to be done</li>\n<li>Ability and willingness to travel (when safe)</li>\n<li>Additional language skills a bonus</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div>As a full-time Global Solutions Consultant, you will be employed by Lyra Health, Inc. The anticipated annual base salary for this full-time position is $108,000. The base rate is determined by role and level, and the base rate will depend on a number of job-related factors, including but not limited to your skills, qualifications, experience and location.</div>\n<div></div>\n<div>At Lyra, base salary is only one aspect of an employee’s total compensation package, which additionally may include discretionary restricted stock unit awards, comprehensive healthcare coverage, retirement benefits, and time off with pay. This role may also be eligible for commission payments.</div>\n<div></div>\n<div><strong>We also offer generous benefits that include:</strong></div>\n<ul>\n<li>Comprehensive healthcare coverage (including medical, dental, vision, FSA/HSA, life and disability insurances)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Competitive time off with pay policies including vacation, sick days, and company holidays</li>\n<li>Paid parental leave</li>\n<li>401K retirement benefits</li>\n<li>Monthly tech stipend</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, free food and snack deliveries each month, regular community celebration…and more!</li>\n</ul>\n</div>",
      "pubDate": "2024-02-25 07:56:26",
      "annualSalaryMin": "108000",
      "annualSalaryMax": "",
      "salaryCurrency": "USD"
    },
    {
      "id": 94644,
      "url": "https://jobicy.com/jobs/94644-customer-success-manager-44",
      "jobSlug": "94644-customer-success-manager-44",
      "jobTitle": "Sales Development Representative Manager",
      "companyName": "Givebutter",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/05/51ca261310065df6b11ed6c81972be72.jpg",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Givebutter is the most-loved nonprofit fundraising platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Instead of charging a traditional SaaS subscription&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Givebutter is the most-loved nonprofit fundraising platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Instead of charging a traditional SaaS subscription fee, Givebutter is completely free to use with a 100% transparent tip-or-fee model.</div>\n<div></div>\n<div>Givebutter has been certified as a Great Place to Work<b>®</b> in 2021, 2022, and 2023, and is the #1 rated nonprofit software company on G2 across multiple categories.</div>\n<div></div>\n<div>Our mission is to empower the changemaker in all of us. We believe giving should be fun, so you’ll want to do it again, and we also believe that work should be fun, so that you’ll have the greatest impact. We are excited to hear from talented people who want to work with other talented people in making the world a butter place—and have fun along the way.</div>\n<h2>Role Description</h2>\n<div>Givebutter is hiring a Sales Development Representative (SDR) Manager to build and scale the initial SDR motion. Givebutter has a strong Marketing, Sales (AE) team, and we are looking to build out a new segment of our lead funnel with an SDR motion.</div>\n<div></div>\n<div>As the SDR Manager, you&#8217;ll report to the Director of Sales and be the driving force behind our outbound sales efforts, spearheading initiatives to generate and qualify leads that fuel our company&#8217;s growth. The successful candidate will have a proven track record of success launching an outbound sales effort and are excited to build one at Givebutter to help scale our business and positively impact as many nonprofits as possible!</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>We want to hear from people who</h2>\n<ul>\n<li><b>Prioritize the Details and Lead with a clear “Why”:</b> Are obsessed with monitoring and optimizing sales performance, keep a close eye on critical metrics, and ensure the team is churning out results.</li>\n<li><b>Tackle Obstacles Head First:</b> Adapt to market changes, constantly refine outreach tactics, and ensure the team&#8217;s sales efforts remain in lock-step with the Go To Market strategy.</li>\n<li><b>Butter Up the Team:</b> Lead by example and set a high standard for the SDR motion by “proving it out” for two quarters as the founding SDR.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities</h2>\n<ul>\n<li>Be SDR #1 for two quarters to prove out the SDR motion and scalability of it. Be an SDR on the phones 90% of your day, scheduling meetings for AEs</li>\n<li>Transition from being the first SDR to scaling and managing a team of SDRs to scale the motion to thousands of calls each week</li>\n<li>Hire, train, and manage a team of SDRs who care about closing deals while truly caring about helping nonprofits</li>\n<li>Work closely with the RevOps &amp; Marketing teams to streamline and automate the lead list creation, transfer of leads to AEs, and increase book rate from calls</li>\n<li>Create the SDR playbook; how to call, objections, details, verticals, and more.</li>\n<li>Ideate on automations; followup sequences, voicemail drops, linkedin connections, and more.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements</h2>\n<ul>\n<li>3+ years as an individual contributor (SDR &amp; AE)</li>\n<li>3+ years of SDR manager experience building and scaling SDR motions</li>\n<li>Prior experience selling SaaS and/or into Nonprofits</li>\n<li>Experience with CRM (Hubspot, Salesforce, etc..), data insights (Hubspot, Gong, Hex/Metabase), and Multi dialers(Aircall, Five9, Justcall, etc…)</li>\n<li>Excited to tackle problems head on with a teamwork mentality. You will work closely with the RevOps &amp; Marketing teams to build out the datasets and lead lists</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div>$170,000 &#8211; $180,000 a year</div>\n</div>\n</div>",
      "pubDate": "2024-02-25 07:53:52",
      "annualSalaryMin": "170000",
      "annualSalaryMax": "180000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103551,
      "url": "https://jobicy.com/jobs/103551-site-reliability-engineer-11",
      "jobSlug": "103551-site-reliability-engineer-11",
      "jobTitle": "Site Reliability Engineer",
      "companyName": "Mozilla",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/mozilla.jpg",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people around the world using our products each month,&#8230;",
      "jobDescription": "<p>Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than <strong>225</strong> million people around the world using our products each month, we’re shaping the next 25 years of technology. Our work focuses on diverse areas including AI, social media, security and more. And we’re doing this while never losing our focus on our core mission – to make the internet better for everyone.</p>\n<p>The Mozilla Corporation is wholly owned by the non-profit 501(c) Mozilla Foundation. This means we aren’t beholden to any shareholders — only to our mission. Along with <strong>60,000</strong>+ volunteer contributors and collaborators all over the world, Mozillians design, build and distribute <strong>open-source</strong> software that enables people to enjoy the internet on their terms.</p>\n<h2><strong>About this team and role:</strong></h2>\n<p>Mozilla’s SRE Team is looking for an engineer to aid in constructing and maintaining infrastructure supporting Mozilla products. This role involves blending Site Reliability Engineering and Software Development skills to influence product architecture and evolution by crafting reliable cloud-based infrastructure for internal and external services. Working with engineering and product teams, this SRE position involves significant engineering projects across the company, collaborating with diverse engineers, focusing on system enhancements, building new architecture, tool assessment, and removing toil.</p>\n<h2><strong>What you’ll do:</strong></h2>\n<ul>\n<li>Automate tasks and processes using scripting languages and configuration management tools</li>\n<li>Spot and raise potential issues to the team, typically focused on Reliability</li>\n<li>Participate in on-call for production reliability and services</li>\n<li>Demonstrate ownership and accountability in the delivery of work</li>\n<li>Be trusted to help resolve unclear but urgent tasks</li>\n<li>Assist in monitoring, troubleshooting, and resolving incidents</li>\n<li>Document processes, configurations, and procedures</li>\n</ul>\n<h2><strong>What you’ll bring:</strong></h2>\n<ul>\n<li>Bachelor&#8217;s degree in Computer Science, Information Technology or a related field, or 1-2 years of experience in related field</li>\n<li>Demonstrated experience with Google Cloud Platform (GCP), infrastructure as code (e.g. Terraform), and containerization (e.g. Docker containers and Kubernetes). Experience with other clouds (AWS and Azure), when combined with GCP certification, is a plus.</li>\n<li>Knowledge of networking concepts and protocols (TCP/IP, DNS, HTTP/HTTPS, load balancing)</li>\n<li>Experience in programming languages such as: Python, Go, Node.js, Rust, Ruby</li>\n<li>Curiosity and interest in learning new things and solving problems</li>\n<li>Strong written and verbal communication skills</li>\n<li>Ability to work collaboratively across diverse groups in a remote setting</li>\n<li>Commitment to our values:\n<ul>\n<li>Welcoming differences</li>\n<li>Being relationship-minded</li>\n<li>Practicing responsible participation</li>\n<li>Having grit</li>\n</ul>\n</li>\n</ul>\n<h2><strong>Bonus points for…</strong></h2>\n<ul>\n<li>Google Cloud Certifications</li>\n<li>Experience with Infrastructure As Code and Configuration as Code tooling (Puppet, Chef, Ansible, Salt, Terraform, Amazon Cloudformation or Google Cloud Deployment Manager)</li>\n<li>Experience running services in a cloud environment</li>\n<li>Experience with CI/CD orchestration (Jenkins, CircleCI, or Github Actions)</li>\n<li>Understanding of web servers such as Nginx and Apache</li>\n<li>Knowledge of Observability, including monitoring and logging tools</li>\n<li>Open source software involvement</li>\n</ul>\n<h2><strong>What you’ll get:</strong></h2>\n<ul>\n<li>Generous performance-based bonus plans to all regular employees &#8211; we share in our success as one team</li>\n<li>Rich medical, dental, and vision coverage</li>\n<li>Generous retirement contributions with 100% immediate vesting (regardless of whether you contribute)</li>\n<li>Quarterly all-company wellness days where everyone takes a pause together</li>\n<li>Country specific holidays plus a day off for your birthday</li>\n<li>One-time home office stipend</li>\n<li>Annual professional development budget</li>\n<li>Quarterly well-being stipend</li>\n<li>Considerable paid parental leave</li>\n<li>Employee referral bonus program</li>\n<li>Other benefits (life/AD&amp;D, disability, EAP, etc. &#8211; varies by country)</li>\n</ul>\n<h2><strong>About Mozilla </strong></h2>\n<p>When you work at Mozilla, you give yourself a chance to make a difference in the lives of web users everywhere. And you give us a chance to make a difference in your life every single day. Join us to work on the web as the platform and help create more opportunity and innovation for everyone online.  We’re not a normal tech company. The things we create prioritize people and their privacy over profits. We exist to make the internet a healthier,  happier place for everyone</p>",
      "pubDate": "2024-02-25 07:49:08"
    },
    {
      "id": 96541,
      "url": "https://jobicy.com/jobs/96541-commercial-account-executive-uk",
      "jobSlug": "96541-commercial-account-executive-uk",
      "jobTitle": "Commercial Account Executive (UK)",
      "companyName": "Kong Inc.",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/f43352b801f4c6854ba70c5f70cec7cd.jpeg",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "UK",
      "jobLevel": "Any",
      "jobExcerpt": "If you don’t think you meet all of the criteria below but are still interested in the job, please apply.  Nobody checks every box &#8211; we’re looking for candidates that are particularly strong in a few areas, and have some interest and capabilities in others. About the role We are looking for an experienced sales&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>If you don’t think you meet all of the criteria below but are still interested in the job, please apply.  Nobody checks every box &#8211; we’re looking for candidates that are particularly strong in a few areas, and have some interest and capabilities in others.</div>\n<h2><b>About the role</b></h2>\n<div>We are looking for an experienced sales professional, ideally with open source experience who will be selling into mid market enterprise accounts.  The ideal candidate has been a part of the sales efforts for other early-stage enterprise products in an entrepreneurial setting. The Account Executive will be integral to our growth plan and in acquiring new customers. Kong’s Account Executive will be the primary point of contact and the face of Kong for our prospects.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you&#8217;ll be doing</h2>\n<ul>\n<li>Sell Kong Enterprise Platform on Kong’s Commercial sales team</li>\n<li>Meet and/or exceed individual quota, objectives and KPIs</li>\n<li>Take ownership to build and manage your book of business, which includes understanding and documenting the buying criteria and process, determining the appropriate motion and patterns, ensuring pipeline accuracy based on evidence, and working the leads to closure</li>\n<li>Collaborate and leverage an ecosystem of resources including pre sales, post sales, channel partners, customer success and leadership to promote Kong and drive new business</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you&#8217;ll bring</h2>\n<ul>\n<li>A true desire to see customers benefit from the investment they make with Kong</li>\n<li>2+ years of experience in direct sales experience selling enterprise software to mid-size to large enterprises with open source, APIs, and/or infrastructure software</li>\n<li>Effective communicator and strong interpersonal skills</li>\n<li>Excellent negotiation, presentation and closing skills</li>\n<li>Experience with fast growing startups is a plus</li>\n<li>Strong background in territory planning and revenue generated from outbound pipeline</li>\n<li>You have a measurable track record in new business development and over achieving sales targets</li>\n<li>Knowledge of MEDDIC and Challenger methodologies is a plus</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>About you</h2>\n<ul>\n<li>A top performer with 3-5 years experience hunting and closing net new logos</li>\n<li>Experienced with creatively sourcing companies outside of your CRM</li>\n<li>You have previously worked in an early-stage company and you know how to navigate and be successful in a fast-growing organization</li>\n<li>Motivated, collaborative, driven and results oriented</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>What is a Konger?</b></h2>\n<div>We are a group of makers, thinkers, and doers focused on helping today’s developers build tomorrow’s technology. Our teams work on the bleeding edge of API innovation to provide our users with a central nervous system for data and services.</div>\n<div></div>\n<div>We put design at the heart of everything we do, and we’re relentlessly focused on creating beautiful experiences for our customers. That’s why technology companies, major banks, e-commerce innovators, and government agencies put Kong in front of their most important web applications.</div>\n<div></div>\n<div>We believe in the power of Open Source and everything it stands for. That’s why developers around the world enthusiastically contribute on top of our open-source platform.</div>\n<div></div>\n<div>We are passionate about solving challenges that will fundamentally shape the future of technology, and we’re looking for the right people to join us on our mission. If you believe in taking ownership of your work, making an impact, and having fun along the way, we would love to talk to you.</div>\n</div>",
      "pubDate": "2024-02-25 07:44:56"
    },
    {
      "id": 81255,
      "url": "https://jobicy.com/jobs/81255-social-media-manager-3",
      "jobSlug": "81255-social-media-manager-3",
      "jobTitle": "Social Media Manager",
      "companyName": "Designit",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/0802726040e35f2f86749890d2cbb6ba.jpeg",
      "jobIndustry": ["Social Media Marketing"],
      "jobType": ["full-time"],
      "jobGeo": "LATAM,  Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "Do you have great social media marketing chops? Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who are curious, have a growth mindset and are looking to help drive the future of social! We’re looking for a hybrid Senior Social Media Marketing Manager&#8230;",
      "jobDescription": "<p>Do you have great social media marketing chops? Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who are curious, have a growth mindset and are looking to help drive the future of social!</p>\n<p>We’re looking for a hybrid Senior Social Media Marketing Manager to drive impact with one of our leading client teams. The ideal candidate understands both paid and organic social strategy, can streamline processes and communications, and has strong foundational knowledge of primary social platforms to foster a more holistic approach. You should have strong business acumen and excel at strategic thinking, project management, problem solving, and collaborating across teams.</p>\n<h2><strong>What you will do</strong></h2>\n<ul>\n<li>Serve as a social media point of contact for stakeholders across the business.</li>\n<li>Continuously drive target audience insights to inform strategy planning</li>\n<li>Approve creative and copy for organic and paid social campaigns</li>\n<li>Provide stakeholders with strategic plans for organic and paid social media deployment</li>\n<li>Create and advise on processes, governance, and best practices pertaining to demand generation</li>\n<li>Leverage social measurement tools and dashboards to compile data from several social media platforms and ingest into monthly reports, including analysis for insights, optimizations, and future strategy development</li>\n<li>Own the execution of social amplification programming supporting demand generation assets and campaigns</li>\n<li>Facilitate content review and distribution, editorial planning, communication and support between stakeholder partners</li>\n<li>Measure and report performance against goals and objectives, and collaborate with analytics resources to interpret data into actionable insights. This may include monthly reports, organic/paid campaign reports, ad hoc reporting, and social listening and competitor observations and recommendations</li>\n<li>Manage agency partners and coordinate with multiple vendors and teams for day-to-day execution</li>\n<li>Work with graphic design and copywriting team to concept and execute social media creative assets</li>\n</ul>\n<h2><strong>What you bring</strong></h2>\n<ul>\n<li> 7+ years of marketing experience</li>\n<li>2+ years of experience managing social media programs and strategy</li>\n<li>2+ years of experience with social scheduling and monitoring tools (Preferably Sprinklr)</li>\n<li>2+ years of experience managing and executing events and related activities</li>\n<li>1+ year of creative and/or copywriting experience</li>\n<li>Experience growing and managing a team with a focus on professional development and growth for direct reports</li>\n<li>Subject matter expertise in the use of social media platforms (Facebook, Twitter, LinkedIn, YouTube, Instagram, etc.) with a strong understanding of the digital marketing landscape</li>\n<li>Ability to work successfully with diverse groups of stakeholders across companies to ensure successful planning, execution, and reporting</li>\n<li>A high degree of skill at interpreting data to inform strategy and provide actionable insights</li>\n<li>A customer service mindset when working with stakeholders</li>\n<li>Proficiency in Microsoft Outlook, PowerPoint, Excel and Teams</li>\n<li>Microsoft experience a plus</li>\n<li>Social listening experience a plus</li>\n</ul>\n<h2><strong>Who you are</strong></h2>\n<ul>\n<li>You are passionate about social media</li>\n<li>You have top-notch interpersonal, communication, and presentation skills; you communicate effectively with stakeholders, team members, and senior managers</li>\n<li>You manage ambiguity with unwavering persistence; you drive workgroups to consensus and meaningful outcomes</li>\n<li>You are collaborative to the core, with a demonstrated ability to work in a team environment as a leader and a member</li>\n<li>You are a highly proactive, highly organized, self-starter capable of effectively managing several projects simultaneously with impeccable attention to detail.</li>\n<li>You are self-sufficient: you can work with little direct supervision, but you know when to ask for help</li>\n<li>You are highly motivated to accomplish recurring tasks and solve problems with strong focus and follow-through</li>\n<li>You demonstrate positivity and optimism</li>\n<li>You are comfortable working remotely</li>\n</ul>\n<h2><strong>Would you like to join a global organization that</strong></h2>\n<ul>\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe &#8211; diversity will enable us to strengthen our impact</li>\n<li>Encourages innovation and experimentation</li>\n<li>Understands that changes will occur and adaptability is crucial to assist when it does</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n<p>Compensation Range: $90,000 &#8211; $115,000. This compensation range is indicative of the role. Compensation offered is on the basis of evaluation during interview process, the candidates range and depth of experience, business and market financials and internal pay parity.</p>",
      "pubDate": "2024-02-25 07:43:30",
      "annualSalaryMin": "90000",
      "annualSalaryMax": "115000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103550,
      "url": "https://jobicy.com/jobs/103550-technical-success-manager-2",
      "jobSlug": "103550-technical-success-manager-2",
      "jobTitle": "Technical Success Manager",
      "companyName": "Experian",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/dcc5b29a570bb19b9f5c3e150db2fdfe.jpg",
      "jobIndustry": ["Technical Support"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that FORTUNE has named Experian one of the 100 Best Companies to work for. In addition, for the last five years we’ve been named in the 100&#8230;",
      "jobDescription": "<section id=\"st-companyDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<p>Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that FORTUNE has named Experian one of the 100 Best Companies to work for. In addition, for the last five years we’ve been named in the 100 World’s Most Innovative Companies by Forbes Magazine. With a focus on our employees, we have been certified for the third time as Great Place To Work (GPTW). Experian Consumer Information Services is redefining the way our clients do business within all aspects of the customer credit lifecycle. Fueled by best-in-class data and innovative technology we help businesses make smarter decisions, identify consumers, make decisions on loans, market to prospects and collect.</p>\n</div>\n</section>\n<section id=\"st-jobDescription\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Job Description</h2>\n</div>\n<div class=\"wysiwyg\">\n<p><strong>What you’ll be doing</strong></p>\n<p>Acting as a single point of contact for technical consulting and assisting our Account/Project Managers, Product and Tech Support, and Engineers with new and ongoing technical communications for existing clients including security updates and software support, the Technical Success Manager will:</p>\n<ul>\n<li>Communicate P1/P2 incident status to account team and client.</li>\n<li>Ensure effective ownership, communication, coordination, and facilitation of service issues and production changes between the client, support teams, account team and technical teams.</li>\n<li>As a subject matter expert of the account, provide evaluation when available to support the team for any client tickets, as well as monitor and maintain quality on all tickets and cases.</li>\n<li>Analyze and report on cases and tickets to spot reoccurring trends and provide recommendations to client and/or technical teams for remediation.</li>\n<li>Ensure all cases and incidents are properly documented, SLAs are met, and that resolution occurs in a timely manner.</li>\n<li>Responsible for aggregating all non-incident Client requests for changes to production and driving execution in alignment with contracts and client’s priorities.</li>\n<li>Help ensure that the proper monitoring is in place at the platform and client specific solution level and help drive resolution to issues as required.</li>\n<li>Participates in daily / weekly / monthly operational calls and status updates to ensure alignment across internal and external stakeholders.</li>\n<li>Develop strategies to facilitate the continuous improvement of customer service.</li>\n<li>Provide feedback to Experian Product Development teams to help identify reoccurring service issues that require updates to features or products.</li>\n<li>Help analyze customers’ needs and suggest potential new services for Client consideration.</li>\n<li>Be the Technology <u>Voice</u> for all Experian Product, Platform and Technology.</li>\n</ul>\n</div>\n</section>\n<section id=\"st-qualifications\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Qualifications</h2>\n</div>\n<div class=\"wysiwyg\">\n<ul>\n<li>+4 years of technical client-facing experience</li>\n<li>Strong knowledge of enterprise technology infrastructure including various operating systems, servers, storage, and networking</li>\n<li>Knowledge of enterprise server software including Windows Server, Linux, and monitoring technologies</li>\n<li>Knowledge of cloud computing concepts, software and systems (networking, virtualization, VMware, Hyper-visors)</li>\n<li>Ability to query ad hoc data in various reporting platforms</li>\n<li>Ability to navigate and troubleshoot in ticketing systems, bug submission and other support systems</li>\n<li>Ability to identify and submit product enhancement requests</li>\n<li>Able to think analytically and consider all client configs, as well as dive into the details, and know when to operate at each of those levels.</li>\n<li>Strong analytical and problem-solving capabilities; able to break complex technical hurdles into measurable actions.</li>\n<li>Excellent communication skills; equally comfortable speaking to internal or external technical teams and non-technical teams</li>\n<li>Strong presentation skills, including ability to present to any level within the company</li>\n<li>Must have ability and desire to work in a high-pressure, fast-paced environment and be able to handle several projects and tasks simultaneously</li>\n<li>Strong account management, cross-group collaboration, and negotiation skills</li>\n<li>Outstanding interpersonal skills and conflict management skills</li>\n<li>Quickly develops rapport and credibility</li>\n<li>Highly organized and self-motivated; able to manage multiple important investigations simultaneously, with little direction.</li>\n<li>IT business process, Project Management, or service delivery certifications (ITIL, PMP, etc.) preferred.</li>\n</ul>\n</div>\n</section>\n<section id=\"st-additionalInformation\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Additional Information</h2>\n</div>\n<div class=\"wysiwyg\">\n<p>Our benefits include: Medical, life and dental insurance, Asociación Solidarista, International Share Save Plan, Flex Work, Work from home, Paid time off, Annual Performance Bonus, Education Reimbursement, Family Bonding, Bereavement Leave, Referral Program, and more.</p>\n<p>Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.</p>\n</div>\n</section>",
      "pubDate": "2024-02-25 07:42:34"
    },
    {
      "id": 103552,
      "url": "https://jobicy.com/jobs/103552-support-readiness-specialist-service-delivery",
      "jobSlug": "103552-support-readiness-specialist-service-delivery",
      "jobTitle": "Support Readiness Specialist - Service Delivery",
      "companyName": "GitLab",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201207055737-109952.jpg",
      "jobIndustry": ["Customer Success"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "The Support Readiness team works within the Customer Support Department to make sure our Support Engineers and leadership are equipped with the best data, tooling and training required to delight GitLab’s customers. As a Support Readiness Specialist in Service Delivery you will be responsible for using data to drive better outcomes for our customers and the Customer&#8230;",
      "jobDescription": "<div class=\"section page-centered\">\n<div class=\"section page-centered\">\n<div class=\"something\">\n<p>The Support Readiness team works within the Customer Support Department to make sure our Support Engineers and leadership are equipped with the best data, tooling and training required to delight GitLab’s customers.</p>\n<p>As a Support Readiness Specialist in Service Delivery you will be responsible for using data to drive better outcomes for our customers and the Customer Support team. In this role you will be creating dashboards, gathering metrics for executive business reviews and using data to help inform targeted interventions in training, tooling or process.</p>\n<p>In this role you’ll be interacting with individuals across the business: talking with Product Managers, Data Engineers, Customer Success Managers and Executives. <strong>Some examples of our projects: </strong></p>\n<p>When you are not tackling your normal day to day challenges, you’ll have a lot of freedom to work on things that will make your life, and the lives of your coworkers, easier. Current and past Support Readiness have:</p>\n<ul>\n<li>Created tooling to generate weekly 1-1 issues for Support Engineers containing metrics, random tickets to review, etc.</li>\n<li>Developed tooling to generate weekly account deletion reports.</li>\n<li>Leaned into dogfooding by having various aspects of Zendesk version controlled via GitLab.com.</li>\n</ul>\n<h2><strong>What you’ll do</strong></h2>\n<p>As a Support Readiness Specialist &#8211; Service Delivery, you will be responsible for ensuring that support quality remains high by gathering metrics, identifying trends, and working cross-functionally to communicate those trends. To do this, you&#8217;ll:</p>\n<ul>\n<li>Work with Support Managers and the Director of Support Readiness to identify ticket trends and health by customer and ticket types.</li>\n<li>Monitor trending product usage, adoption and satisfaction issues in tickets to provide insights to your counterparts in Customer Support, Product Management, and Quality to help inform priorities based on customer impact and support efficiency.</li>\n<li>Build two-way roads between Product and Support by working with the pool of global Support Engineers acting as Support Stable Counterparts.</li>\n<li>Own and drive projects to completion in agreement with relevant stakeholders in a cross-departmental function.</li>\n<li>Manage a fast-paced queue of requests, prioritize requests according to business impact, and drive to appropriate completion dates.</li>\n<li>Understand internal customer needs and business context to provide outstanding support and maintain high customer satisfaction.</li>\n</ul>\n<h2><strong>What you’ll bring </strong></h2>\n<ul>\n<li>1-3 years experience in a business-supporting role, with proven ability to support diverse customers needs.</li>\n<li>Top-notch data analysis skills; pulling data from a variety of sources to generate meaningful insights.</li>\n<li>An ability to use GitLab, or a readiness to learn how to fully utilize GitLab.</li>\n<li>Proven ability to solve practical business problems, understanding of business processes, and ability to translate business requirements into reporting functionality.</li>\n<li>Strong team player and service-oriented attitude with a customer focus.</li>\n<li>Excellent written and verbal communication.</li>\n<li>An eye for detail and out-of-the-box thinking.</li>\n</ul>\n<h2><strong>About the team</strong></h2>\n<p>The Support Readiness team is a team-within-a-team that makes sure that Customer Support is able to delight GitLab’s customers. We’re composed of a variety of specialists who focus on our operational, training and data needs. There’s plenty of opportunity to cross-train and extend into new areas, as we (like GitLab globally) hold that <em>everyone can contribute.</em></p>\n<p>As a smaller section of a larger org, we have a small team feel while we work together to build the good bones that a Support organization needs to succeed.</p>\n<p><em>Please note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you&#8217;re excited about this role, please apply and allow our recruiters to assess your application.</em></p>\n</div>\n</div>\n</div>\n<div class=\"content-pay-transparency\">\n<div class=\"pay-input\">\n<div class=\"description\"><em><span data-sheets-formula-bar-text-style=\"font-size:12px;color:#000000;font-weight:normal;text-decoration:none;font-family:'Arial';font-style:normal;text-decoration-skip-ink:none;\">The base salary range for this role’s listed level is currently for residents of listed locations only. Grade level and salary ranges are determined through interviews and a review of education, experience, knowledge, skills, abilities of the applicant, equity with other team members, and alignment with market data. See more information on our </span>benefits<span data-sheets-formula-bar-text-style=\"font-size:12px;color:#000000;font-weight:normal;text-decoration:none;font-family:'Arial';font-style:normal;text-decoration-skip-ink:none;\"> and </span>equity<span data-sheets-formula-bar-text-style=\"font-size:12px;color:#000000;font-weight:normal;text-decoration:none;font-family:'Arial';font-style:normal;text-decoration-skip-ink:none;\">. Sales roles are also eligible for incentive pay targeted at up to 100% of the offered base salary.</span></em></div>\n<div></div>\n<div class=\"title\">Colorado/Washington pay range $58,800<span class=\"divider\">—</span>$113,400 USD</div>\n</div>\n<div class=\"pay-input\">\n<div class=\"title\">California/Hawaii/New York/New Jersey pay range $58,800<span class=\"divider\">—</span>$126,000 USD</div>\n</div>\n</div>",
      "pubDate": "2024-02-25 07:31:02"
    },
    {
      "id": 103542,
      "url": "https://jobicy.com/jobs/103542-senior-ui-ux-designer-3",
      "jobSlug": "103542-senior-ui-ux-designer-3",
      "jobTitle": "Senior UI/UX Designer",
      "companyName": "Uscreen",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029095734-733605.jpg",
      "jobIndustry": ["Web &amp; App Design"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Senior",
      "jobExcerpt": "Uscreen is a growing, bootstrapped, product-led SaaS business changing the way video creators and entrepreneurs launch businesses around their content and communities. Our all-in-one membership platform empowers creators to generate revenue through subscriptions, communities, apps, and live-streaming where their fans need them most (web, mobile, and TV). Over 25,000 video creators launched, manage, and grow&#8230;",
      "jobDescription": "<p>Uscreen is a growing, bootstrapped, product-led SaaS business changing the way video creators and entrepreneurs launch businesses around their content and communities. Our all-in-one membership platform empowers creators to generate revenue through subscriptions, communities, apps, and live-streaming where their fans need them most (web, mobile, and TV).</p>\n<p>Over 25,000 video creators launched, manage, and grow their membership businesses with Uscreen, generating hundreds of millions of dollars in the process.</p>\n<p>We are seeking a talented and experienced Senior UI/UX Designer to join our creative team. The ideal candidate will have a proven track record of designing intuitive and visually appealing user interfaces, with a strong focus on user experience. As a Senior UI/UX Designer, you will be responsible for leading the design process from concept to execution, collaborating with cross-functional teams to create exceptional digital experiences for our users.</p>\n<h2>What you’ll do:</h2>\n<ul>\n<li>Lead the design process from concept to execution, including conducting user research, creating wireframes and prototypes, and delivering high-fidelity designs</li>\n<li>Collaborate with cross-functional teams, including product managers, engineers, and other designers, to translate user needs and business objectives into effective design solutions</li>\n<li>Develop and maintain design systems and style guides to ensure consistency and scalability across our digital products and platforms</li>\n<li>Conduct usability testing and gather feedback to iterate on design solutions and improve user experience</li>\n<li>Stay updated on industry trends and best practices in UI/UX design, and share insights and recommendations with the team</li>\n</ul>\n<h2>Do you have what it takes?</h2>\n<ul>\n<li>Degree in Design, Human-Computer Interaction, or a related field</li>\n<li>3-5 years of experience in UI/UX design, with a strong portfolio showcasing a range of design work, including web and mobile applications</li>\n<li>Proficiency in design tools such as Sketch, Figma, Adobe Creative Suite, etc</li>\n<li>Good understanding of front-end development technologies (HTML, CSS, JavaScript) and their impact on design</li>\n<li>Experience working in an Agile development environment and collaborating with cross-functional teams</li>\n<li>Excellent communication and collaboration skills, with the ability to work effectively with stakeholders at all levels of the organization</li>\n</ul>\n<h2>Key attributes:</h2>\n<ul>\n<li>Strategic Thinker: Ability to understand business goals and user needs, and translate them into effective design solutions that drive user engagement and satisfaction</li>\n<li>Creative Visionary: Demonstrated creativity and innovation in designing user interfaces and experiences that are both visually stunning and highly functional</li>\n<li>User-Centered Approach: Strong understanding of user-centered design principles and methodologies, with a passion for creating intuitive and seamless user experiences</li>\n<li>Leadership Skills: Proven ability to lead design projects and mentor junior designers, fostering a collaborative and supportive team environment</li>\n<li>Technical Proficiency: Proficiency in design tools such as Sketch, Figma, Adobe Creative Suite, etc., have an understanding of front-end development technologies (HTML, CSS, JavaScript)</li>\n<li>Problem Solver: Ability to identify design challenges and develop creative solutions that address user needs and business objectives</li>\n<li>Excellent Communication: Strong communication and presentation skills, with the ability to articulate design decisions and rationale effectively to stakeholders and team members</li>\n<li>Attention to Detail: Meticulous attention to detail in all aspects of design, including layout, typography, color, and interaction design</li>\n<li>Adaptability: Ability to thrive in a fast-paced, dynamic environment and adapt quickly to changing priorities and requirements</li>\n<li>Continuous Learner: A growth mindset and a commitment to staying updated on the latest trends, tools, and best practices in UI/UX design</li>\n</ul>\n<h2>Our commitment to you:</h2>\n<ul>\n<li> We know your worth and will compensate you competitively.</li>\n<li> Our unlimited PTO policy encourages every team member to take the time they need to unwind and recharge.</li>\n<li> Your growth is our growth! We’ll provide you with access to best-in-class training, workshops, and conferences to help you develop and succeed in your role.</li>\n<li> It’s a marathon, not a sprint. We make sure you have a clear growth plan to help you get to the next level at Uscreen.</li>\n<li> 100% Remote &#8211; Work from wherever your heart desires, as long as you have access to stable internet and a conducive workspace.</li>\n<li> We also offer flexible parental leave.</li>\n<li> Your home office should be ergonomic and inspirational to help you make some magic ✨. We’ll give you a generous WFH stipend to help you set one up.</li>\n<li> And if WFH is not for you, we’re happy to pay for your coworking space.</li>\n<li> We’re proud to offer personal development and mental wellness stipend.</li>\n<li> ​​ We host virtual social events and company retreats filled with fun activities to ensure you feel part of the Uscreen family.</li>\n</ul>\n<h2>Are you interested in applying?</h2>\n<p>Interested candidates are invited to submit their CV and short summary explaining why they believe they&#8217;re a good fit for the role, and a portfolio showcasing their design work. We will review the applications and email candidates who qualify to set up a first-round interview.</p>",
      "pubDate": "2024-02-24 18:24:15"
    },
    {
      "id": 98596,
      "url": "https://jobicy.com/jobs/98596-live-support-specialist-mexico",
      "jobSlug": "98596-live-support-specialist-mexico",
      "jobTitle": "Live Support Specialist - Mexico",
      "companyName": "Kraken",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210307081105-509016.png",
      "jobIndustry": ["Customer Success"],
      "jobType": ["full-time"],
      "jobGeo": "Mexico",
      "jobLevel": "Any",
      "jobExcerpt": "Our Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology. What makes us different? Kraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that&#8230;",
      "jobDescription": "<p>Our Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology.</p>\n<p><strong>What makes us different?</strong></p>\n<p>Kraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that everyone can achieve financial freedom and inclusion. For over a decade, Kraken’s focus on our mission and crypto ethos has attracted many of the most talented crypto experts in the world.</p>\n<p>As a fully remote company, we have Krakenites in 60+ countries who speak over 50 languages. Krakenites are industry pioneers who develop premium crypto products for experienced traders, institutions, and newcomers to the space. Kraken is committed to industry-leading security, crypto education, and world-class client support through our products like Kraken Pro, Kraken NFT, and Kraken Futures.</p>\n<h2>The Team</h2>\n<p>By combining in-depth crypto knowledge, a passion for the industry, and a strong technical background, our Live Support team plays a strong role in our success and ability to deliver world class support. The Live Support team is critical in our mission of bringing crypto to every corner of the world, and is full of bright, charismatic individuals with a knack for helping others. Not only are they bright, but also vigilant and in-touch with the ever changing crypto world. Our Live Support team is incredibly adaptable, adjusting workflows and processes in matters of minutes to accommodate our clients’ requests and ensure that their Kraken experience is something to remember. In many cases, the Live Support team is the first point of contact for our clients, and it is our duty to leave a fantastic impression, while making sure inquiries are handled directly or escalated to the appropriate specialists.</p>\n<p><strong>This is a fully remote role requiring English and either Spanish or French fluency, based in Mexico.  You must be willing to work evenings and weekends.</strong></p>\n<p>We&#8217;re seeking passionate, security-first client experience wizards who are absolutely pumped about digital assets!</p>\n<p>Imagine this: You&#8217;re part of a dynamic, top-tier team of client experience all-stars, working full-time and remotely. But here&#8217;s the kicker: Our mission is what fuels our fire! We&#8217;re talking about an unwavering commitment to making the crypto universe a better place for each Kraken client by providing a 6 star client experience on each interaction!</p>\n<h2><strong>The Opportunity</strong></h2>\n<ul>\n<li><strong>Client Interaction: </strong>Handle frontline client interactions through phone support and chat, prioritizing swift issue resolution and exceptional client care</li>\n<li><strong>Comprehensive Training:</strong> Participate in rigorous training sessions spanning diverse topics, embracing a growth-oriented mindset for continuous learning about the industry, our extensive product line, and service offerings</li>\n<li><strong>Performance Excellence:</strong> Attain performance targets established by your Team Lead/Supervisor, aligning with Kraken’s overarching objectives</li>\n<li><strong>Crypto Market Expertise:</strong> Leverage your crypto market knowledge to tackle intricate challenges within a dynamic environment</li>\n<li><strong>Ongoing Support:</strong> Engage in regular one-on-one video sessions and coaching with your Team Lead</li>\n</ul>\n<h2><strong>Skills you should HODL</strong></h2>\n<ul>\n<li><strong>Security and Privacy Focus:</strong> Prioritize security and privacy for Kraken and our clients</li>\n<li><strong>Mission-Driven:</strong> Motivated by Kraken&#8217;s mission and driven to create a seamless support experience for our diverse global client base</li>\n<li><strong>Flexibility:</strong> This is a full-time, 100% remote role, with various schedules and weekends required</li>\n<li><strong>Language Proficiency:</strong> Fluent in English and either Spanish or French</li>\n<li><strong>Crypto Proficiency: </strong>Possess a deep understanding of the digital asset industry and a strong knowledge of cryptocurrencies and trading</li>\n<li><strong>Client Support Experience:</strong> Minimum of 1 year of experience in providing phone support, email, and/or instant messaging support to clients</li>\n<li><strong>Effective Communication:</strong> Excellent communication skills</li>\n<li><strong>Adaptability:</strong> Ability to thrive in a fast-paced environment</li>\n</ul>\n<h2><strong>Interested so far? Here’s how the hiring process will look</strong></h2>\n<ul>\n<li>Pre-screen assessment &#8211; around crypto and client support (to be completed in 72 hours)</li>\n<li>Video screen with our Talent Acquisition team (30 minutes)</li>\n<li>Interview with the team (60 minutes)</li>\n<li>Final interview with team managers/directors (60 minutes)</li>\n</ul>\n<p>Kraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don&#8217;t fully meet the listed requirements, especially if you&#8217;re passionate or knowledgable about crypto!</p>",
      "pubDate": "2024-02-24 08:36:13"
    },
    {
      "id": 75278,
      "url": "https://jobicy.com/jobs/75278-people-operations-specialist-chinese-and-english",
      "jobSlug": "75278-people-operations-specialist-chinese-and-english",
      "jobTitle": "People Operations Manager (Chinese / English)",
      "companyName": "Scroll.io",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/105078d294d30c978ca2badf7f376934.jpg",
      "jobIndustry": ["HR &amp; Recruiting"],
      "jobType": ["full-time"],
      "jobGeo": "EMEA,  Europe",
      "jobLevel": "Any",
      "jobExcerpt": "We are looking for a People Operations Manager who will provide essential support for our globally distributed remote team. The role includes administrative assistance, coordinating global internal events, and facilitating various People programs. The ideal candidate should possess strong attention-to-detail and organizational skills, along with the ability to effectively manage multiple concurrent projects and tasks&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We are looking for a People Operations Manager who will provide essential support for our globally distributed remote team. The role includes administrative assistance, coordinating global internal events, and facilitating various People programs. The ideal candidate should possess strong attention-to-detail and organizational skills, along with the ability to effectively manage multiple concurrent projects and tasks in a fast-paced and rapidly growing environment.</div>\n<div></div>\n<div>We value individuals who have a meticulous and professional approach, understanding how to support each team&#8217;s growth and scalability. A positive attitude, strong ownership mentality, and excellent communication skills are essential. At Scroll, we prioritize our employee relationships and strive to provide the best experience from onboarding to becoming a Scroll alumni.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Serve as the primary point of contact for employees worldwide, addressing their HR needs.</li>\n<li>Collaborate closely with the People Lead and leadership teams to ensure HR compliance (e.g. EOR/PEO), manage Employee Relations, execute People Programs and Projects, oversee the end-to-end HR tech stack, and handle HR reporting.</li>\n<li>Take charge of the compensation program, including conducting compensation reviews, internal parity assessments, and salary benchmarking. This involves data collection and analysis to support well-informed decision-making.</li>\n<li>Lead the effort to enhance HR policies and processes, ensuring alignment with legal requirements and industry best practices.</li>\n<li>Drive HR change management initiatives, involving effective communication of changes, gathering feedback, addressing concerns, and continuously enhancing HR practices.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Qualifications:</h2>\n<ul>\n<li>6+ years of experience in a fast-paced People Operations or HR management role.</li>\n<li>Proficiency in both written and spoken Chinese and English, facilitating effective communication with a global employee base.</li>\n<li>Experience in dynamic, fast-paced business environments, such as blockchain, deep tech, or global remote startup settings.</li>\n<li>Comfort with adapting to and utilizing multiple tech platforms, with a quick ability to learn and effectively operate new systems as needed.</li>\n<li>Strong attention to detail, ensuring accuracy and quality in all tasks and deliverables.</li>\n<li>A team player mindset, proactivity, and the ability to thrive in a fast-paced, high-performance environment.</li>\n<li>Excellent interpersonal skills, including the ability to manage complex relationships and engage in difficult conversations.</li>\n<li>Demonstrated ability to navigate ambiguity and autonomously manage responsibilities, showcasing flexibility in scheduling and effective problem-solving.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Benefits:</h2>\n<ul>\n<li>Work from anywhere with flexible hours</li>\n<li>Generous paid time off</li>\n<li>Home office set up</li>\n<li>Annual growth budget</li>\n<li>Coworking membership allowance</li>\n<li>Private healthcare in selected countries</li>\n<li>Competitive salary package</li>\n</ul>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:35:13"
    },
    {
      "id": 98595,
      "url": "https://jobicy.com/jobs/98595-head-of-product-6",
      "jobSlug": "98595-head-of-product-6",
      "jobTitle": "Head of Product",
      "companyName": "Subspace Network",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/b41136a5a0561ee4f7b86d02918b6b03.jpg",
      "jobIndustry": ["Product &amp; Operations"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Subspace is an early stage, venture backed startup, pioneering the next generation of decentralized technologies, envisioning a future where AI seamlessly integrates with Web3, redefining digital identities and payments. The Subspace Network: The Subspace Network, set to launch its mainnet early next year, is a groundbreaking, radically decentralized layer-one blockchain underpinned by an innovative proof-of-archival storage&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Subspace is an early stage, venture backed startup, pioneering the next generation of decentralized technologies, envisioning a future where AI seamlessly integrates with Web3, redefining digital identities and payments.</div>\n<div></div>\n<div><b>The Subspace Network: </b>The Subspace Network, set to launch its mainnet early next year, is a groundbreaking, radically decentralized layer-one blockchain underpinned by an innovative proof-of-archival storage (PoAS) consensus mechanism. Our work is rooted in original research, supported by the US National Science Foundation. For more insights into our vision and technology, please visit our website and explore the technical whitepaper. This technology serves as the foundation for reimagining the relationship between humans and AI, driving the emergence of a new digital era.</div>\n<div></div>\n<div><b>Our Vision:</b> Our vision extends beyond traditional blockchain paradigms. We are reimagining the user experience of Web3, envisioning a world where every individual interacts with the internet through AI-driven agents effortlessly, handling complex tasks from identity verification to payment execution. At the core of our mission lies Humaic Intelligence (HI) and Humaic Labs, pioneering a human-centric approach to AI, championing collaboration, and ensuring universal access.</div>\n<h2><b>Your Role</b></h2>\n<div>As the Head of Product at Subspace Labs, you will play a pivotal role in bringing this vision to reality  through leading and owning the end-to-end product development, strategy, and adoption of Subspace as the world’s autonomous identity and payment network, built to connect every human and AI on the planet. Reporting directly to our Chief Technology Officer and collaborating closely with our visionary Founder Jeremiah Wagstaff, you will be at the forefront of our product development efforts. You will lead and mentor a team of 10+ engineers, designers, and product managers, fostering a collaborative environment that thrives on creativity and innovation.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities:</h2>\n<ul>\n<li><b>Translate Vision into Reality:</b> Partner closely with the CEO and CTO to translate our product vision into actionable requirements, technical specifications, and robust implementation plans that align with our overall strategy.</li>\n<li><b>Product Roadmap Ownership: </b>Develop and own our product roadmap, ensuring alignment with budget, timeline, and resource constraints, while staying responsive to evolving user needs.</li>\n<li><b>Team Leadership: </b>Lead, manage, and nurture a dynamic product team comprising over 10 engineers, designers, and product managers.</li>\n<li><b>Experiment-Driven Decision-Making: </b>hypotheses and experiment-driven product management, making sure decisions are based on data, gut feeling/ user feedback, while ensuring alignment among stakeholders and product managers.</li>\n<li><b>Lean Roadmapping</b>:  Drive agile roadmap with flexible OKRs, remaining adaptable to accommodate iterative adjustments, ensuring responsiveness to evolving market dynamics and user feedback.</li>\n<li><b>Cross-Functional Collaboration: </b>Work closely with cross-functional teams within the organization, including engineering, operations, community, and marketing, to prioritize and plan product development efforts.</li>\n<li><b>Community Engagement:</b> Foster open product development by collaborating with product champions across the organization and community, gathering insights into user needs and pain points.</li>\n</ul>\n<h2>Key Requirements</h2>\n</div>\n</div>\n<div class=\"section page-centered\">\n<ul>\n<li><b>3-5 years of Web3 and AI Product Management:</b> Extensive experience in product management within the Web3 and AI spaces, preferably within startup or decentralized environments.</li>\n<li><b>Blockchain Expertise:</b> In-depth knowledge of blockchain technology, particularly in the application layer, with a focus on developer- and user-facing products and services.</li>\n<li><b>Lean Product Roadmap Lifecycle Management: </b>Proven track record in managing the end-to-end product development life cycle in a fast-paced, iterative startup environment.</li>\n<li><b>User Research and Testing: </b> Familiarity with user research and testing methodologies.</li>\n</ul>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus Experience</h2>\n<ul>\n<li><b>Blockchain and AI Specific KPIs:</b> Skill in identifying and tracking key performance indicators (KPIs) specific to blockchain and AI applications.</li>\n<li><b>Smart Contract Development: </b>Prior experience in smart contract development and decentralized applications (dApps).</li>\n<li><b>Project Management Proficiency: </b>Ability to manage multiple projects concurrently, balancing quality and productivity under pressure, utilizing various project management methodologies.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>To apply</b></h2>\n<div>We believe in seeing your skills in action. In addition to your resume, please provide a sample of your work that demonstrates your expertise in blockchain, cryptocurrency, or related fields. This could be a whitepaper, a project proposal, a case study, or any other relevant work that showcases your abilities.</div>\n</div>",
      "pubDate": "2024-02-24 08:34:28"
    },
    {
      "id": 80831,
      "url": "https://jobicy.com/jobs/80831-software-developer-10",
      "jobSlug": "80831-software-developer-10",
      "jobTitle": "Software Developer",
      "companyName": "SmartLogic",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/06/b6bbc7493fdf7b6bdf9fa155c21e1f55.jpg",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "We are seeking a Software Developer with a successful track record in the planning, implementation, testing, and maintenance of custom software using Ruby on Rails and/or Phoenix/Elixir. SmartLogic is an experienced and growing custom software development consultancy successfully serving clients since 2005. We are deeply committed to our team, our clients, and the communities where&#8230;",
      "jobDescription": "<section>\n<div class=\"parsedHtml__content--OWD2W\">\n<p>We are seeking a Software Developer with a successful track record in the planning, implementation, testing, and maintenance of custom software using Ruby on Rails and/or Phoenix/Elixir.</p>\n<p>SmartLogic is an experienced and growing custom software development consultancy successfully serving clients since 2005. We are deeply committed to our team, our clients, and the communities where we work. Some of our recent company initiatives include leading on youth workforce development, software developer apprenticeships, our Elixir Wizards |&gt; conference, and the Baltimore Women in Tech micro grants program. We look forward to reviewing your application and starting a conversation about a fulfilling career with SmartLogic.</p>\n<p>Our typical projects last anywhere from one month to several months. A few of our clients have worked with us continuously since 2010. Our clients range from large nonprofits to startups to local governments to small/medium businesses: check out our case studies for more information on our work.</p>\n<p>As a Software Developer at SmartLogic, we work to minimize context switching so you can focus on writing great software. We accomplish this by working to ensure our developers are assigned to one client assignment at a time, though occasionally you may be assigned to more than one project.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Write concise, maintainable, and well-tested code using Ruby on Rails and/or Phoenix/Elixir</li>\n<li>Work collaboratively with a team of project managers, product designers, and developers for 40 hours per week</li>\n<li>Collaborate on project management to ensure satisfied clients and happy developers</li>\n<li>As a consultancy, our staff record and submit time on a weekly basis</li>\n<li>Contribute to the technical improvement and success of SmartLogic’s software development and expertise</li>\n<li>Participate in ongoing professional development to continually hone engineering skill</li>\n</ul>\n</div>\n</section>\n<section>\n<h2 class=\"styles__h2--p4pBC JobBreakdown__section-heading--38xCJ styles__emphasis--3da4O\"><strong class=\"styles__strong--2kqW6\">Requirements:</strong></h2>\n<div class=\"parsedHtml__content--OWD2W\">\n<ul>\n<li>Professional experience in Ruby on Rails and/or Phoenix/Elixir, and a motivation to learn and improve your software development capabilities related to these technologies</li>\n<li>Experience communicating with clients and translating technical issues to non-technical stakeholders</li>\n<li>Prior professional experience demonstrating your ability to be a team player and to proactively communicate your needs</li>\n<li>Experience decomposing client requirements into actionable implementation</li>\n<li>Proficiency or an interest in Flutter for mobile app development</li>\n<li>Comfort with participating in agile ceremonies such as standups, grooming sessions, and sprint reviews</li>\n</ul>\n</div>\n</section>\n<section>\n<h2 class=\"styles__h2--p4pBC JobBreakdown__section-heading--38xCJ styles__emphasis--3da4O\"><strong class=\"styles__strong--2kqW6\">Benefits:</strong></h2>\n<div class=\"parsedHtml__content--OWD2W\">\n<p>The SmartLogic career map outlines three levels of software developer and how a developer progresses from one level to the next. The salary bands for the three levels are as follows:</p>\n<ul>\n<li>Junior Developer: $60,000 to $90,000</li>\n<li>Mid Developer: $85,000 to $115,000</li>\n<li>Senior Developer: $110,000 to $140,000</li>\n</ul>\n<p>This position is fully remote and you may work from anywhere in the United States. We offer health, dental, and vision insurance, unlimited PTO, unlimited sick leave, paid parental leave and a 3% matching SIMPLE IRA program.</p>\n<p>New employees are allowed a one-time $500 home office set-up allowance. Additionally, every employee is offered $600 annually towards work-from-home expenses.</p>\n<p>SmartLogic is committed to professional development and community involvement. We provide ample opportunity for learning through dedicated professional development days, participation in conferences (we took our whole team to ElixirConf in 2022), and company-supplied access to books and other resources. We organize events, meetups, and invest in our local and online communities.</p>\n<p>As a remote-first organization, we work intentionally to build a supportive culture in a virtual environment. We do this through various means, including Side Project Club, Coffee Chat, a weekly all-hands meeting, various slack channels (e.g. for #food, #fitness, #family, #mindfulness, #books, and more), doling out virtual tacos, monthly women+ coffee chats, virtual happy hours, and more.</p>\n</div>\n</section>",
      "pubDate": "2024-02-24 08:33:26"
    },
    {
      "id": 91478,
      "url": "https://jobicy.com/jobs/91478-product-content-marketer-f-m-d",
      "jobSlug": "91478-product-content-marketer-f-m-d",
      "jobTitle": "Product Content Marketer (f/m/d)",
      "companyName": "Anonos",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b662f0b7e2f706d141d2403df2a8d750.jpeg",
      "jobIndustry": ["Copywriting &amp; Content"],
      "jobType": ["full-time"],
      "jobGeo": "Germany",
      "jobLevel": "Any",
      "jobExcerpt": "We are a global data privacy technology company founded in 2013. We understand that organizations want to innovate, without getting into legal hot water. We allow them to do exactly that: use their data, without the drama. We pride ourselves on our dynamic and inclusive company culture that values continuous learning, open communication, and a&#8230;",
      "jobDescription": "<div class=\"styles--2BkR3\" data-ui=\"job-description\">\n<div>\n<p>We are a global data privacy technology company founded in 2013. We understand that organizations want to innovate, without getting into legal hot water. We allow them to do exactly that: use their data, without the drama.</p>\n<p>We pride ourselves on our dynamic and inclusive company culture that values continuous learning, open communication, and a collaborative mindset. Our commitment to practices like Radical Candor, communication-based on honest and direct feedback while maintaining mutual respect and care, strengthens our work environment. We believe that our team members are at the heart of our success, and we are dedicated to creating an atmosphere where each individual can thrive and contribute to delivering cutting-edge software and data privacy solutions. Our culture is built upon a foundation of shared values, which guide our interactions and shape our work.</p>\n<p>Join us to make a difference for organizations at the intersection of privacy, technology, and data. Learn more at www.anonos.com</p>\n<h2>About the role:</h2>\n<p>Anonos is seeking a product content creator and marketer. The ideal candidate will be experienced in crafting compelling narratives and marketing strategies around our product offerings and partner relationships to drive brand awareness and engagement effectively.</p>\n<p>They will have a deep understanding of the B2B industry, tech privacy, and AI industry and be able to use this knowledge to drive engagement effectively, nurture leads, communicate our product to prospects and key partners, and increase the reach of our marketing activities. We’re seeking someone with a proven track record of creating and managing product content for B2B (SaaS) companies.</p>\n<p>This is a part-time (approx. 30 hours per week) position on a freelance basis with the potential to transition into a full-time role.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Develop and promote industry-aligned product content in various formats (webpages, blog posts, whitepapers, etc.) that effectively communicates our product offerings to prospective customers and key partners.</li>\n<li>Assist the Head of Content in implementing a content plan designed to nurture leads and broaden brand reach and engagement.</li>\n<li>Collaborate with design, product, sales, and other internal teams to develop product-focused content.</li>\n<li>Measure and report the performance of content marketing campaigns and assess against goals (ROI and KPIs).</li>\n<li>Have knowledge and actively use SEO best practices to maximize content effectiveness and contribute to increasing organic traffic.</li>\n<li>Stay up-to-date with industry developments and generate new ideas to draw the audience’s attention.</li>\n</ul>\n</div>\n</div>\n<div class=\"styles--2kg4_\" data-ui=\"job-requirements\">\n<h2>Requirements:</h2>\n<div>\n<ul>\n<li>3-5 years of product content marketing experience within a SaaS industry (with an emphasis on product content marketing).</li>\n<li>Solid understanding of content-related KPIs, SEO, and analytics.</li>\n<li>Good knowledge of the data privacy technology field.</li>\n<li>Excellent verbal and written communication skills (English).</li>\n<li>Ability to work in a fast-paced, deadline-driven environment.</li>\n<li>Ability to work independently and meet tight deadlines.</li>\n</ul>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:32:37"
    },
    {
      "id": 94525,
      "url": "https://jobicy.com/jobs/94525-sr-enterprise-account-executive-telco-media",
      "jobSlug": "94525-sr-enterprise-account-executive-telco-media",
      "jobTitle": "Sr. Public Sector Account Executive - SLED",
      "companyName": "ServiceNow",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/3f9f6951a15d7f9fff1e42f86a01430e.png",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Senior",
      "jobExcerpt": "At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless&#8230;",
      "jobDescription": "<section id=\"st-companyDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<section id=\"st-companyDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<section id=\"st-companyDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<p>At ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you.</p>\n<p>With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we&#8217;re proud to be one of FORTUNE 100 Best Companies to Work For® and World&#8217;s Most Admired Companies™.</p>\n<p>Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.</p>\n<p>Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.</p>\n</div>\n</section>\n<section id=\"st-jobDescription\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Job Description</h2>\n</div>\n<div class=\"wysiwyg\">\n<p>You will produce new business sales revenue from a SaaS license model. You will accomplish this through account planning, territory planning, researching prospect customers, using business development strategies and completing field-based sales activities within a defined set of prospects, territory or vertical.</p>\n<p><strong>What you get to do in this role</strong></p>\n<ul>\n<li>Develop relationships with multiple C-suite personas (e.g., CFO, CIO, COO, CDO) across all product sales</li>\n<li>Oversee client relationship mapping to the account team, orchestrating an account strategy while leading across a broad virtual team (Solutions Consultants, Solutions Specialist, Success resources, Partners and Marketing, etc.)</li>\n<li>Be a trusted advisor to your customers by understanding their business and advising on how ServiceNow can help help their IT roadmap</li>\n<li>Identify the right specialist/ support resources to bring into a deal, at the right time</li>\n</ul>\n</div>\n</section>\n<section id=\"st-qualifications\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Qualifications</h2>\n</div>\n<div class=\"wysiwyg\">\n<p><strong>To be successful in this role you have</strong></p>\n<ul>\n<li>10+ years of sales experience within software OR solutions sales organization</li>\n<li>Experience establishing trusted relationships with current and prospective clients and other teams</li>\n<li>Experience producing new business, negotiate deals, and maintain healthy C-Level relationships</li>\n<li>Experience achieving sales targets</li>\n<li>The ability to understand the &#8220;bigger picture&#8221; and our plans around IT</li>\n<li>Experience promoting a customer success focus in a &#8220;win as a team&#8221; environment</li>\n<li>Willingness to travel up to 50%</li>\n</ul>\n<p>For positions in New York City, we offer a base pay of $136,600 &#8211; $225,400, plus equity (when applicable), variable/incentive compensation and benefits. Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. Please note that the base pay shown is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies and work location. We also offer health plans, including flexible spending accounts, a 401(k) Plan with company match, ESPP, matching donations, a flexible time away plan and family leave programs.  Compensation is based on the geographic location in which the role is located and is subject to change based on work location.</p>\n</div>\n</section>\n<section id=\"st-additionalInformation\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Additional Information</h2>\n</div>\n<div class=\"wysiwyg\">\n<p>ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.</p>\n</div>\n</section>\n</div>\n</section>\n</div>\n</section>",
      "pubDate": "2024-02-24 08:31:30",
      "annualSalaryMin": "136600",
      "annualSalaryMax": "225400",
      "salaryCurrency": "USD"
    },
    {
      "id": 103533,
      "url": "https://jobicy.com/jobs/103533-sales-support-representative-3",
      "jobSlug": "103533-sales-support-representative-3",
      "jobTitle": "Sales Support Representative",
      "companyName": "Twilio",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201023175858-722503.jpg",
      "jobIndustry": ["Sales"],
      "jobType": ["full-time"],
      "jobGeo": "UK",
      "jobLevel": "Any",
      "jobExcerpt": "Twilio is looking for a Sales Support Representative to join the Strategic Sales team. We’re looking for an intelligent, ambitious and talented individual who is keen to understand more about how large businesses operate; this role will provide insights on and windows into many aspects of Twilio’s sales motion as well as supporting the Sales&#8230;",
      "jobDescription": "<p>Twilio is looking for a Sales Support Representative to join the Strategic Sales team. We’re looking for an intelligent, ambitious and talented individual who is keen to understand more about how large businesses operate; this role will provide insights on and windows into many aspects of Twilio’s sales motion as well as supporting the Sales reps with day to day activities.</p>\n<h2><strong>Responsibilities</strong></h2>\n<p>This role will see you supporting the Strategic Account Executives to be more efficient in hitting quota.</p>\n<ul>\n<li>This individual is ‘the glue’ between many different functions within the organization.</li>\n<li>Assisting Account Executives with numerous activities and processes along the entire sales cycle.</li>\n<li>Prepare Pricing and Deal Structure, use and master internal pricing tools.</li>\n<li>Engage with client stakeholders to ensure Proposal Bill Of Materials (OFs) are correct.</li>\n<li>Work with internal stakeholders to ensure all aspects throughout the sales process are smooth (Deal Desk, Contracts, Legal, Pre-Sales, Security requests) and to ensure the BOM and Contracts are accurate. You will deal with people, data sets and processes.</li>\n<li>Manage prioritization of key deals with Sales Management.</li>\n<li>Update / Oversee CRM records of accounts</li>\n<li>Support AEs to understand customers current usage and improvement opportunities (Monkey  Analytics for existing customers)</li>\n<li>Support the AEs with administrative tasks linked to billing, invoicing and support.</li>\n</ul>\n<h2><strong>Qualifications </strong></h2>\n<p>Not all applicants will have skills that match a job description exactly. Twilio values diverse experiences in other industries, and we encourage everyone who meets the required qualifications to apply. While having “desired” qualifications make for a strong candidate, we encourage applicants with alternative experiences to also apply. If your career is just starting or hasn&#8217;t followed a traditional path, don&#8217;t let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!</p>\n<h2><strong>Required:</strong></h2>\n<ul>\n<li>Highly communicative and can work in a team to support the wider goals of the sales function.</li>\n<li>Experience working with G Drive and fluent in Google Docs, Google Sheets and Salesforce.</li>\n<li>You don’t need to have experience in a sales role, indeed this role has allowed previously individuals to pursue roles in Twilio in data analytics, sales or marketing however a desire to move into sales eventually is preferred.</li>\n<li>Organizational skills are important and the ability to work in a fast paced environment. This is not a quota carrying role.</li>\n</ul>\n<p><strong>Fluent in English. Additional languages are a plus particularly German, French or Spanish.</strong></p>\n<h2><strong>Location</strong></h2>\n<p>This position is based remotely from the United Kingdom.</p>\n<h2><strong>Travel </strong></h2>\n<p>We prioritize connection and opportunities to build relationships with our customers and each other. For this role, approximately 20% travel is anticipated to help you connect in-person in a meaningful way.</p>\n<h2><strong>What We Offer</strong></h2>\n<p>There are many benefits to working at Twilio, including, in addition to competitive pay, things like generous time-off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.</p>\n<h2><strong>Twilio thinks big. Do you?</strong></h2>\n<p>We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That&#8217;s why we seek out colleagues who embody our values — something we call Twilio Magic. Additionally, we empower employees to build positive change in their communities by supporting their volunteering and donation efforts.</p>\n<p>So, if you&#8217;re ready to unleash your full potential, do your best work, and be the best version of yourself, apply now!</p>\n<p><strong>Twilio is proud to be an equal opportunity employer.</strong></p>\n<p>Twilio is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Additionally, Twilio participates in the E-Verify program in certain locations, as required by law.</p>",
      "pubDate": "2024-02-24 08:30:27"
    },
    {
      "id": 103532,
      "url": "https://jobicy.com/jobs/103532-technical-support-associate",
      "jobSlug": "103532-technical-support-associate",
      "jobTitle": "Technical Support Associate",
      "companyName": "Webflow",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b75fa7e9-221.jpg",
      "jobIndustry": ["Technical Support"],
      "jobType": ["full-time"],
      "jobGeo": "Australia,  New Zealand",
      "jobLevel": "Any",
      "jobExcerpt": "At Webflow, our mission is to bring development superpowers to everyone. Webflow is the leading visual development platform for building powerful websites without writing code. By combining modern web development technologies into one platform, Webflow enables people to build websites visually, saving engineering time, while clean code seamlessly generates in the background. From independent designers&#8230;",
      "jobDescription": "<p>At Webflow, our mission is to bring development superpowers to everyone. Webflow is the leading visual development platform for building powerful websites without writing code. By combining modern web development technologies into one platform, Webflow enables people to build websites visually, saving engineering time, while clean code seamlessly generates in the background. From independent designers and creative agencies to Fortune 500 companies, millions worldwide use Webflow to be more nimble, creative, and collaborative. It’s the web, made better.</p>\n<p>We’re looking for a Technical Support Associate to help empower our customers to do their best work and make Webflow the best product possible. Candidates can work <strong>either Weekdays (Mon &#8211;  Fri) or Weekends (Wed &#8211; Sun).</strong></p>\n<h2><strong>About the role </strong></h2>\n<ul>\n<li><strong>Location: Australia/New Zealand</strong></li>\n<li>Required time zones: APAC (Australia/New Zealand)</li>\n<li>Type: Full Time</li>\n<li>The cash compensation for this role is tailored to align with the cost of labor in different geographic markets. The base pay for this role ranges from AUD 97,300 &#8211; 105,000 for candidates based in Australia &amp; NZD 75,000 &#8211; 86,200 for candidates based in New Zealand. The specific base pay within the range will be determined by the candidate’s geographic location, job-related experience, knowledge, qualifications, and skills.</li>\n<li>Reporting<strong> </strong>to the Manager or Senior Manager of Customer Support</li>\n<li>Application Deadline: Wednesday, March 13, 2024</li>\n</ul>\n<p>As a Technical Support Associate, you’ll …</p>\n<ul>\n<li>Provide consistently high-quality customer experiences for all Webflow customers</li>\n<li>Help customers in support queues using applications including but not limited to Zendesk and Jira</li>\n<li>File bugs, troubleshoot product issues, and collaborate with the team to provide an excellent customer experience</li>\n<li>Advocate for our customers and work closely with your team and manager to find areas of improvement within our product and services.</li>\n</ul>\n<p>In addition to the responsibilities outlined above, at Webflow we will support you in identifying where your interests and development opportunities lie and we&#8217;ll help you incorporate them into your role.</p>\n<h2><strong>About you </strong></h2>\n<p>You’ll thrive as a Technical Support Associate if you:</p>\n<ul>\n<li>Have demonstrated experience with providing high-touch customer support over email, phones and live chat in SAAS or technical customer service</li>\n<li>Possess a deep understanding of Webflow products or have experience with other web design tools or platforms</li>\n<li>Understand HTML, CSS, DNS or have advanced understanding of Webflow</li>\n<li>Exhibit analytical reasoning and critical thinking skills for technical troubleshooting</li>\n<li>Have the ability to learn new digital tools quickly</li>\n<li>Work autonomously, creatively, and kindly with your teammates while empowering and supporting those around you</li>\n<li>Practice radical candor with your colleagues to communicate clearly. You can start from the common ground as a great listener and work towards creative solutions with others</li>\n<li>Advocate for others – including customers and colleagues – and you want to build a career in customer support!</li>\n<li>Have demonstrated written and verbal communication skills in the English language</li>\n</ul>\n<p>Even if you don’t meet 100% of the above qualifications, you should still seriously consider applying. Research shows that you may still be considered for a role if you meet just half of the requirements.</p>\n<h2><strong>Our Core Behaviors:</strong><strong><br />\n</strong></h2>\n<ul>\n<li><strong>Obsess over customer experience.</strong> We deeply understand <em>what</em> we’re building and <em>who</em> we’re building for and serving. We define the leading edge of what’s possible in our industry and deliver the future for our customers.</li>\n<li><strong>Move with heartfelt urgency.</strong> We have a healthy relationship with impatience, channeling it thoughtfully to show up better and faster for our customers and for each other. Time is the most limited thing we have, and we make the most of every moment.</li>\n<li><strong>Say the hard thing with care.</strong> Our best work often comes from intelligent debate, critique, and even difficult conversations. We speak our minds and don’t sugarcoat things — and we do so with respect, maturity, and care.</li>\n<li><strong>Make your mark.</strong> We seek out new and unique ways to create meaningful impact, and we champion the same from our colleagues. We work as a <em>team</em> to get the job done, and we go out of our way to celebrate and reward those going above and beyond for our customers and our teammates.</li>\n</ul>\n<h2><strong>Benefits &amp; Wellness</strong></h2>\n<p>Webflow has partnered with Remote.com to select and offer competitive country-specific benefits packages. Due to varying local packages and requirements, benefits globally do not necessarily mirror one another, but Webflow follows the practice of selecting premium benefits and covering the cost of team members and their dependent deduction costs. Perks and incentives are offered to benefits-eligible team members and any differences would occur if there are country-specific or compliance-related regulations.<em>.</em></p>\n<h2><strong>Be you, with us</strong></h2>\n<p>At Webflow, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law.</p>\n<h2><strong>Stay connected</strong></h2>\n<p>Not ready to apply, but want to be part of the Webflow community? Consider following our story on our Webflow Blog, LinkedIn, Twitter, and/or Glassdoor.</p>\n<h2><strong>Please note:</strong></h2>\n<p><em>To join Webflow, you&#8217;ll need valid work authorization depending on the country of employment.</em></p>\n<p><em>If you are extended an offer, that offer may be contingent upon your successful completion of a background check, which will be conducted in accordance with applicable laws. We may obtain one or more background screening reports about you, solely for employment purposes.</em></p>",
      "pubDate": "2024-02-24 08:28:17",
      "annualSalaryMin": "97300",
      "annualSalaryMax": "105000",
      "salaryCurrency": "AUD"
    },
    {
      "id": 103531,
      "url": "https://jobicy.com/jobs/103531-finance-and-strategy-senior-analyst",
      "jobSlug": "103531-finance-and-strategy-senior-analyst",
      "jobTitle": "Finance and Strategy Senior Analyst",
      "companyName": "Hopper",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201020164254-931520.jpg",
      "jobIndustry": ["Finance &amp; Legal"],
      "jobType": ["full-time"],
      "jobGeo": "Spain",
      "jobLevel": "Senior",
      "jobExcerpt": "As a Finance and Strategy Analyst, your day-to-day job will be to help our business leaders make sound business and financial decisions. You will need to have a deep understanding of our customers and business drivers, allowing you to help steer Hopper’s growth and product strategy. To succeed in this role, you need to be able&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>As a Finance and Strategy Analyst, your day-to-day job will be to help our business leaders make sound business and financial decisions. You will need to have a deep understanding of our customers and business drivers, allowing you to help steer Hopper’s growth and product strategy.</div>\n<div></div>\n<div>To succeed in this role, you need to be able to understand the big picture, while also being unafraid to dive into the details and numbers. You also need to understand SQL and have experience with data visualization tools.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What would your day-to-day look like:</h2>\n<ul>\n<li>Give weekly brief on company performance, assessing growth and addressing problem areas</li>\n<li>Help business leaders make better strategic decisions by enabling them through data and deep understanding of financial trade-offs, across both our B2B and B2C product organizations</li>\n<li>Create, update and maintain financial models, budgets and forecasts</li>\n<li>Build out business reporting metrics and dashboards</li>\n<li>Prepare internal reports for business leaders to support decision making</li>\n<li>Perform analysis of financial and operational drivers to craft our short and long term strategic plan</li>\n<li>Work on finance related optimization initiatives</li>\n<li>Collaborate with multiple areas of the business to accurately reflect recent trends in all modeling and financial reporting</li>\n<li>Automate reporting and build insights using SQL / Big Query</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>An ideal candidate has:</h2>\n<ul>\n<li>A degree in Business, Strategy, Finance, Math, Statistics, Economics, or other quantitative discipline</li>\n<li>3-5 years of experience in a top tier tech company, consulting firm, or venture capital firm</li>\n<li>Entrepreneurial spirit, ability to work autonomously</li>\n<li>Technology industry experience is a strong plus</li>\n<li>Experience working in FP&amp;A or strategic finance</li>\n<li>Strong analytical and creative problem-solving skills, with strong modeling experience</li>\n<li>Very comfortable working in SQL, expertise is a plus</li>\n<li>Microsoft Office/Google Suite proficiency</li>\n<li>Enthusiasm and curiosity for conducting research and answering hard questions with data</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks and benefits of working with us:</h2>\n<ul>\n<li>Well-funded and proven startup with large ambitions, competitive salary and stock options</li>\n<li>Unlimited PTO</li>\n<li>Hopper covers the cost of employee premiums for private medical and dental coverage via Cigna</li>\n<li>Wellness &amp; Telework &#8211; Hopper offers a monthly cash allowances for both</li>\n<li>Carrot Cash travel stipend</li>\n<li>Flexport All Access Pass OR Work-from-home stipend</li>\n<li>Entrepreneurial culture where pushing limits and taking risks is everyday business</li>\n<li>Open communication with management and company leadership</li>\n<li>Small, dynamic teams = massive impact</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>More about Hopper</b></h2>\n<div>At Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.</div>\n<div></div>\n<div>The Hopper platform serves hundreds of millions of travelers globally and continues to capture market share around the world. Ranked the third largest online travel agency in North America, the Hopper app has been downloaded over 120 million times and has become largely popular among younger travelers – with 70% of its users being Gen Z and millennials.</div>\n<div></div>\n<div>While everyone knows us as the Gen Z and Millennial travel app, Hopper has evolved to become much more than that. In recent years, we’ve grown into a global travel agency and travel fintech provider that powers some of the world’s largest brands.</div>\n<div></div>\n<div>Through HTS, our B2B division, the company supercharges its partners’ direct channels by integrating our fintech products on their sites or powering end-to-end travel portals. Today, our partners include leading travel brands like Capital One, Nubank, Air Canada and many more.</div>\n</div>",
      "pubDate": "2024-02-24 08:26:24"
    },
    {
      "id": 94536,
      "url": "https://jobicy.com/jobs/94536-principal-site-reliability-engineer",
      "jobSlug": "94536-principal-site-reliability-engineer",
      "jobTitle": "Principal Site Reliability Engineer",
      "companyName": "DuckDuckGo",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/ab8415dd5798a360323ce06beaf30c35.png",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we&#8217;ve been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. Our app is now downloaded more than 78M times a year,&#8230;",
      "jobDescription": "<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we&#8217;ve been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we&#8217;ve been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including Email Protection, App Tracking Protection and our first-ever Desktop Apps for Mac<a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" target=\"_blank\" rel=\"noopener\"> </a>and Windows.</p>\n<p>We’re looking for a <strong>Principal Site Reliability Engineer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.</p>\n<h2><strong>The Opportunity</strong></h2>\n<p>In this highly technical role, you&#8217;ll act as a hands-on leader and engineering partner for one of our key strategic objectives (search or similar), pragmatically navigating cross-functional interests to help us execute our vision with urgency.</p>\n<p>You&#8217;ll focus on hands-on technical work, diving deep into our stack to understand and optimize complex systems and user interactions, participate in SRE on-call rotation, triaging production issues and defining appropriate remediation, and help shape the future technical direction of our stack, all while keeping privacy at the forefront as you improve reliability and performance.</p>\n<p>You&#8217;ll also advise engineers on the SRE team and beyond, nurturing their growth and collaborating closely with other developers throughout the end-to-end development cycle across technical design, implementation, QA, review, and release.</p>\n<h2><strong>What You Will Bring to DuckDuckGo</strong></h2>\n<ul>\n<li>10+ years of experience in SRE focused roles responsible for supporting, scaling and ensuring reliability of large-scale end-to-end infrastructures.</li>\n<li>4+ years of experience in roles of comparable seniority (Principal, Director, etc.) with a proven track record of proposing and executing strategic infrastructure work.</li>\n<li>Ability to root cause sources of instability of high-traffic, distributed systems.</li>\n<li>Skilled at managing complex solutions and delivering in pragmatic ways.</li>\n<li>Deep experience working with Linux and web technologies.</li>\n<li>Experience participating in a 24&#215;7 on-call rotation for large-scale deployment.</li>\n<li>Advanced programming experience, preferably in a high-level language like Perl or Python.</li>\n<li>Ability to provide technical advisory for other engineers to help them grow and deliver high quality work faster.</li>\n</ul>\n<h2><strong>How We Will Support You</strong></h2>\n<p>Our core values &#8212; build trust, question assumptions, and validate direction &#8212; underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.</p>\n<ul>\n<li><strong>Remote First, Always</strong>: We&#8217;ve always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.</li>\n<li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li>\n<li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li>\n<li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.</li>\n</ul>\n<h2><strong>Compensation</strong></h2>\n<p>Annual compensation: $220,000 &#8211; $242,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>",
      "pubDate": "2024-02-24 08:23:28",
      "annualSalaryMin": "220000",
      "annualSalaryMax": "242000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103530,
      "url": "https://jobicy.com/jobs/103530-senior-technical-support-engineer",
      "jobSlug": "103530-senior-technical-support-engineer",
      "jobTitle": "Senior Technical Support Engineer",
      "companyName": "Sonatype",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201223232219-694679.jpg",
      "jobIndustry": ["Technical Support"],
      "jobType": ["full-time"],
      "jobGeo": "Australia",
      "jobLevel": "Senior",
      "jobExcerpt": "Sonatype is the software supply chain management company. We&#8217;re on a mission to change how the world innovates by making software development easier. From running the world&#8217;s largest repository of Java open-source components (Maven Central) to inventing componentized software development and then software supply chain management to creating the only solution that stops malicious open-source&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Sonatype is the software supply chain management company. We&#8217;re on a mission to change how the world innovates by making software development easier. From running the world&#8217;s largest repository of Java open-source components (Maven Central) to inventing componentized software development and then software supply chain management to creating the only solution that stops malicious open-source malware in its tracks, we&#8217;re constantly leading the industry while helping thousands of customers manage open source every day.</div>\n<div></div>\n<div>Already used by 15 million developers, we have lofty goals for our technology to be in the hands of every engineering team. And we need you to do that.</div>\n<div></div>\n<div>At Sonatype we take a different approach to product support. Our worldwide team consists of talented technical contributors who see product support as an engineering challenge. We write code which lets us quickly replicate customer environments, analyze data from customer systems to pinpoint problems, replicate issues from recorded activity, and more. Our team members work directly with development teams, sales, and customer success to ensure the best possible customer experience. There are lots of interesting technical challenges to solve every day, and many opportunities to learn new skills and technologies. Does this sound interesting? Great, we’re hiring now!</div>\n<div></div>\n<div>In this role you will provide advanced product support to customers dealing with complex issues surrounding the use of Sonatype products and solutions and the many environments they run in. Our Senior Technical Support Engineers have a long-term career path that enables them to grow into Principal Engineer and Support Manager roles.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What You&#8217;ll Do</h2>\n<ul>\n<li>Debug, and troubleshoot incidents with Sonatype products and solutions</li>\n<li>Reproduce defects and file actionable issues for product engineering Replicate customer deployment environments for testing (docker, AWS, Azure, Kubernetes, and more)</li>\n<li>Mentor less experienced support engineers. Represent Technical Support and customer interests in Engineering and Product Management discussions</li>\n<li>Assist product management in developing and prioritizing enhancement lists. Summarize, communicate, and escalate customer experiences to management. Contribute to and maintain our Knowledge Base</li>\n<li>Contribute to our diagnostic tools and utilities, and create new ones</li>\n<li>Respond to customer inquiries via support cases, email, chat, and phone</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Who You Are</h2>\n<ul>\n<li>5+ years experience supporting complex enterprise software solutions</li>\n<li>Ability to read and understand Java code.</li>\n<li>Experience with testing and/or development of Java based web applications.</li>\n<li>Experience with SQL databases (PostgreSQL is a plus)</li>\n<li>Good Linux command line skills</li>\n<li>Experience with networking (Sockets, HTTP, LDAP, proxies/firewalls, SSL)</li>\n<li>Experience with scripting languages (Python, Bash, Groovy, etc.)</li>\n<li>Exceptional communication skills &#8211; written and verbal</li>\n<li>Experience with 1 or more application servers (e.g. Tomcat, Apache, IIS, NGINX etc.)</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Preferred NOT Required</h2>\n<ul>\n<li>SCM and CI/CD and associated tools (Jenkins, Bamboo, etc.)</li>\n<li>Debugging certificate-based mutual TLS and SSL authentication</li>\n<li>Experience analyzing network traces using tools such as wireshark or tcpdump</li>\n<li>Component management build tools (Ant, Maven, npm, NuGet etc.)Container technologies (Docker, Kubernetes, etc.)SQL and databases (H2 and Postgres in particular)Sonatype, jFrog, Snyk, Whitesource or similar products</li>\n<li>Software development (JAVA in particular)LDAP and SAMLDeployment/Configuration of Cloud platforms such AWS, Azure and GCP</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Things We&#8217;re Proud Of</h2>\n<ul>\n<li>2023 Fast Company Best Places for Innovators</li>\n<li>2023 Leader in Forrester-Wave for Software Compensation Analysis</li>\n<li>2023 Gartner&#8217;s Magic Quadrant</li>\n<li>2023 Software Report&#8217;s Top 100 Software Companies</li>\n<li>2023 BuiltIn Best Places to Work</li>\n<li>2022 Frost &amp; Sullivan Technology Innovation Leader Award</li>\n<li>2022 PeerSpot Silver Peer Award in Software Composition Analysis</li>\n<li>2022 Tech Ascension Best DevOps Security Solution Award</li>\n<li>2022 NVCT Cyber Company of the Year</li>\n<li>Company Wellness Week &#8211; We shut down company operations for a week to enable all employees to spend time pursuing personal growth and enjoying much needed and deserved rest.</li>\n<li>Diversity &amp; Inclusion Working Groups</li>\n<li>Parental Leave Policy</li>\n<li>Paid Volunteer Time Off (VTO)</li>\n</ul>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:22:27"
    },
    {
      "id": 103529,
      "url": "https://jobicy.com/jobs/103529-lead-talent-management-consultant",
      "jobSlug": "103529-lead-talent-management-consultant",
      "jobTitle": "Lead Talent Management Consultant",
      "companyName": "Lumen Technologies",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/bab8bfe71b006d34181034e47e6b2c52.jpg",
      "jobIndustry": ["HR &amp; Recruiting"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Lumen connects the world. We are igniting business growth by connecting people, data and applications – quickly, securely, and effortlessly. Together, we are building a culture and company from the people up – committed to teamwork, trust and transparency. People power progress. We’re looking for top-tier talent and offer the flexibility you need to thrive&#8230;",
      "jobDescription": "<p>Lumen connects the world. We are igniting business growth by connecting people, data and applications – quickly, securely, and effortlessly. Together, we are building a culture and company from the people up – committed to teamwork, trust and transparency. People power progress. We’re looking for top-tier talent and offer the flexibility you need to thrive and deliver lasting impact. Join us as we digitally connect the world and shape the future.</p>\n<div>\n<div>\n<div>\n<h2><b>The Role</b></h2>\n</div>\n<div>\n<p>Lumen is seeking a talented and motivated individual to join our team as a Talent Management Analyst with a focus on the performance management process and many future growth opportunities.   As a part of our organization, you will play a crucial role in designing, implementing, and optimizing our performance management strategies to ensure a high-performing workforce. This position requires a general understanding of talent management practices, analytical skills, and the ability to leverage data to drive business outcomes.</p>\n</div>\n</div>\n<div>\n<div>\n<h2><b>The Main Responsibilities</b></h2>\n</div>\n<div>\n<p>Here are some of the exciting things you will do as a Talent Management Consultant at Lumen:</p>\n<p>1. Execute Performance Management at Lumen: Collaborate with cross-functional teams to deliver an effective performance management process aligned with organizational goals. Analyze existing performance management systems, identify gaps, and continuously improve the process.</p>\n<p>2. Performance Data Analysis and Performance Module system support: Partner with HRIS to build out and support performance modules within our HRIS system.  Utilize data analytics to review and analyze performance-related data such as employee productivity, engagement, and talent potential. Identify trends, patterns, and areas requiring improvement, and provide actionable insights to the management. Use data-driven recommendations to enhance individual and team performance, improve talent development strategies, and optimize overall organizational productivity.</p>\n<p>3. Training and Development: Collaborate with HR and learning teams to design and deliver training programs focused on enhancing performance management capabilities for managers and employees. Develop tools, resources, and guides to support effective performance conversations, goal-setting, and feedback processes. Continuously assess the effectiveness of training initiatives and make necessary improvements to ensure maximum impact on employee performance and development.</p>\n</div>\n</div>\n<div>\n<div>\n<h2><b>What you get from Lumen:</b></h2>\n</div>\n<div>\n<ul>\n<li>Awesome talent management experience with much room to grow and progress at Lumen</li>\n<li>Work with a great team of fun and engaging professionals</li>\n<li>Lots of flexibility in where you work</li>\n<li>Access to great resources and tools and flexibility to implement and enhance systems and processes</li>\n</ul>\n</div>\n</div>\n<div>\n<div>\n<h2><b>What We Look For in a Candidate</b></h2>\n</div>\n<div>\n<ul>\n<li>Bachelor’s degree in human resources, Business Administration, or a related field. A master&#8217;s degree would be an advantage.</li>\n<li>Foundational understanding of talent management and performance management best practices, as well as industry trends.</li>\n<li>Proficiency in data analysis, utilizing data visualization tools, and strong Excel skills.</li>\n<li>Excellent interpersonal and communication skills to effectively collaborate with various stakeholders and present complex concepts in a clear and concise manner.</li>\n<li>A passion to break things, try new things, to make things better, and have a sense of humor when everything doesn’t go as planned.</li>\n</ul>\n</div>\n</div>\n<div>\n<div>\n<h2><b>Compensation</b></h2>\n</div>\n<div>\n<p>The starting salary for this role differs based on the employee&#8217;s primary work location. Employees typically do not start at the top of the range, though compensation depends on each individual&#8217;s qualifications.</p>\n<p><u><b>Location Based Pay Ranges</b></u></p>\n<p><b>$80510 &#8211; $100635</b> in these states: AR, ID, KY, LA, ME, MS, NE, SC, and SD.<br />\n<b>$84740 &#8211; $105923</b> in these states: AZ, AL, FL, GA, IN, IA, KS, MO, MT, NM, ND, OH, OK, PA, TN, UT, VT, WV, WI, and WY.<br />\n<b>$88980 &#8211; $111218</b> in these states: CO, HI, MI, MN, NV, NH, NC, OR, and RI.<br />\n<b>$93210 &#8211; $116513</b> in these states: AK, CA, CT, DE, DC, IL, MD, MA, NJ, NY, TX, VA, and WA.</p>\n<p>As with the pay range variety that&#8217;s based on the region of a country, specific offers are determined by various factors such as experience, education, skills, certifications and other business needs.</p>\n<h2><b>Background Screening</b></h2>\n<p>If you are selected for a position, there will be a background screen, which may include checks for criminal records and/or motor vehicle reports and/or drug screening, depending on the position requirements. For more information on these checks, please refer to the Post Offer section of our FAQ page. Job-related concerns identified during the background screening may disqualify you from the new position or your current role. Background results will be evaluated on a case-by-case basis.<br />\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:19:52"
    },
    {
      "id": 96513,
      "url": "https://jobicy.com/jobs/96513-sr-software-engineer-latam",
      "jobSlug": "96513-sr-software-engineer-latam",
      "jobTitle": "Sr. Backend Engineer - Canada",
      "companyName": "Luxury Presence",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/05/f2b241fb769140fff2f70e8efaf5c0ff.jpg",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "Canada",
      "jobLevel": "Senior",
      "jobExcerpt": "Luxury Presence is the fastest-growing digital platform for agents, teams, and brokerages. Their award-winning real estate websites, modern marketing solutions, and AI-powered mobile platform help agents attract more business, work more efficiently, and serve their clients. Since launching in 2016, Luxury Presence has been trusted by more than 10,000 real estate professionals, including over 20 Wall&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div><b>Luxury Presence</b> is the fastest-growing digital platform for agents, teams, and brokerages. Their award-winning real estate websites, modern marketing solutions, and AI-powered mobile platform help agents attract more business, work more efficiently, and serve their clients. Since launching in 2016, Luxury Presence has been trusted by more than 10,000 real estate professionals, including over 20 Wall Street Journal Top 100 agents.</div>\n<h2><b>Who is the Platform Squad?</b></h2>\n<div>The Platform squad is a new squad being formed to support our product squads. This squad owns critical service implementations such as Authentication/Authorization in addition to user-facing pieces of our applications like our CMS and our React component library. Teams such as Website Product will regularly interact with Platform and rely on their APIs and packages.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you will do as a Sr. Backend Engineer</h2>\n<ul>\n<li>Design, build, test, and deploy the cloud-native platform and microservices/API to be consumed by our platform and clients</li>\n<li>Partner with architecture and external development teams to design reusable frameworks and technical solutions</li>\n<li>Partner with Frontend Developers to create new user-facing features and build reusable code and libraries for future use</li>\n<li>Participate in the evaluation of emerging technology and tools</li>\n<li>Optimize application for maximum speed and scalability</li>\n<li>Conduct code reviews for peers and mentor junior Engineers</li>\n<li>Iterate on our framework for rendering and building a common of libraries and components</li>\n<li>Participate in squad ceremonies and team events (lunch &amp; learn, brainstorms, etc.)</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Skills And Qualifications</h2>\n<ul>\n<li>5+ year experience developing backend web applications. Bonus points for experience with TypeScript on NodeJS</li>\n<li>Experience with data-driven architecture and systems design, RESTful APIs, microservices architecture. Test Driven Development experience is a plus!</li>\n<li>Strong experience in designing optimal system integration with data persistence layers, including use of ORMs, SQL and APIs to interact with RDBMS, NoSQL and other data storage systems</li>\n<li>Experienced working with enterprise frameworks like Spring Boot, .net Core or equivalent with a solid understanding of concepts like dependency injection</li>\n<li>Strong understanding and implementation of cloud-native architectures (AWS serverless or containers preferred) at scale in production</li>\n<li>Demonstrated understanding and implementation of software design principles such as SOLID and DI</li>\n<li>Experience with Software as a Service (SaaS), multi-tenancy application development</li>\n<li>Experience working in a Continuous Integration / Continuous Delivery (CICD) model, including Github and CI pipeline automation tools</li>\n<li>Proven success working in Agile environments (Scrum, Kanban, etc.)</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Our Technology Stack</h2>\n<ul>\n<li>React / StyledComponents / Apollo / SingleSPA</li>\n<li>Node/Typescript Microservices</li>\n<li>Python ETLs</li>\n<li>Postgres / ElasticSearch / DynamoDB</li>\n<li>AWS / Kubernetes / Lambda</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Interview Process</h2>\n<ul>\n<li>We do a quick, 3 step, fully virtual interview process.</li>\n<li>1st &#8211; Engineering Craft Interview (Deep Dive Technical) &#8211; 1 Hour</li>\n<li>2nd &#8211; Engineering Craft Interview (Technical Breadth) &#8211; 1 Hour</li>\n<li>3rd &#8211; Culture &amp; Values Interview &#8211; 1 Hour</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Who we are: Luxury Presence is the real estate industry&#8217;s most powerful marketing platform, providing award winning websites and cutting edge tech to the world’s top agents.</div>\n<div></div>\n<div>Founded in 2016 by Stanford Business School alumni Malte Kramer, Luxury Presence currently serves over 9,000 clients in the U.S. and Canada with its SaaS model — including over 20 of the top 100 WSJ real estate agents and teams. In addition, Luxury Presence is the official website partner to some of the industry&#8217;s most powerful brokerages.</div>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:15:36"
    },
    {
      "id": 96515,
      "url": "https://jobicy.com/jobs/96515-director-communications",
      "jobSlug": "96515-director-communications",
      "jobTitle": "Director - Communications",
      "companyName": "Twitch",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/11/WRILS-201108102323-536788.jpg",
      "jobIndustry": ["Marketing &amp; Sales"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Director",
      "jobExcerpt": "Twitch is the world&#8217;s biggest live streaming service, with global communities built around gaming, entertainment, music, sports, cooking, and more. It is where thousands of communities come together for whatever, every day. We&#8217;re about community, inside and out. You&#8217;ll find coworkers who are eager to team up, collaborate, and smash (or elegantly solve) problems together&#8230;.",
      "jobDescription": "<p>Twitch is the world&#8217;s biggest live streaming service, with global communities built around gaming, entertainment, music, sports, cooking, and more. It is where thousands of communities come together for whatever, every day.</p>\n<p>We&#8217;re about community, inside and out. You&#8217;ll find coworkers who are eager to team up, collaborate, and smash (or elegantly solve) problems together. We&#8217;re on a quest to empower live communities, so if this sounds good to you, see what we&#8217;re up to on LinkedIn and Twitter, and discover the projects we&#8217;re solving on our Blog. Be sure to explore our Interviewing Guide and Instagram channel to learn how to ace our interview process.</p>\n<h2>About the Role:</h2>\n<p>The Director of Communications will lead a global team responsible for shaping the stories that are told about Twitch. You will oversee all aspects of Twitch&#8217;s global communications function; develop a global strategy, set the teams&#8217; priorities, and craft narratives and messaging for external and internal audiences alike. You will work closely with our CEO and the broader executive team to increase Twitch&#8217;s brand awareness, defend &amp; protect our reputation, and amplify our creators&#8217; stories and the unique opportunity on Twitch.</p>\n<p>You are curious about how things work, make the complex seem simple and bring compelling stories to life with few details. You&#8217;re a strong people manager with experience developing talent and managing agencies. You spot issues before they happen and will push the business proactively to protect against potential risk or exposure. You&#8217;re also a practiced storyteller who will explore new approaches to reach key audiences, including the Twitch Community, the media, regulators, advertisers, and employees. You know how to balance competing priorities and make decisions about trade offs quickly.</p>\n<p>This role will report to the CMO and be a part of the marketing leadership team.</p>\n<p>This role may be remote in the US, with a preference for location in San Francisco, CA; Los Angeles, CA; Irvine, CA; Seattle, WA; New York, NY.</p>\n<h2><strong>You Will:</strong></h2>\n<ul>\n<li>Inspire and develop a team of Comms professionals to tell cohesive and compelling narratives to press, the community, and Twitch employees</li>\n<li>Direct and implement global communications strategies that promote Twitch, our service and offerings, and the community</li>\n<li>Identify opportunities to engage creators and viewers around current events or other company/cultural or industry moments</li>\n<li>Advise on strategic business decisions and direct company response on crises and emerging issues</li>\n<li>Establish an understanding of Twitch&#8217;s community, product, and business</li>\n<li>Be a trusted, strategic advisor to peers and executives</li>\n<li>Work globally, and oversee roster of agencies</li>\n</ul>\n<h2>You Have:</h2>\n<ul>\n<li>10+ years of experience in public relations, including experience working in-house</li>\n<li>Established relationships with a broad range of media and outlets</li>\n<li>Experience leading campaigns or programs around entertainment, content or talent/creator storytelling</li>\n<li>Excellent written and oral communication skills and comfort being a company spokesperson</li>\n<li>Sound business judgment in sometimes ambiguous situations and environments</li>\n<li>Enthusiasm for Twitch and our community</li>\n</ul>\n<h2>Bonus Points:</h2>\n<ul>\n<li>Passion for creators or experience as one yourself</li>\n</ul>\n<h2>Perks:</h2>\n<ul>\n<li>Medical, Dental, Vision &amp; Disability Insurance</li>\n<li>401(k)</li>\n<li>Maternity &amp; Parental Leave</li>\n<li>Flexible PTO</li>\n<li>Amazon Employee Discount</li>\n<li>Monthly Contribution &amp; Discounts for Wellness Related Activities &amp; Programs (e.g., gym memberships, off-site massages)</li>\n</ul>\n<p><em>We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>\n<p><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>\n<p><em>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>",
      "pubDate": "2024-02-24 08:14:43"
    },
    {
      "id": 103528,
      "url": "https://jobicy.com/jobs/103528-ai-partnerships-business-development-lead",
      "jobSlug": "103528-ai-partnerships-business-development-lead",
      "jobTitle": "AI Partnerships & Business Development Lead",
      "companyName": "Subspace Network",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/b41136a5a0561ee4f7b86d02918b6b03.jpg",
      "jobIndustry": ["Business Development"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "We are seeking a Partnerships and Business Development Lead to join our globally distributed and rapidly growing team at the forefront of revolutionizing the AI &gt;&lt; Web3 Landscape. Subspace Labs is an early-stage, venture-backed startup pioneering a new category at the intersection of AI and Web3 as we approach our upcoming network launch. The Subspace Network is&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We are seeking a <b>Partnerships and Business Development Lead</b> to join our globally distributed and rapidly growing team at the forefront of revolutionizing the AI &gt;&lt; Web3 Landscape.</div>\n<div></div>\n<div>Subspace Labs is an early-stage, venture-backed startup pioneering a new category at the intersection of AI and Web3 as we approach our upcoming network launch. The Subspace Network is a radically decentralized, next-generation layer one blockchain powered by an innovative proof-of-archival storage (PoAS) consensus mechanism. Our project serves as a foundation for global collaboration between humans and AI, ushering in a new era of possibilities. Subspace is based on original research funded by the US National Science Foundation.  To learn more, visit our website and read the technical whitepaper.</div>\n<div></div>\n<div>As Partnerships Lead at Subspace,  you will play a pivotal role in driving our business development and ecosystem growth efforts as we approach our upcoming mainnet launch and announcement of our new AI arm. You will do this by establishing new strategic partnerships and business development opportunities with industry leaders in the AI community ( ie: AI startups, companies, and developer communities) and decentralized technology spaces (ie: Protocols, L1s, DAOs), as well as maintaining pre-established relationships with our existing partners.</div>\n<div></div>\n<div>As a key member of our leadership team, you will work alongside key stakeholders, namely our CMO, Head of Product, and Ecosystem Lead to ensure a cohesive and compelling marketing and communications strategy. Your ability to balance strategic planning with hands-on execution will be essential to your success in this role.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities:</h2>\n<ul>\n<li><b>Partner with Subspace Leadership Team</b>: Work closely with our CMO and Product/ Ecosystem Leads to identify key narratives, disseminate brand messaging and grow market awareness.</li>\n<li><b>Establish </b><i><b>New </b></i><b>Strategic Partnerships:</b> Identify, establish and manage strategic partnerships with leading  AI and web3 teams.</li>\n<li><b>Partnership and Collaboration Management:</b> Oversee collaboration efforts with partners, ensuring joint projects are executed effectively and that mutual benefits are maximized.</li>\n<li><b>AI Developer Community Engagement: </b>Drive user growth and brand awareness within the broader AI Developer Ecosystem.</li>\n<li><b>AI Market Analysis &gt; Informed Strategic Proposals : </b>Stay updated on the latest developments, trends and opportunities in the AI, blockchain and decentralized technology sectors and utilize new data to propose strategy (ie: collaborations, product direction, messaging).</li>\n<li><b>Business Development: </b>Identify and actively pursue new business growth opportunities in AI and web3 industries. These could be new markets, products or services.</li>\n<li><b>Events and Networking: </b>Represent the company at relevant industry events, webinars and conferences, driving brand awareness and networking with potential partners.</li>\n<li><b>Negotiation: </b>Lead negotiations with partners and stakeholders, ensuring agreements are beneficial and in line with the company&#8217;s goals and values.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements:</h2>\n<ul>\n<li><b>Travel Flexibility :</b> Ability to travel to Palo Alto on a monthly basis and general travel flexibility  to attend industry conferences and other networking events.</li>\n<li><b>Established AI Network: </b>Established network of contacts, ideally in both the AI and web3 spaces.</li>\n<li><b>AI Domain Knowledge: </b>Deep understanding of Agentic AI, Identity, blockchain, and decentralized technologies, along with their applications and implications for various industries.</li>\n<li><b>Proven Success, Driving High Impact Partnerships: </b>Proven success in identifying and building strategic, high impact partnerships, in line with company goals. Proven ability to negotiate and finalize agreements with partners.</li>\n<li><b>Early Stage Startup Experience:</b> Prior experience bootstrapping or growing an early stage technology startup in our space, ideally as an early hire or founding team member.</li>\n<li><b>Presentation Skills: </b>Excellent presentation skills, with the ability to represent the company to external partners and build brand awareness at industry meetups, conferences and other networking events.</li>\n<li><b>Distributed (Remote) Team Environment:</b> Strong ability to work in a globally distributed team environment, coordinating with multiple internal stakeholders across various time zones.</li>\n</ul>\n<h2><b>What We Offer</b></h2>\n<ul>\n<li>The ability to work from anywhere in the world</li>\n<li>A competitive salary with generous equity and token grants</li>\n<li>Medical, dental, and vision insurance (US-based only)</li>\n<li>A unique opportunity to shape the future of the internet</li>\n<li>Team off-sites in various locations around the globe</li>\n</ul>\n</div>\n</div>",
      "pubDate": "2024-02-24 08:13:21"
    },
    {
      "id": 102088,
      "url": "https://jobicy.com/jobs/102088-senior-product-manager-34",
      "jobSlug": "102088-senior-product-manager-34",
      "jobTitle": "Senior Product Manager",
      "companyName": "Scroll.io",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/105078d294d30c978ca2badf7f376934.jpg",
      "jobIndustry": ["Product &amp; Operations"],
      "jobType": ["full-time"],
      "jobGeo": "Anywhere",
      "jobLevel": "Senior",
      "jobExcerpt": "Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY! We are hiring the senior product manager to execute ongoing developer-facing&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY!</div>\n<div></div>\n<div>We are hiring the senior product manager to execute ongoing developer-facing frontend product initiatives. You will be driving ongoing experimentations of new product-lead initiatives to learn how we can support developer/user growth at all stages (awareness, consideration or retention). Potentially, your initiatives will turn out to be a powerful tool for developer/user growth on which we can double down investment to scale up.</div>\n<h2><b>About Scroll</b></h2>\n<div>Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and community driven.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities</h2>\n<ul>\n<li>Your primary objective is to help Scroll explore growth levers to grow developer communities with a product-driven mindset;</li>\n<li>You absorb ideas from Founders, BD, DevRel, engineers and research from developers, work with cofounders and stakeholders to sponsor your projects;</li>\n<li>Execute project with designers and engineers and share feedback and learnings with stakeholders and initiate projects;</li>\n<li>Part of your job is to craft a good product solution with stakeholders, and you have the space to be creative, and try out new ideas which some of them might turn out to be a long-term growth lever for Scroll;</li>\n<li>In long-term, you will become the thought leader for Scroll and completely own projects and roadmaps;</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements</h2>\n<ul>\n<li>5 experience in working in product management across at least two distinct business domains</li>\n<li>1 year experience in building product in Web3</li>\n<li>Able to identify, prioritize and articulate user problems from noisy data and raw info;</li>\n<li>Able to come up with creative solutions;</li>\n<li>Perfect product execution: on time, high quality with measurable impact and learnings</li>\n<li>Have a good sense of UX craft;</li>\n<li>Familiar and passionate about blockchain ecosystem, and also have an opinion on how the ecosystem will evolve;</li>\n<li>Familiar with Scroll’s tech stack and differentiations</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>About You</h2>\n<ul>\n<li>You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;</li>\n<li>You are responsive, collaborative and committed person with a high work ethic;</li>\n<li>You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;</li>\n<li>You relish working in an agile start-up environment;</li>\n<li>You are a great listener who understands when to listen first and engages well with colleagues;</li>\n<li>You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What We Offer</h2>\n<ul>\n<li>A mission-led, collaborative culture</li>\n<li>Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum</li>\n<li>Competitive salary package / generous paid time off / annual growth budget</li>\n<li>Remote from any location with flexible hours</li>\n<li>Home office set up / co-working membership allowance</li>\n<li>Private healthcare in selected countries</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#8217;ll do our best to accommodate.</div>\n</div>",
      "pubDate": "2024-02-24 08:10:34"
    },
    {
      "id": 102089,
      "url": "https://jobicy.com/jobs/102089-senior-software-engineer-jvm",
      "jobSlug": "102089-senior-software-engineer-jvm",
      "jobTitle": "Senior Software Engineer - JVM",
      "companyName": "Help Scout",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210106163921-999274.jpg",
      "jobIndustry": ["Software Engineering"],
      "jobType": ["full-time"],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "We believe the world would be a better place if businesses treated customers like people. We make support software that empowers more than 12,000 businesses to delight more customers. We&#8217;re a remote company with more than 150 employees in different locations around the world, and we&#8217;ve been remote-first from day one. We believe that when teams represent&#8230;",
      "jobDescription": "<p>We believe the world would be a better place if businesses treated customers like people<strong>.</strong></p>\n<p>We make support software that empowers more than 12,000 businesses to delight more customers. We&#8217;re a remote company with more than 150 employees in different locations around the world, and we&#8217;ve been remote-first from day one. We believe that when teams represent different backgrounds, perspectives, and experiences, magic happens. The result is better products and a culture that enables everyone to bring their authentic selves to work.</p>\n<p><strong>Our Company Values:</strong></p>\n<ul>\n<li>Happy to Help</li>\n<li>Craft over Convention</li>\n<li>Progress not Perfection</li>\n<li>Own the Outcome</li>\n</ul>\n<h2>Your Impact:</h2>\n<p>We  have roles open on three teams:</p>\n<p>As a member of our Platform team, you’ll work on the backbone of innovation, prioritizing scalable and cost-effective solutions to not only meet but exceed the evolving needs of our business and customers.</p>\n<p>As a member of our Mobile team, you’ll be enhancing our mobile apps and SDK products and contributing to the expansion of our mobile platform. These products empower over 11,000 companies around the world to deliver world-class support to their customers.</p>\n<p>As a member of one of our Experience teams, you’ll build software applications and APIs, creating delightful product features for our customers to either increase their productivity, ensure their customer service is proactive, personalized, and meaningful, or knowledge based.</p>\n<p>The ideal engineer for this position enjoys building and collaborating on elegant solutions. You’re keen on the opportunity to tackle both customer and product-oriented problems.</p>\n<h2>Currently at Help Scout:</h2>\n<ul>\n<li>We develop in Java, Kotlin, JavaScript and PHP</li>\n<li>We leverage AWS, Redis, RabbitMQ, Aurora MySQL, PostgreSQL, MongoDB</li>\n<li>We also use Slack, Jira, Github, Jenkins, Docker, Drone</li>\n</ul>\n<h2><strong>Time Zone Note:</strong></h2>\n<p>At this time, we are only able to hire in the United States for this role. Given that we have remote team members living between European and US time zones, we require that your regular working hours overlap with 9 AM &#8211; 1 PM ET to ensure several solid blocks of overlap time with your team members.</p>\n<h2>About the role:</h2>\n<ul>\n<li>You’ll work with Java and Kotlin, and collaborate with JVM, JavaScript, and PHP Engineers, project and product managers, and designers within an engineering team of about 50 people.</li>\n<li>You’ll be a part of key decisions on implementation, testing, and backlog prioritization, code reviews, and architectural decisions.</li>\n<li>You’ll participate in an iterative software approach, remote, agile development, and autonomous work in a trust-based environment.</li>\n<li>You’ll provide engineering support focusing on performance, security, and usability, to ensure a magical customer experience.</li>\n<li>You can expect challenges from our product team, and you’ll work with our technically-committed founders to create impactful solutions for businesses globally.</li>\n<li>You’ll partner with our Talent team to help us hire our future team members when needed.</li>\n</ul>\n<h2>About you:</h2>\n<ul>\n<li>You’re an engineer motivated by creating software that helps people, with Java expertise to deliver outstanding experiences.</li>\n<li>You’re experienced in crafting relevant, customer-focused solutions, enthusiastic about the JVM ecosystem, and comfortable with high traffic volumes.</li>\n<li>You’re friendly, collaborative, and humble, unafraid to ask for help, ready for complex challenges, and confident in your abilities.</li>\n<li>You emphasize personal growth and constructive feedback, believing in improving both yourself and the team.</li>\n<li>You communicate empathetically and collaboratively with both engineering and non-engineering stakeholders, recognizing the importance of clear communication in a remote culture.</li>\n<li>You are considerate in your impact on others, with a thoughtful, flexible approach to mentoring and guiding decisions, leaving codebases better than you found them.</li>\n<li>You are aligned with or excited about the idea of remote teams, having experience or adaptability to remote-friendly work.</li>\n</ul>\n<h2><strong>Compensation:</strong></h2>\n<p>Each role at Help Scout has a pay range aligned to our salary formula and based on national market data. We take a competency-based approach and pay is based on the level and band of your role. We assess leveling during the hiring process for new teammates, during our bi-annual performance review cycles, and when a teammate’s role changes.</p>\n<p>Our remote compensation philosophy is not based on the employee’s geographic location. You are paid the same no matter where you live.</p>\n<p><strong>The salary range for this role is $147,000-$168,000.</strong></p>\n<h2>Perks &amp; Benefits:</h2>\n<p>Help Scout offers a variety of perks and benefits to support you and your family. Our offerings include healthcare coverage, wellness resources, and so much more. Visit our careers page to learn more.</p>\n<h2>Hiring Guidelines:</h2>\n<p>All of our roles are remote, however, some roles may carry specific location-based eligibility requirements. Additionally, because Help Scout is a fully remote company and we hire from many countries, we do not sponsor visas. Help Scout teammates need to be authorized to work from their home location.</p>\n<p>For our Engineering, Product Management, and Product Design roles, we are only able to hire in the <strong>United States</strong>.</p>",
      "pubDate": "2024-02-24 08:09:35",
      "annualSalaryMin": "147000",
      "annualSalaryMax": "168000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103514,
      "url": "https://jobicy.com/jobs/103514-document-management-specialist-technical-writer",
      "jobSlug": "103514-document-management-specialist-technical-writer",
      "jobTitle": "Document Management Specialist/ Technical Writer",
      "companyName": "Andersen Lab",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/02/2eebf607-221.jpeg",
      "jobIndustry": ["Copywriting &amp; Content"],
      "jobType": ["full-time"],
      "jobGeo": "Europe",
      "jobLevel": "Any",
      "jobExcerpt": "The international IT-company Andersen invites a Document Management Specialist/Technical Writer on a project in the field of IT Consulting. The customer is a leading German service provider for technical communication. For more than 35 years, it has been offering relevant content, expressive design, digital tools, IT processes, and IT infrastructure for the efficient implementation of&#8230;",
      "jobDescription": "<div class=\"PositionDescription_item__Ge_iX\">\n<p class=\"PositionDescription_subtext__a3mMe\">The international IT-company Andersen invites a Document Management Specialist/Technical Writer on a project in the field of IT Consulting.</p>\n<p class=\"PositionDescription_subtext__a3mMe\">The customer is a leading German service provider for technical communication. For more than 35 years, it has been offering relevant content, expressive design, digital tools, IT processes, and IT infrastructure for the efficient implementation of digitalization strategies. The company&#8217;s clients come from all B2B sectors. It has more than 150 professionals working in 10 offices throughout Germany, as well as subsidiaries in Switzerland and Vietnam.</p>\n<p class=\"PositionDescription_subtext__a3mMe\">The task is documentation management over the customer&#8217;s internal system.</p>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Responsibilities</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Reviewing the manual provided in German and translating its contents using translation tools if necessary.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Attaching the manual to the project to facilitate access to information.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Analyzing OIS (Order of Instruction Sheet) orders to gather information about the machine and options.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Registering machines and customer information in the CRM system.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Selecting the appropriate documentation for each machine based on OIS data.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Registering new manuals.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Sending manuals for translation to designers and translators.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Registering orders, proposals, and invoices in SAP.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Creating declarations upon completion of translations.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Demanding continuous attention to detail and a focus on tasks.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Efficiently managing multi-step processes to ensure smooth operations.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Taking part in meetings with customers in English and in German.</li>\n</ul>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Requirements</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience as a Technical Writer for 1,5+ years.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Skills in locating drawings/documents on Japanese servers.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Understanding the information stored on the FTP server and the ability to upload information to this server.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience in creating, maintaining, analyzing and systematizing project documentation (work with requirements, creating diagrams, charts, etc.).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Strong analytical skills to critically evaluate information from multiple sources with good prioritizing tasks.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Good technical understanding and ability to navigate new topics and tools quickly.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Level of English – from Intermediate and above.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Level of German – from Upper-Intermediate and above.</li>\n</ul>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Desired skills</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Technical background.</li>\n</ul>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Reasons to join us</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson &amp; Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc..</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">The opportunity to change the project and/or develop expertise in an interesting business domain.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">The opportunity to earn additional up to 1,700 EUR per month by participating in the company&#8217;s activities.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Certification compensation (AWS, PMP, etc).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Referral program.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">English courses.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Private health insurance and compensation for sports activities.</li>\n</ul>\n</div>",
      "pubDate": "2024-02-23 20:32:48"
    },
    {
      "id": 103513,
      "url": "https://jobicy.com/jobs/103513-java-developer-2",
      "jobSlug": "103513-java-developer-2",
      "jobTitle": "Java Developer",
      "companyName": "Andersen Lab",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/02/2eebf607-221.jpeg",
      "jobIndustry": ["Programming"],
      "jobType": ["full-time"],
      "jobGeo": "Europe",
      "jobLevel": "Any",
      "jobExcerpt": "The international IT-company Andersen invites an experienced Java Developer to work on a large-scale project for one of our customers based in the USA. The customer is a leader in cloud-based communications and collaboration software. The company integrates with various business applications and platforms, such as Google Workspace, Microsoft 365, Salesforce, Zendesk, and more. It&#8230;",
      "jobDescription": "<div class=\"PositionDescription_item__Ge_iX\">\n<p class=\"PositionDescription_subtext__a3mMe\">The international IT-company Andersen invites an experienced Java Developer to work on a large-scale project for one of our customers based in the USA.</p>\n<p class=\"PositionDescription_subtext__a3mMe\">The customer is a leader in cloud-based communications and collaboration software. The company integrates with various business applications and platforms, such as Google Workspace, Microsoft 365, Salesforce, Zendesk, and more. It has a global presence and a diverse customer base, serving more than 400,000 businesses in over 100 countries. The company is recognized as a 2023 Gartner Magic Quadrant Leader for UCaaS worldwide.</p>\n<p class=\"PositionDescription_subtext__a3mMe\">The project is to develop a public REST API for the Unified Communications service and specialize in how applications (mobile, desktop, browser) interact with this service. The API includes the ability to manage calls and video conferences, send text messages, faxes, SMS and MMS messages, configure the service for the user, and data access.</p>\n<p class=\"PositionDescription_subtext__a3mMe\">Technology stack: Java, Jetty, Spring Boot, Nginx, MongoDB, Apache Kafka, GridGain (Apache Ignite), Amazon Aurora, ELK, Docker, Kubernetes, TICK.</p>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Requirements</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience as a Java Developer for 3+ years.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience of Spring Boot framework.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience with creation of REST API web services and SOA applications.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Knowledge of AWS technologies (EKS, EC2, Aurora, S3).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Strong command of SQL.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Well understanding of microservices architecture; principles of work or load balancing, service discovery, API Gateway.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Strong knowledge of object-oriented methodology, design patterns (OOD Patterns).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Following common software engineering practices &#8211; unit tests creation, code review, etc.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Level of English – from Intermediate and above.</li>\n</ul>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Desired skills</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Knowledge of Kubernetes.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience of Jetty server.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Well understanding principles of services protection.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Well understanding principles investigation issues of embedded software on PROD.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience with metrics (Telegraf, Zabbix preferable) and logs usage, dumps analysis.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience writing documentation and conducting technical correspondence.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience of Google Guice framework.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Knowledge of Linux.</li>\n</ul>\n</div>\n<div class=\"PositionDescription_item__Ge_iX\">\n<h2 class=\"Title_title__mv7GI PositionDescription_title__dB_a2 Title_h2__PFRg0 Title_black__siHuf\">Reasons to join us</h2>\n<ul class=\"List_list__yEqNi List_checked__KCF1S\">\n<li class=\"List_item__91F10 List_md__gLDdg\">Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson &amp; Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc..</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">The opportunity to change the project and/or develop expertise in an interesting business domain.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">The opportunity to earn additional up to 1,700 EUR per month by participating in the company&#8217;s activities.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Certification compensation (AWS, PMP, etc).</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Referral program.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">English courses.</li>\n<li class=\"List_item__91F10 List_md__gLDdg\">Private health insurance and compensation for sports activities.</li>\n</ul>\n</div>",
      "pubDate": "2024-02-23 20:30:50"
    },
    {
      "id": 103496,
      "url": "https://jobicy.com/jobs/103496-online-store-tier-2-customer-support",
      "jobSlug": "103496-online-store-tier-2-customer-support",
      "jobTitle": "Online Store - Tier 2 Customer Support",
      "companyName": "ModSquad",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
      "jobIndustry": ["Customer Success"],
      "jobType": ["contract"],
      "jobGeo": "LATAM",
      "jobLevel": "Any",
      "jobExcerpt": "ModSquad has partnered with multiple top-tier brands/clients across the globe and we need the best of the best in Customer Support! Do you have a Customer Support background? Do you enjoy work-from-home and flexible schedules? ModSquad is seeking Mod Contractors to join our network! If you want the chance to work gigs on the coolest of client projects&#8230;then ModSquad&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div><b>ModSquad</b> has partnered with multiple top-tier brands/clients across the globe and we need the best of the best in <b>Customer Support</b>!</div>\n<div></div>\n<div>Do you have a <b>Customer Support</b> background? Do you enjoy work-from-home and flexible schedules? ModSquad is seeking Mod Contractors to join our network!</div>\n<div></div>\n<div>If you want the chance to work gigs on the coolest of client projects&#8230;then <b>ModSquad is the place for you!! </b>Our clients are strictly Top Tier whose product offerings and services are hip, contemporary, and very current. You will instantly know who they are and very likely use them yourselves. Their customers expect the best service and support and that&#8217;s where we come in.</div>\n<div></div>\n<div>Our Mods bring super skills, a positive attitude, and a great vibe to project work every day. Mods assist and guide customers to the right answers, solve concerns and are the GPS for customers to understand and optimize the best use of a client&#8217;s product or services. Project gigs are available now and more are on the horizon.</div>\n<div></div>\n<div><b>Project Hours (All Times Pacific): </b>24/7</div>\n<div></div>\n<div><b>Hourly Rate: </b>To be discussed in the interview phase</div>\n<div></div>\n<div><b>Commitment: </b>15 hours per week, 90 days (as needed)</div>\n<div></div>\n<div><b>Language: </b>English</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What We Are Looking For:</h2>\n<ul>\n<li>Customer Support experience is a must (phones, chats and emails)</li>\n<li>Hands-on experience with helping and guiding customers to troubleshoot issues step-by-step</li>\n<li>Hard-wired (preferred), stable and reliable internet connection</li>\n<li>Wired headset (no bluetooth/wireless)</li>\n<li>Quiet area to take calls</li>\n<li>Good attitude</li>\n<li>Positive, helpful and proactive</li>\n<li>Must be reliable and responsible</li>\n<li>Comfortable with navigating large amounts of information and resources, following workflows</li>\n<li>Comfortable with walking the customer through clearing browser cache and cookies and minor technical troubleshooting steps</li>\n<li>Able to test issues on their own</li>\n<li>CRM Tool Experience (similar to Intercom, Zendesk, etc)</li>\n<li>E-commerce experience is a plus</li>\n<li>Chinese speaking/able to read Chinese is a plus</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>WorkSpace Requirements:</h2>\n<ul>\n<li>Dedicated laptop or desktop computer with Windows 10 or above</li>\n<li>Willingness to install MSQ security software and 2FA app on the phone</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What’s In It For You:</h2>\n<ul>\n<li>The potential to work with some of the coolest clients around the world like the NFL, Vimeo, and Topps!</li>\n<li>Flexible self-scheduling</li>\n<li>Access to ‘Hot Gigs’ postings exclusive to the Mod Network</li>\n<li>Work from home</li>\n<li>Competitive hourly rate &#8211; Discussed during your first interview</li>\n<li>Paid orientation</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div><b>***PRO TIP***: Take your time and make sure you do a thorough job in completing your application. Your responses should be grammatically correct and comprehensive. This will greatly increase the probability of scoring an interview!</b></div>\n<div></div>\n<div><b>Please note: A Chromebook is not sufficient for ModSquad projects.</b></div>\n<h2><b>Who is ModSquad?</b></h2>\n<div>ModSquad is a global provider of managed digital engagement services. Our 10,000+ Mods chat with customers, moderate web content, manage communities, and buzz in social media for many of the world’s coolest brands, including the NFL, Zendesk, and Topps, to name a few. We bring companies closer to their customers than ever before. From global enterprises to international agencies to hip new startups, our clients have reaped the benefits of putting ModSquad&#8217;s expertise to work. With experienced Mods available in 50+ languages in 70+ countries, we’re your squad for the digital world.</div>\n<div></div>\n</div>",
      "pubDate": "2024-02-23 08:31:58"
    },
    {
      "id": 103495,
      "url": "https://jobicy.com/jobs/103495-customer-support-japanese-music-streaming-service",
      "jobSlug": "103495-customer-support-japanese-music-streaming-service",
      "jobTitle": "Customer Support - Japanese - Music Streaming Service",
      "companyName": "ModSquad",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
      "jobIndustry": ["Customer Success"],
      "jobType": ["contract"],
      "jobGeo": "Japan",
      "jobLevel": "Any",
      "jobExcerpt": "ModSquad has partnered with a top music streaming service and we are currently seeking music-lovers that want to join our team. We are currently seeking experienced Customer Support Representatives who are passionate about providing world-class support. This is a fully remote opportunity and as a member of this team, you will respond to customer inquiries via inbound messages in Japanese. Commitment:&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div><b>ModSquad</b> has partnered with a <b>top music streaming service</b> and we are currently seeking music-lovers that want to join our team. We are currently seeking experienced Customer Support Representatives who are passionate about providing world-class support.</div>\n<div></div>\n<div>This is a <b>fully remote opportunity</b> and as a member of this team, you will respond to customer inquiries via inbound messages in <b>Japanese</b>.</div>\n<div></div>\n<div><b>Commitment: </b>25 hours per week (8 hours required over Saturday and/or Sunday) 90 days</div>\n<div></div>\n<div><b>Orientation specifics (all times Pacific Standard Time):<br />\n</b>Orientation: 4 days, 4 AM &#8211; 1 PM<br />\nNesting: 15 days, 4 AM &#8211; 1 PM<br />\nProduction: Daily, 9 AM &#8211; 10 PM. At least 8 hours required over <b>Saturday and/or Sunday</b></div>\n<div></div>\n<div>Please note: In order to ensure adequate proficiency, qualified applicants will have to complete language assessments in <b>Japanese</b> and <b>English</b>.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What We Are Looking For:</h2>\n<ul>\n<li>Ability to quickly identify any and all issues the customer may have</li>\n<li>Ability to maintain high engagement with both the project and customers</li>\n<li>Someone who wants to help the customer, not just move to the next one</li>\n<li>People driven to do more for the customer and exercise good judgement in their favor when the opportunity presents itself</li>\n<li>Customer service experience; familiarity handling chats</li>\n<li>Professional/business level proficiency in <b>Japanese</b> and <b>English</b></li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>WorkSpace Requirements:</h2>\n<ul>\n<li>Dedicated laptop or desktop computer with Windows 10 or above</li>\n<li>Willingness to install MSQ security software and 2FA app on the phone</li>\n<li>Access to a webcam or smartphone capable of taking pictures</li>\n<li>Stable broadband internet connection of 25 MBS or greater</li>\n<li>8 GB RAM or better</li>\n<li>Dual monitors highly recommended</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div><b>***IMPORTANT***: Take your time and make sure you do a thorough job in completing your application. Your responses should be grammatically correct (punctuation, capitalization, spelling, correct tense usage) and comprehensive. This will greatly increase the probability of scoring an interview!</b></div>\n<div></div>\n<div><b>Please note:  A Chromebook is not sufficient for ModSquad projects.</b></div>\n<h2><b>Who is ModSquad?</b></h2>\n<div>ModSquad is a global provider of managed digital engagement services. Our 10,000+ Mods chat with customers, moderate web content, manage communities, and buzz in social media for many of the world’s coolest brands, including the NFL, Zendesk, and Topps, to name a few. We bring companies closer to their customers than ever before. From global enterprises to international agencies to hip new startups, our clients have reaped the benefits of putting ModSquad&#8217;s expertise to work. With experienced Mods available in 50+ languages in 70+ countries, we’re your squad for the digital world.</div>\n<div></div>\n<div><i>ModSquad is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), gender, national origin, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.  ***Pay rates vary by client and are not negotiable. Rates will be disclosed during the interview process</i></div>\n</div>",
      "pubDate": "2024-02-23 08:28:51"
    }
  ]
}
